[Killed] ConditionalExpression
catalog/application/use-cases/submit-puzzle-definition.ts:63:9
 
     // A trusted submitter (admin) skips moderation: approve in the same transaction so the
     // definition is publicly listable immediately. Both Submitted + Approved events are emitted.
-    if (cmd.autoApprove) {
+    if (false) {
       const approved = definition.value.approve(deps.clock.now());
       // Stryker disable next-line ConditionalExpression: `definition` was just created by submit(),
killedBy: Catalog PuzzleDefinition use cases auto-approves the submission when autoApprove is set, saving it approved and emitting both events
statusReason: expected 'pending' to be 'approved' // Object.is equality

[Killed] EqualityOperator
catalog/application/use-cases/submit-puzzle-definition.ts:87:63
     cmd.barcodes?.ean,
     cmd.barcodes?.upc,
     cmd.barcodes?.modelNumber,
-  ].filter((value): value is string => value !== undefined && value.length > 0);
+  ].filter((value): value is string => value !== undefined && value.length <= 0);
 
   for (const barcode of candidates) {
killedBy: Catalog PuzzleDefinition use cases rejects a duplicate barcode via the repository (DuplicateBarcode)
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
catalog/application/use-cases/submit-puzzle-definition.ts:87:40
     cmd.barcodes?.ean,
     cmd.barcodes?.upc,
     cmd.barcodes?.modelNumber,
-  ].filter((value): value is string => value !== undefined && value.length > 0);
+  ].filter((value): value is string => value !== undefined || value.length > 0);
 
   for (const barcode of candidates) {
killedBy: Catalog PuzzleDefinition use cases submits a definition, saving state and publishing PuzzleDefinitionSubmitted
statusReason: Cannot read properties of undefined (reading 'length')
