[Killed] ArrayDeclaration
src/catalog/domain/puzzle-definition.ts:82:35
 }
 
 export class PuzzleDefinition {
-  private events: DomainEvent[] = [];
+  private events: DomainEvent[] = ["Stryker was here"];
 
   private constructor(private state: PuzzleDefinitionState) {}
killedBy: PuzzleDefinition.submit starts pending and records PuzzleDefinitionSubmitted with the submitter
statusReason: expected [ undefined, …(1) ] to deeply equal [ 'PuzzleDefinitionSubmitted' ]

[Killed] ConditionalExpression
src/catalog/domain/puzzle-definition.ts:100:9
   static submit(
     props: SubmitPuzzleDefinitionProps,
   ): Result<PuzzleDefinition, CatalogError> {
-    if (props.title.trim().length === 0) return err(CatalogError.emptyTitle());
+    if (true) return err(CatalogError.emptyTitle());
 
     const pieceCount = PieceCount.create(props.pieceCount);
killedBy: PuzzleDefinition.submit starts pending and records PuzzleDefinitionSubmitted with the submitter
statusReason: setup failed: A puzzle definition requires a non-empty title

[Killed] MethodExpression
src/catalog/domain/puzzle-definition.ts:100:9
   static submit(
     props: SubmitPuzzleDefinitionProps,
   ): Result<PuzzleDefinition, CatalogError> {
-    if (props.title.trim().length === 0) return err(CatalogError.emptyTitle());
+    if (props.title.length === 0) return err(CatalogError.emptyTitle());
 
     const pieceCount = PieceCount.create(props.pieceCount);
killedBy: PuzzleDefinition.submit trims the title and rejects a blank one
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/catalog/domain/puzzle-definition.ts:156:35
   // Admin reversibly disables an approved definition, hiding it from public browse/search.
   // Nothing is deleted; existing copies keep rendering from their cached snapshots.
   disable(now: Date): Result<void, CatalogError> {
-    const moved = this.transition("disabled", now);
+    const moved = this.transition("", now);
     if (moved.isErr) return moved;
     this.record(new PuzzleDefinitionDisabled(this.id, now));
killedBy: disable / re-enable lifecycle disables an approved definition, recording PuzzleDefinitionDisabled
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/catalog/domain/puzzle-definition.ts:184:9
     now: Date,
   ): Result<void, CatalogError> {
     let title = this.state.title;
-    if (changes.title !== undefined) {
+    if (changes.title === undefined) {
       if (changes.title.trim().length === 0)
         return err(CatalogError.emptyTitle());
killedBy: makeApproveChangeProposal approves the proposal AND applies the patch to the definition, publishing both batches
statusReason: expected 'Starry Night' to be 'Corrected' // Object.is equality

[Killed] ConditionalExpression
src/catalog/domain/puzzle-definition.ts:185:11
   ): Result<void, CatalogError> {
     let title = this.state.title;
     if (changes.title !== undefined) {
-      if (changes.title.trim().length === 0)
+      if (false)
         return err(CatalogError.emptyTitle());
       title = changes.title.trim();
killedBy: makeApproveChangeProposal saves NOTHING when the definition rejects the patch (invalid stored proposal)
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/catalog/domain/puzzle-definition.ts:191:43
     }
 
     let pieceCount = this.state.pieceCount;
-    if (changes.pieceCount !== undefined) {
-      const validated = PieceCount.create(changes.pieceCount);
-      if (validated.isErr) return err(validated.error);
-      pieceCount = validated.value.value;
-    }
+    if (changes.pieceCount !== undefined) {}
 
     let barcodeFields: Pick<
killedBy: update re-validates patched title, pieceCount and barcodes
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/catalog/domain/puzzle-definition.ts:191:9
     }
 
     let pieceCount = this.state.pieceCount;
-    if (changes.pieceCount !== undefined) {
+    if (changes.pieceCount === undefined) {
       const validated = PieceCount.create(changes.pieceCount);
       if (validated.isErr) return err(validated.error);
killedBy: makeApproveChangeProposal approves the proposal AND applies the patch to the definition, publishing both batches
statusReason: expected 1000 to be 500 // Object.is equality

[Killed] ConditionalExpression
src/catalog/domain/puzzle-definition.ts:205:9
       upc: this.state.upc,
       modelNumber: this.state.modelNumber,
     };
-    if (changes.barcodes !== undefined) {
+    if (false) {
       const validated = validateBarcodes(changes.barcodes);
       if (validated.isErr) return err(validated.error);
killedBy: update re-validates patched title, pieceCount and barcodes
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/catalog/domain/puzzle-definition.ts:205:9
       upc: this.state.upc,
       modelNumber: this.state.modelNumber,
     };
-    if (changes.barcodes !== undefined) {
+    if (changes.barcodes === undefined) {
       const validated = validateBarcodes(changes.barcodes);
       if (validated.isErr) return err(validated.error);
killedBy: update patches descriptive fields and records PuzzleDefinitionUpdated
statusReason: Cannot read properties of undefined (reading 'ean')

[Killed] ObjectLiteral
src/catalog/domain/puzzle-definition.ts:208:23
     if (changes.barcodes !== undefined) {
       const validated = validateBarcodes(changes.barcodes);
       if (validated.isErr) return err(validated.error);
-      barcodeFields = {
-        ean: validated.value.ean?.value,
-        upc: validated.value.upc?.value,
-        modelNumber: validated.value.modelNumber?.value,
-      };
+      barcodeFields = {};
     }
 
killedBy: update re-flattens validated barcodes into the state columns on update
statusReason: expected undefined to be '4006381333931' // Object.is equality

[Killed] LogicalOperator
src/catalog/domain/puzzle-definition.ts:222:15
       ...barcodeFields,
       description: changes.description ?? this.state.description,
       brand: changes.brand ?? this.state.brand,
-      artist: changes.artist ?? this.state.artist,
+      artist: changes.artist && this.state.artist,
       series: changes.series ?? this.state.series,
       dimensions: changes.dimensions ?? this.state.dimensions,
killedBy: update sets each previously-unset descriptive field from its change
statusReason: expected undefined to be 'An Artist' // Object.is equality

[Killed] BlockStatement
src/catalog/domain/puzzle-definition.ts:239:28
   // Derived projection for full-text search — NEVER authored or stored state. Recomputed on
   // demand from the searchable fields; the persistence adapter materialises it into the
   // `puzzles.searchableText` column.
-  searchableText(): string {
-    return [
-      this.state.title,
-      this.state.brand,
-      this.state.artist,
-      this.state.series,
-      ...(this.state.tags ?? []),
-    ]
-      .filter((part): part is string => part !== undefined && part.length > 0)
-      .join(" ");
-  }
+  searchableText(): string {}
 
   // Drain recorded events for the publisher; clears the buffer so a save can't double-emit.
killedBy: searchableText (derived projection) joins title, brand, artist, series and tags, skipping empties
statusReason: expected undefined to be 'Starry Night Ravensburger Van Gogh Ma…' // Object.is equality

[Killed] MethodExpression
src/catalog/domain/puzzle-definition.ts:240:12
   // demand from the searchable fields; the persistence adapter materialises it into the
   // `puzzles.searchableText` column.
   searchableText(): string {
-    return [
-      this.state.title,
-      this.state.brand,
-      this.state.artist,
-      this.state.series,
-      ...(this.state.tags ?? []),
-    ]
-      .filter((part): part is string => part !== undefined && part.length > 0)
+    return [this.state.title, this.state.brand, this.state.artist, this.state.series, ...(this.state.tags ?? [])]
       .join(" ");
   }
killedBy: searchableText (derived projection) omits the tags segment entirely when no tags are set
statusReason: expected 'Solo Brand  ' to be 'Solo Brand' // Object.is equality

[Killed] LogicalOperator
src/catalog/domain/puzzle-definition.ts:245:11
       this.state.brand,
       this.state.artist,
       this.state.series,
-      ...(this.state.tags ?? []),
+      ...(this.state.tags && []),
     ]
       .filter((part): part is string => part !== undefined && part.length > 0)
killedBy: searchableText (derived projection) joins title, brand, artist, series and tags, skipping empties
statusReason: expected 'Starry Night Ravensburger Van Gogh Ma…' to be 'Starry Night Ravensburger Van Gogh Ma…' // Object.is equality

[Killed] ConditionalExpression
src/catalog/domain/puzzle-definition.ts:247:41
       this.state.series,
       ...(this.state.tags ?? []),
     ]
-      .filter((part): part is string => part !== undefined && part.length > 0)
+      .filter((part): part is string => false)
       .join(" ");
   }
killedBy: searchableText (derived projection) joins title, brand, artist, series and tags, skipping empties
statusReason: expected '' to be 'Starry Night Ravensburger Van Gogh Ma…' // Object.is equality

[Killed] ConditionalExpression
src/catalog/domain/puzzle-definition.ts:274:9
     to: ApprovalStatus,
     now: Date,
   ): Result<void, CatalogError> {
-    if (!ALLOWED_APPROVAL_TRANSITIONS[this.state.status].includes(to)) {
+    if (true) {
       return err(CatalogError.illegalApprovalTransition(this.state.status, to));
     }
killedBy: approval lifecycle approves a pending definition, recording PuzzleDefinitionApproved
statusReason: expected false to be true // Object.is equality
