[Killed] MethodExpression
notifications/application/use-cases/notify-member.ts:49:21
     const preference = await loadPreference(deps, cmd.memberId);
 
     const candidates: readonly Channel[] = cmd.channels ?? CHANNELS;
-    const allowed = candidates.filter((channel) =>
-      preference.allows(cmd.type, channel),
-    );
+    const allowed = candidates;
 
     const created: NotificationId[] = [];
killedBy: makeNotifyMember creates one in-app notification by default (no stored preference)
statusReason: expected [ 'ntf-1', 'ntf-2', 'ntf-3' ] to have a length of 1 but got 3

[Killed] ArrowFunction
notifications/application/use-cases/notify-member.ts:49:39
     const preference = await loadPreference(deps, cmd.memberId);
 
     const candidates: readonly Channel[] = cmd.channels ?? CHANNELS;
-    const allowed = candidates.filter((channel) =>
-      preference.allows(cmd.type, channel),
+    const allowed = candidates.filter(() => undefined,
     );
 
killedBy: makeNotifyMember creates one in-app notification by default (no stored preference)
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
notifications/application/use-cases/notify-member.ts:57:36
     const pending: DomainEvent[] = [];
     const now = deps.clock.now();
 
-    for (const channel of allowed) {
-      const notification = Notification.create({
-        id: deps.notificationIds.next(),
-        userId: cmd.memberId,
-        type: cmd.type,
-        title: cmd.title,
-        message: cmd.message,
-        relatedId: cmd.relatedId,
-        channel,
-        now,
-      });
-      // Delivery owns the medium: in-app persists, email/push dispatch out-of-band. The use case
-      // stays oblivious to which, and must NOT also persist or in-app rows would double-write.
-      await deps.delivery.deliver(channel, notification);
-      created.push(notification.id);
-      pending.push(...notification.pullEvents());
-    }
+    for (const channel of allowed) {}
 
     if (pending.length > 0) {
killedBy: makeNotifyMember creates one in-app notification by default (no stored preference)
statusReason: expected [] to have a length of 1 but got +0

[Killed] ObjectLiteral
notifications/application/use-cases/notify-member.ts:58:48
     const now = deps.clock.now();
 
     for (const channel of allowed) {
-      const notification = Notification.create({
-        id: deps.notificationIds.next(),
-        userId: cmd.memberId,
-        type: cmd.type,
-        title: cmd.title,
-        message: cmd.message,
-        relatedId: cmd.relatedId,
-        channel,
-        now,
-      });
+      const notification = Notification.create({});
       // Delivery owns the medium: in-app persists, email/push dispatch out-of-band. The use case
       // stays oblivious to which, and must NOT also persist or in-app rows would double-write.
killedBy: makeNotifyMember creates one in-app notification by default (no stored preference)
statusReason: Cannot read properties of undefined (reading 'channel')

[Killed] EqualityOperator
notifications/application/use-cases/notify-member.ts:75:9
       pending.push(...notification.pullEvents());
     }
 
-    if (pending.length > 0) {
+    if (pending.length <= 0) {
       await deps.events.publish(pending);
     }
killedBy: makeNotifyMember creates one in-app notification by default (no stored preference)
statusReason: expected [] to deeply equal [ 'NotificationCreated' ]
