[Killed] BlockStatement
src/notifications/domain/notification-preference.ts:23:72
 
 // Build the sensible default toggle map: every type enabled on inApp, email/push off. This is the
 // policy a member with no stored preference gets (the application layer materialises one of these).
-const defaultToggles = (): Record<NotificationType, ChannelToggles> => {
-  const map = {} as Record<NotificationType, ChannelToggles>;
-  for (const type of NOTIFICATION_TYPES) {
-    map[type] = { inApp: true, email: false, push: false };
-  }
-  return map;
-};
+const defaultToggles = (): Record<NotificationType, ChannelToggles> => {};
 
 // NotificationPreference: the per-member aggregate root governing which (type, channel) deliveries
killedBy: makeUpdateNotificationPreference materialises a default preference then toggles a channel on; allows() reflects it
statusReason: Cannot read properties of undefined (reading 'trade_request')

[Killed] BlockStatement
src/notifications/domain/notification-preference.ts:25:42
 // policy a member with no stored preference gets (the application layer materialises one of these).
 const defaultToggles = (): Record<NotificationType, ChannelToggles> => {
   const map = {} as Record<NotificationType, ChannelToggles>;
-  for (const type of NOTIFICATION_TYPES) {
-    map[type] = { inApp: true, email: false, push: false };
-  }
+  for (const type of NOTIFICATION_TYPES) {}
   return map;
 };
killedBy: makeNotifyMember creates one in-app notification by default (no stored preference)
statusReason: Cannot read properties of undefined (reading 'inApp')

[Killed] BlockStatement
src/notifications/domain/notification-preference.ts:64:61
   // Does this member accept a notification of `type` on `channel`? A type absent from the stored
   // map falls back to that type's default toggles (see `defaultToggles`) -- absent means "never
   // asked", not "opted out". An explicitly stored value, even a disabled one, always wins.
-  allows(type: NotificationType, channel: Channel): boolean {
-    const stored = this.state.toggles[type];
-    if (stored) {
-      return stored[channel] === true;
-    }
-    return defaultToggles()[type][channel] === true;
-  }
+  allows(type: NotificationType, channel: Channel): boolean {}
 
   // Turn a (type, channel) delivery on. Records PreferenceChanged only when it actually changed.
killedBy: NotificationPreference.createDefault enables every type on inApp and disables email/push by default
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/notifications/domain/notification-preference.ts:66:9
   // asked", not "opted out". An explicitly stored value, even a disabled one, always wins.
   allows(type: NotificationType, channel: Channel): boolean {
     const stored = this.state.toggles[type];
-    if (stored) {
+    if (true) {
       return stored[channel] === true;
     }
killedBy: NotificationPreference with a sparse (rehydrated) toggle map falls back to the type's default toggles when the type is absent from the stored map
statusReason: Cannot read properties of undefined (reading 'inApp')

[Killed] ConditionalExpression
src/notifications/domain/notification-preference.ts:66:9
   // asked", not "opted out". An explicitly stored value, even a disabled one, always wins.
   allows(type: NotificationType, channel: Channel): boolean {
     const stored = this.state.toggles[type];
-    if (stored) {
+    if (false) {
       return stored[channel] === true;
     }
killedBy: makeUpdateNotificationPreference materialises a default preference then toggles a channel on; allows() reflects it
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/notifications/domain/notification-preference.ts:67:14
   allows(type: NotificationType, channel: Channel): boolean {
     const stored = this.state.toggles[type];
     if (stored) {
-      return stored[channel] === true;
+      return stored[channel] !== true;
     }
     return defaultToggles()[type][channel] === true;
killedBy: makeUpdateNotificationPreference materialises a default preference then toggles a channel on; allows() reflects it
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/notifications/domain/notification-preference.ts:67:14
   allows(type: NotificationType, channel: Channel): boolean {
     const stored = this.state.toggles[type];
     if (stored) {
-      return stored[channel] === true;
+      return true;
     }
     return defaultToggles()[type][channel] === true;
killedBy: NotificationPreference.createDefault enables every type on inApp and disables email/push by default
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/notifications/domain/notification-preference.ts:69:48
     if (stored) {
       return stored[channel] === true;
     }
-    return defaultToggles()[type][channel] === true;
+    return defaultToggles()[type][channel] === false;
   }
 
killedBy: NotificationPreference with a sparse (rehydrated) toggle map falls back to the type's default toggles when the type is absent from the stored map
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/notifications/domain/notification-preference.ts:69:12
     if (stored) {
       return stored[channel] === true;
     }
-    return defaultToggles()[type][channel] === true;
+    return true;
   }
 
killedBy: NotificationPreference with a sparse (rehydrated) toggle map falls back to the type's default toggles when the type is absent from the stored map
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/notifications/domain/notification-preference.ts:107:11
     channel: Channel,
     enabled: boolean,
     now: Date,
-  ): void {
-    if (this.allows(type, channel) === enabled) {
-      return;
-    }
-    const current = this.state.toggles[type] ?? this.emptyChannelToggles();
-    const nextForType: ChannelToggles = { ...current, [channel]: enabled };
-    this.state = {
-      ...this.state,
-      toggles: { ...this.state.toggles, [type]: nextForType },
-      updatedAt: now,
-    };
-    this.record(
-      new PreferenceChanged(this.state.memberId, type, channel, enabled, now),
-    );
-  }
+  ): void {}
 
   private emptyChannelToggles(): ChannelToggles {
killedBy: makeNotifyMember suppresses the notification when the type/channel is disabled (no-op)
statusReason: expected [ 'ntf-1' ] to deeply equal []

[Killed] ConditionalExpression
src/notifications/domain/notification-preference.ts:108:9
     enabled: boolean,
     now: Date,
   ): void {
-    if (this.allows(type, channel) === enabled) {
+    if (false) {
       return;
     }
killedBy: NotificationPreference.enable / disable is a no-op when the value already matches (no spurious event)
statusReason: expected [ PreferenceChanged{ …(6) } ] to deeply equal []

[Killed] LogicalOperator
src/notifications/domain/notification-preference.ts:111:21
     if (this.allows(type, channel) === enabled) {
       return;
     }
-    const current = this.state.toggles[type] ?? this.emptyChannelToggles();
+    const current = this.state.toggles[type] && this.emptyChannelToggles();
     const nextForType: ChannelToggles = { ...current, [channel]: enabled };
     this.state = {
killedBy: makeUpdateNotificationPreference materialises a default preference then toggles a channel on; allows() reflects it
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/notifications/domain/notification-preference.ts:112:41
       return;
     }
     const current = this.state.toggles[type] ?? this.emptyChannelToggles();
-    const nextForType: ChannelToggles = { ...current, [channel]: enabled };
+    const nextForType: ChannelToggles = {};
     this.state = {
       ...this.state,
killedBy: NotificationPreference.enable / disable enable turns a channel on and records PreferenceChanged(enabled=true)
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/notifications/domain/notification-preference.ts:113:18
     }
     const current = this.state.toggles[type] ?? this.emptyChannelToggles();
     const nextForType: ChannelToggles = { ...current, [channel]: enabled };
-    this.state = {
-      ...this.state,
-      toggles: { ...this.state.toggles, [type]: nextForType },
-      updatedAt: now,
-    };
+    this.state = {};
     this.record(
       new PreferenceChanged(this.state.memberId, type, channel, enabled, now),
killedBy: makeNotifyMember suppresses the notification when the type/channel is disabled (no-op)
statusReason: expected [ 'ntf-1' ] to deeply equal []

[Killed] BlockStatement
src/notifications/domain/notification-preference.ts:123:49
     );
   }
 
-  private emptyChannelToggles(): ChannelToggles {
-    const map: Partial<Record<Channel, boolean>> = {};
-    for (const channel of CHANNELS) {
-      map[channel] = false;
-    }
-    return map;
-  }
+  private emptyChannelToggles(): ChannelToggles {}
 
   private record(event: DomainEvent): void {
killedBy: NotificationPreference with a sparse (rehydrated) toggle map seeds an all-off channel map when first toggling an absent type
statusReason: expected { email: true } to deeply equal { inApp: false, email: true, …(1) }

[Killed] BlockStatement
src/notifications/domain/notification-preference.ts:125:37
 
   private emptyChannelToggles(): ChannelToggles {
     const map: Partial<Record<Channel, boolean>> = {};
-    for (const channel of CHANNELS) {
-      map[channel] = false;
-    }
+    for (const channel of CHANNELS) {}
     return map;
   }
killedBy: NotificationPreference with a sparse (rehydrated) toggle map seeds an all-off channel map when first toggling an absent type
statusReason: expected { email: true } to deeply equal { inApp: false, email: true, …(1) }

[Killed] BooleanLiteral
src/notifications/domain/notification-preference.ts:126:22
   private emptyChannelToggles(): ChannelToggles {
     const map: Partial<Record<Channel, boolean>> = {};
     for (const channel of CHANNELS) {
-      map[channel] = false;
+      map[channel] = true;
     }
     return map;
killedBy: NotificationPreference with a sparse (rehydrated) toggle map seeds an all-off channel map when first toggling an absent type
statusReason: expected true to be false // Object.is equality
