[Killed] BlockStatement
src/notifications/domain/notification.ts:64:63
   // Create a brand-new, unread notification and record NotificationCreated. There is no failure
   // mode here — whether this notification should exist at all (preference policy) is decided by
   // the application layer before calling create.
-  static create(props: CreateNotificationProps): Notification {
-    const notification = new Notification({
-      id: props.id,
-      userId: props.userId,
-      type: props.type,
-      title: props.title,
-      message: props.message,
-      relatedId: props.relatedId,
-      channel: props.channel,
-      isRead: false,
-      createdAt: props.now,
-    });
-    notification.record(
-      new NotificationCreated(
-        props.id,
-        props.userId,
-        props.type,
-        props.channel,
-        props.now,
-      ),
-    );
-    return notification;
-  }
+  static create(props: CreateNotificationProps): Notification {}
 
   // Mark as read on behalf of `by`. Ownership-checked: only the addressee may read it. Idempotent:
killedBy: makeMarkNotificationRead marks the owner's notification read and publishes NotificationRead
statusReason: Cannot read properties of undefined (reading 'pullEvents')

[Killed] BlockStatement
src/notifications/domain/notification.ts:91:35
   // Mark as read on behalf of `by`. Ownership-checked: only the addressee may read it. Idempotent:
   // a second markRead is a no-op (returns ok, records nothing) so it never double-emits.
   markRead(by: MemberId, now: Date): Result<void, NotificationError> {
-    if (by !== this.state.userId) {
-      return err(NotificationError.notOwner(this.state.id, by));
-    }
+    if (by !== this.state.userId) {}
     if (this.state.isRead) {
       return ok(undefined);
killedBy: makeMarkNotificationRead rejects a non-owner with NotNotificationOwner and does not mutate
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/notifications/domain/notification.ts:94:9
     if (by !== this.state.userId) {
       return err(NotificationError.notOwner(this.state.id, by));
     }
-    if (this.state.isRead) {
+    if (true) {
       return ok(undefined);
     }
killedBy: makeMarkNotificationRead marks the owner's notification read and publishes NotificationRead
statusReason: expected false to be true // Object.is equality
