[Killed] EqualityOperator
src/social/domain/activity-feed.ts:35:10
   const sorted = [...entries].sort(
     (a, b) => b.occurredAt.getTime() - a.occurredAt.getTime(),
   );
-  return options.limit === undefined ? sorted : sorted.slice(0, options.limit);
+  return options.limit !== undefined ? sorted : sorted.slice(0, options.limit);
 };
 
killedBy: buildActivityFeed caps the feed to the limit, keeping the newest entries
statusReason: expected [ 'new', 'mid', 'old' ] to deeply equal [ 'new', 'mid' ]
