[Killed] ArrayDeclaration
src/solving/domain/completion.ts:92:35
 // Invariants: endDate ≥ startDate; the duration is consistent with the recorded end; at most
 // five photos; edits only within 24h of completion.
 export class Completion {
-  private events: DomainEvent[] = [];
+  private events: DomainEvent[] = ["Stryker was here"];
 
   private constructor(private state: CompletionState) {}
killedBy: Completion.start starts an in-progress completion and records CompletionStarted
statusReason: expected [ undefined, 'CompletionStarted' ] to deeply equal [ 'CompletionStarted' ]

[Killed] ConditionalExpression
src/solving/domain/completion.ts:221:9
     allPiecesPresent?: boolean,
   ): Result<void, SolvingError> {
     if (this.state.isCompleted) return ok(undefined);
-    if (endDate.getTime() < this.state.startDate.getTime()) {
+    if (false) {
       return err(SolvingError.invalidTimeRange());
     }
killedBy: Completion.finish rejects an end before start
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/solving/domain/completion.ts:262:9
     changes: CompletionChanges,
     now: Date,
   ): Result<void, SolvingError> {
-    if (actingMemberId !== this.state.userId) {
+    if (true) {
       return err(SolvingError.notCompletionOwner());
     }
killedBy: Completion.edit allows an edit within the 24h window
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/solving/domain/completion.ts:267:9
     }
     // The edit window is anchored on the recorded completion. An in-progress completion has no
     // completion instant yet, so it is always editable.
-    if (this.state.isCompleted) {
+    if (true) {
       const reference = this.state.endDate ?? this.state.updatedAt;
       if (now.getTime() - reference.getTime() > EDIT_WINDOW_MS) {
killedBy: Completion.edit allows editing an in-progress completion regardless of elapsed time
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/solving/domain/completion.ts:277:20
     const nextStart = changes.startDate ?? this.state.startDate;
     const nextEnd =
       changes.endDate !== undefined ? changes.endDate : this.state.endDate;
-    if (nextEnd && nextEnd.getTime() < nextStart.getTime()) {
+    if (nextEnd && nextEnd.getTime() <= nextStart.getTime()) {
       return err(SolvingError.invalidTimeRange());
     }
killedBy: Completion.edit accepts an equal end/start edit with an explicit duration
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/solving/domain/completion.ts:282:9
     }
 
     const nextPhotos = changes.photos ?? this.state.photos;
-    if (nextPhotos.length > MAX_PHOTOS) {
+    if (false) {
       return err(SolvingError.tooManyPhotos(MAX_PHOTOS));
     }
killedBy: Completion.edit rejects an edit that pushes photos over five
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/solving/domain/completion.ts:373:9
       if (duration.isErr) return err(duration.error);
       return ok(duration.value.minutes);
     }
-    if (end.getTime() > start.getTime()) {
+    if (end.getTime() >= start.getTime()) {
       const duration = SolveDuration.between(start, end);
       if (duration.isErr) return err(duration.error);
killedBy: Completion.record allows equal start/end (same-day) and counts one day (1440 minutes)
statusReason: expected false to be true // Object.is equality
