[Killed] Regex
src/catalog/domain/extract-puzzle-draft.ts:13:3
 // Multilingual piece-count: EN pieces/pcs, NL stukjes, DE Teile, ES piezas, FR pieces. Captures
 // an integer that may carry `.`/`,`/space thousands separators (e.g. "1.000", "1,500").
 const PIECE_COUNT_RE =
-  /(\d[\d.,\s]{0,7}\d|\d)\s*(?:pieces?|pcs|stukjes|teile|piezas|pi[eè]ces)\b/i;
+  /(\d[\d.,\s]{0,7}\d|\d)\s*(?:pieces|pcs|stukjes|teile|piezas|pi[eè]ces)\b/i;
 
 const parsePieceCount = (text: string): number | undefined => {
killedBy: extractPuzzleDraft piece-count bounds (parsePieceCount L18) accepts a count of exactly 1
statusReason: expected undefined to be 1 // Object.is equality

[Killed] Regex
src/catalog/domain/extract-puzzle-draft.ts:13:3
 // Multilingual piece-count: EN pieces/pcs, NL stukjes, DE Teile, ES piezas, FR pieces. Captures
 // an integer that may carry `.`/`,`/space thousands separators (e.g. "1.000", "1,500").
 const PIECE_COUNT_RE =
-  /(\d[\d.,\s]{0,7}\d|\d)\s*(?:pieces?|pcs|stukjes|teile|piezas|pi[eè]ces)\b/i;
+  /(\d[\D.,\s]{0,7}\d|\d)\s*(?:pieces?|pcs|stukjes|teile|piezas|pi[eè]ces)\b/i;
 
 const parsePieceCount = (text: string): number | undefined => {
killedBy: extractPuzzleDraft prefers JSON-LD Product fields (tier 1)
statusReason: expected undefined to be 1000 // Object.is equality

[Killed] BlockStatement
src/catalog/domain/extract-puzzle-draft.ts:15:63
 const PIECE_COUNT_RE =
   /(\d[\d.,\s]{0,7}\d|\d)\s*(?:pieces?|pcs|stukjes|teile|piezas|pi[eè]ces)\b/i;
 
-const parsePieceCount = (text: string): number | undefined => {
-  const match = text.match(PIECE_COUNT_RE);
-  if (!match) return undefined;
-  const n = Number.parseInt(match[1].replace(/[.,\s]/g, ""), 10);
-  return Number.isFinite(n) && n >= 1 && n <= 100000 ? n : undefined;
-};
+const parsePieceCount = (text: string): number | undefined => {};
 
 const toImageArray = (
killedBy: extractPuzzleDraft prefers JSON-LD Product fields (tier 1)
statusReason: expected undefined to be 1000 // Object.is equality

[Killed] ConditionalExpression
src/catalog/domain/extract-puzzle-draft.ts:17:7
 
 const parsePieceCount = (text: string): number | undefined => {
   const match = text.match(PIECE_COUNT_RE);
-  if (!match) return undefined;
+  if (false) return undefined;
   const n = Number.parseInt(match[1].replace(/[.,\s]/g, ""), 10);
   return Number.isFinite(n) && n >= 1 && n <= 100000 ? n : undefined;
killedBy: extractPuzzleDraft parses multilingual piece counts incl. thousands separators
statusReason: Cannot read properties of null (reading '1')

[Killed] BooleanLiteral
src/catalog/domain/extract-puzzle-draft.ts:17:7
 
 const parsePieceCount = (text: string): number | undefined => {
   const match = text.match(PIECE_COUNT_RE);
-  if (!match) return undefined;
+  if (match) return undefined;
   const n = Number.parseInt(match[1].replace(/[.,\s]/g, ""), 10);
   return Number.isFinite(n) && n >= 1 && n <= 100000 ? n : undefined;
killedBy: extractPuzzleDraft prefers JSON-LD Product fields (tier 1)
statusReason: expected undefined to be 1000 // Object.is equality

[Killed] Regex
src/catalog/domain/extract-puzzle-draft.ts:18:46
 const parsePieceCount = (text: string): number | undefined => {
   const match = text.match(PIECE_COUNT_RE);
   if (!match) return undefined;
-  const n = Number.parseInt(match[1].replace(/[.,\s]/g, ""), 10);
+  const n = Number.parseInt(match[1].replace(/[^.,\s]/g, ""), 10);
   return Number.isFinite(n) && n >= 1 && n <= 100000 ? n : undefined;
 };
killedBy: extractPuzzleDraft prefers JSON-LD Product fields (tier 1)
statusReason: expected undefined to be 1000 // Object.is equality

[Killed] LogicalOperator
src/catalog/domain/extract-puzzle-draft.ts:19:10
   const match = text.match(PIECE_COUNT_RE);
   if (!match) return undefined;
   const n = Number.parseInt(match[1].replace(/[.,\s]/g, ""), 10);
-  return Number.isFinite(n) && n >= 1 && n <= 100000 ? n : undefined;
+  return Number.isFinite(n) && n >= 1 || n <= 100000 ? n : undefined;
 };
 
killedBy: extractPuzzleDraft piece-count bounds (parsePieceCount L18) rejects a zero count
statusReason: expected +0 to be undefined

[Killed] LogicalOperator
src/catalog/domain/extract-puzzle-draft.ts:19:10
   const match = text.match(PIECE_COUNT_RE);
   if (!match) return undefined;
   const n = Number.parseInt(match[1].replace(/[.,\s]/g, ""), 10);
-  return Number.isFinite(n) && n >= 1 && n <= 100000 ? n : undefined;
+  return Number.isFinite(n) || n >= 1 && n <= 100000 ? n : undefined;
 };
 
killedBy: extractPuzzleDraft piece-count bounds (parsePieceCount L18) rejects a zero count
statusReason: expected +0 to be undefined

[Killed] BlockStatement
src/catalog/domain/extract-puzzle-draft.ts:24:25
 
 const toImageArray = (
   image: string | readonly string[] | undefined,
-): readonly string[] => {
-  // Stryker disable next-line ConditionalExpression,ArrayDeclaration: defensive guard against
-  // null/undefined image fields in untrusted JSON-LD. Equivalent under the downstream filter in
-  // buildImages (typeof === "string" + HTTP_RE), which discards any null/sentinel that leaks past.
-  if (image == null) return [];
-  return Array.isArray(image)
-    ? (image as readonly string[])
-    : [image as string];
-};
+): readonly string[] => {};
 
 const MAX_IMAGES = 8;
killedBy: extractPuzzleDraft prefers JSON-LD Product fields (tier 1)
statusReason: toImageArray is not a function or its return value is not iterable

[Killed] EqualityOperator
src/catalog/domain/extract-puzzle-draft.ts:28:7
   // Stryker disable next-line ConditionalExpression,ArrayDeclaration: defensive guard against
   // null/undefined image fields in untrusted JSON-LD. Equivalent under the downstream filter in
   // buildImages (typeof === "string" + HTTP_RE), which discards any null/sentinel that leaks past.
-  if (image == null) return [];
+  if (image != null) return [];
   return Array.isArray(image)
     ? (image as readonly string[])
killedBy: extractPuzzleDraft prefers JSON-LD Product fields (tier 1)
statusReason: expected [ 'https://img/og.jpg' ] to deeply equal [ 'https://img/product.jpg', …(1) ]

[Killed] BlockStatement
src/catalog/domain/extract-puzzle-draft.ts:37:65
 const MAX_IMAGES = 8;
 const HTTP_RE = /^https?:\/\//;
 
-const buildImages = (raw: RawProductPage): readonly string[] => {
-  const product = raw.jsonLdProducts[0];
-  const candidates = [...toImageArray(product?.image), ...raw.ogImages];
-  const seen = new Set<string>();
-  const result: string[] = [];
-  for (const url of candidates) {
-    if (
-      // Stryker disable next-line ConditionalExpression: runtime guard against non-string image
-      // entries in untrusted JSON-LD. Equivalent under the static string[] type, but real defense.
-      typeof url === "string" &&
-      HTTP_RE.test(url) &&
-      // Never offer a candidate the import action is guaranteed to reject (e.g. .svg logos
-      // JSON-LD/OG frequently carry). Extension-less URLs pass — the action stays authoritative.
-      !hasUnsupportedImageExtension(url) &&
-      !seen.has(url) &&
-      result.length < MAX_IMAGES
-    ) {
-      seen.add(url);
-      result.push(url);
-    }
-  }
-  return result;
-};
+const buildImages = (raw: RawProductPage): readonly string[] => {};
 
 // Keep only the alt entries whose image survived dedup/cap, so the draft never references a URL
killedBy: extractPuzzleDraft prefers JSON-LD Product fields (tier 1)
statusReason: Cannot read properties of undefined (reading '0')

[Killed] OptionalChaining
src/catalog/domain/extract-puzzle-draft.ts:39:39
 
 const buildImages = (raw: RawProductPage): readonly string[] => {
   const product = raw.jsonLdProducts[0];
-  const candidates = [...toImageArray(product?.image), ...raw.ogImages];
+  const candidates = [...toImageArray(product.image), ...raw.ogImages];
   const seen = new Set<string>();
   const result: string[] = [];
killedBy: extractPuzzleDraft falls back to OpenGraph then <title> (tiers 2-3)
statusReason: Cannot read properties of undefined (reading 'image')

[Killed] ArrayDeclaration
src/catalog/domain/extract-puzzle-draft.ts:41:28
   const product = raw.jsonLdProducts[0];
   const candidates = [...toImageArray(product?.image), ...raw.ogImages];
   const seen = new Set<string>();
-  const result: string[] = [];
+  const result: string[] = ["Stryker was here"];
   for (const url of candidates) {
     if (
killedBy: extractPuzzleDraft prefers JSON-LD Product fields (tier 1)
statusReason: expected [ 'Stryker was here', …(2) ] to deeply equal [ 'https://img/product.jpg', …(1) ]

[Killed] BlockStatement
src/catalog/domain/extract-puzzle-draft.ts:42:33
   const candidates = [...toImageArray(product?.image), ...raw.ogImages];
   const seen = new Set<string>();
   const result: string[] = [];
-  for (const url of candidates) {
-    if (
-      // Stryker disable next-line ConditionalExpression: runtime guard against non-string image
-      // entries in untrusted JSON-LD. Equivalent under the static string[] type, but real defense.
-      typeof url === "string" &&
-      HTTP_RE.test(url) &&
-      // Never offer a candidate the import action is guaranteed to reject (e.g. .svg logos
-      // JSON-LD/OG frequently carry). Extension-less URLs pass — the action stays authoritative.
-      !hasUnsupportedImageExtension(url) &&
-      !seen.has(url) &&
-      result.length < MAX_IMAGES
-    ) {
-      seen.add(url);
-      result.push(url);
-    }
-  }
+  for (const url of candidates) {}
   return result;
 };
killedBy: extractPuzzleDraft prefers JSON-LD Product fields (tier 1)
statusReason: expected [] to deeply equal [ 'https://img/product.jpg', …(1) ]

[Killed] LogicalOperator
src/catalog/domain/extract-puzzle-draft.ts:46:7
     if (
       // Stryker disable next-line ConditionalExpression: runtime guard against non-string image
       // entries in untrusted JSON-LD. Equivalent under the static string[] type, but real defense.
-      typeof url === "string" &&
-      HTTP_RE.test(url) &&
-      // Never offer a candidate the import action is guaranteed to reject (e.g. .svg logos
-      // JSON-LD/OG frequently carry). Extension-less URLs pass — the action stays authoritative.
-      !hasUnsupportedImageExtension(url) &&
-      !seen.has(url) &&
+      typeof url === "string" && HTTP_RE.test(url) &&
+// Never offer a candidate the import action is guaranteed to reject (e.g. .svg logos
+// JSON-LD/OG frequently carry). Extension-less URLs pass — the action stays authoritative.
+!hasUnsupportedImageExtension(url) || !seen.has(url) &&
       result.length < MAX_IMAGES
     ) {
killedBy: extractPuzzleDraft collects multiple JSON-LD images then OG images, deduped, capped at 8
statusReason: expected [ 'https://img/product-a.jpg', …(4) ] to deeply equal [ 'https://img/product-a.jpg', …(3) ]

[Killed] LogicalOperator
src/catalog/domain/extract-puzzle-draft.ts:46:7
     if (
       // Stryker disable next-line ConditionalExpression: runtime guard against non-string image
       // entries in untrusted JSON-LD. Equivalent under the static string[] type, but real defense.
-      typeof url === "string" &&
-      HTTP_RE.test(url) &&
-      // Never offer a candidate the import action is guaranteed to reject (e.g. .svg logos
-      // JSON-LD/OG frequently carry). Extension-less URLs pass — the action stays authoritative.
-      !hasUnsupportedImageExtension(url) &&
+      typeof url === "string" && HTTP_RE.test(url) ||
+// Never offer a candidate the import action is guaranteed to reject (e.g. .svg logos
+// JSON-LD/OG frequently carry). Extension-less URLs pass — the action stays authoritative.
+!hasUnsupportedImageExtension(url) &&
       !seen.has(url) &&
       result.length < MAX_IMAGES
killedBy: extractPuzzleDraft image URL filtering (HTTP_RE L31 + typeof guard L40) rejects a URL where http(s) appears only mid-string
statusReason: expected [ 'data:https://evil/x.png' ] to deeply equal []

[Killed] BooleanLiteral
src/catalog/domain/extract-puzzle-draft.ts:50:7
       HTTP_RE.test(url) &&
       // Never offer a candidate the import action is guaranteed to reject (e.g. .svg logos
       // JSON-LD/OG frequently carry). Extension-less URLs pass — the action stays authoritative.
-      !hasUnsupportedImageExtension(url) &&
+      hasUnsupportedImageExtension(url) &&
       !seen.has(url) &&
       result.length < MAX_IMAGES
killedBy: extractPuzzleDraft prefers JSON-LD Product fields (tier 1)
statusReason: expected [] to deeply equal [ 'https://img/product.jpg', …(1) ]

[Killed] BooleanLiteral
src/catalog/domain/extract-puzzle-draft.ts:51:7
       // Never offer a candidate the import action is guaranteed to reject (e.g. .svg logos
       // JSON-LD/OG frequently carry). Extension-less URLs pass — the action stays authoritative.
       !hasUnsupportedImageExtension(url) &&
-      !seen.has(url) &&
+      seen.has(url) &&
       result.length < MAX_IMAGES
     ) {
killedBy: extractPuzzleDraft prefers JSON-LD Product fields (tier 1)
statusReason: expected [] to deeply equal [ 'https://img/product.jpg', …(1) ]

[Killed] EqualityOperator
src/catalog/domain/extract-puzzle-draft.ts:52:7
       // JSON-LD/OG frequently carry). Extension-less URLs pass — the action stays authoritative.
       !hasUnsupportedImageExtension(url) &&
       !seen.has(url) &&
-      result.length < MAX_IMAGES
+      result.length <= MAX_IMAGES
     ) {
       seen.add(url);
killedBy: extractPuzzleDraft image cap (result.length < MAX_IMAGES L43) caps the image list at 8 and drops the 9th
statusReason: expected [ 'https://img/0.jpg', …(8) ] to have a length of 8 but got 9

[Killed] EqualityOperator
src/catalog/domain/extract-puzzle-draft.ts:52:7
       // JSON-LD/OG frequently carry). Extension-less URLs pass — the action stays authoritative.
       !hasUnsupportedImageExtension(url) &&
       !seen.has(url) &&
-      result.length < MAX_IMAGES
+      result.length >= MAX_IMAGES
     ) {
       seen.add(url);
killedBy: extractPuzzleDraft prefers JSON-LD Product fields (tier 1)
statusReason: expected [] to deeply equal [ 'https://img/product.jpg', …(1) ]

[Killed] BlockStatement
src/catalog/domain/extract-puzzle-draft.ts:53:7
       !hasUnsupportedImageExtension(url) &&
       !seen.has(url) &&
       result.length < MAX_IMAGES
-    ) {
-      seen.add(url);
-      result.push(url);
-    }
+    ) {}
   }
   return result;
killedBy: extractPuzzleDraft prefers JSON-LD Product fields (tier 1)
statusReason: expected [] to deeply equal [ 'https://img/product.jpg', …(1) ]

[Killed] BlockStatement
src/catalog/domain/extract-puzzle-draft.ts:66:52
 const pickAlts = (
   images: readonly string[],
   alts: Readonly<Record<string, string>> | undefined,
-): Readonly<Record<string, string>> | undefined => {
-  if (!alts) return undefined;
-  const out: Record<string, string> = {};
-  for (const url of images) {
-    const alt = alts[url];
-    if (alt) out[url] = alt;
-  }
-  return Object.keys(out).length > 0 ? out : undefined;
-};
+): Readonly<Record<string, string>> | undefined => {};
 
 const barcodes = (
killedBy: extractPuzzleDraft imageAlts (pickAlts) carries alt text for surviving images, keyed by URL
statusReason: expected undefined to deeply equal { …(2) }

[Killed] ConditionalExpression
src/catalog/domain/extract-puzzle-draft.ts:67:7
   images: readonly string[],
   alts: Readonly<Record<string, string>> | undefined,
 ): Readonly<Record<string, string>> | undefined => {
-  if (!alts) return undefined;
+  if (false) return undefined;
   const out: Record<string, string> = {};
   for (const url of images) {
killedBy: extractPuzzleDraft prefers JSON-LD Product fields (tier 1)
statusReason: Cannot read properties of undefined (reading 'https://img/product.jpg')

[Killed] BooleanLiteral
src/catalog/domain/extract-puzzle-draft.ts:67:7
   images: readonly string[],
   alts: Readonly<Record<string, string>> | undefined,
 ): Readonly<Record<string, string>> | undefined => {
-  if (!alts) return undefined;
+  if (alts) return undefined;
   const out: Record<string, string> = {};
   for (const url of images) {
killedBy: extractPuzzleDraft prefers JSON-LD Product fields (tier 1)
statusReason: Cannot read properties of undefined (reading 'https://img/product.jpg')

[Killed] BlockStatement
src/catalog/domain/extract-puzzle-draft.ts:69:29
 ): Readonly<Record<string, string>> | undefined => {
   if (!alts) return undefined;
   const out: Record<string, string> = {};
-  for (const url of images) {
-    const alt = alts[url];
-    if (alt) out[url] = alt;
-  }
+  for (const url of images) {}
   return Object.keys(out).length > 0 ? out : undefined;
 };
killedBy: extractPuzzleDraft imageAlts (pickAlts) carries alt text for surviving images, keyed by URL
statusReason: expected undefined to deeply equal { …(2) }

[Killed] ConditionalExpression
src/catalog/domain/extract-puzzle-draft.ts:71:9
   const out: Record<string, string> = {};
   for (const url of images) {
     const alt = alts[url];
-    if (alt) out[url] = alt;
+    if (true) out[url] = alt;
   }
   return Object.keys(out).length > 0 ? out : undefined;
killedBy: extractPuzzleDraft imageAlts (pickAlts) is undefined when no surviving image has alt text
statusReason: expected { 'https://img/a.jpg': undefined } to be undefined

[Killed] ConditionalExpression
src/catalog/domain/extract-puzzle-draft.ts:71:9
   const out: Record<string, string> = {};
   for (const url of images) {
     const alt = alts[url];
-    if (alt) out[url] = alt;
+    if (false) out[url] = alt;
   }
   return Object.keys(out).length > 0 ? out : undefined;
killedBy: extractPuzzleDraft imageAlts (pickAlts) carries alt text for surviving images, keyed by URL
statusReason: expected undefined to deeply equal { …(2) }

[Killed] EqualityOperator
src/catalog/domain/extract-puzzle-draft.ts:73:10
     const alt = alts[url];
     if (alt) out[url] = alt;
   }
-  return Object.keys(out).length > 0 ? out : undefined;
+  return Object.keys(out).length >= 0 ? out : undefined;
 };
 
killedBy: extractPuzzleDraft imageAlts (pickAlts) is undefined when no surviving image has alt text
statusReason: expected {} to be undefined

[Killed] EqualityOperator
src/catalog/domain/extract-puzzle-draft.ts:73:10
     const alt = alts[url];
     if (alt) out[url] = alt;
   }
-  return Object.keys(out).length > 0 ? out : undefined;
+  return Object.keys(out).length <= 0 ? out : undefined;
 };
 
killedBy: extractPuzzleDraft imageAlts (pickAlts) carries alt text for surviving images, keyed by URL
statusReason: expected undefined to deeply equal { …(2) }

[Killed] BlockStatement
src/catalog/domain/extract-puzzle-draft.ts:78:38
 
 const barcodes = (
   product: JsonLdProduct | undefined,
-): { ean?: string; upc?: string } => {
-  const gtin13 =
-    product?.gtin13 ??
-    (product?.gtin?.length === 13 ? product.gtin : undefined);
-  const gtin12 =
-    product?.gtin12 ??
-    (product?.gtin?.length === 12 ? product.gtin : undefined);
-  return { ean: gtin13, upc: gtin12 };
-};
+): { ean?: string; upc?: string } => {};
 
 const clean = (value: string | undefined): string | undefined => {
killedBy: extractPuzzleDraft prefers JSON-LD Product fields (tier 1)
statusReason: Cannot destructure property 'ean' of 'barcodes(...)' as it is undefined.

[Killed] LogicalOperator
src/catalog/domain/extract-puzzle-draft.ts:80:5
   product: JsonLdProduct | undefined,
 ): { ean?: string; upc?: string } => {
   const gtin13 =
-    product?.gtin13 ??
-    (product?.gtin?.length === 13 ? product.gtin : undefined);
+    product?.gtin13 && (product?.gtin?.length === 13 ? product.gtin : undefined);
   const gtin12 =
     product?.gtin12 ??
killedBy: extractPuzzleDraft prefers JSON-LD Product fields (tier 1)
statusReason: expected undefined to be '4005556150007' // Object.is equality

[Killed] OptionalChaining
src/catalog/domain/extract-puzzle-draft.ts:80:5
   product: JsonLdProduct | undefined,
 ): { ean?: string; upc?: string } => {
   const gtin13 =
-    product?.gtin13 ??
+    product.gtin13 ??
     (product?.gtin?.length === 13 ? product.gtin : undefined);
   const gtin12 =
killedBy: extractPuzzleDraft falls back to OpenGraph then <title> (tiers 2-3)
statusReason: Cannot read properties of undefined (reading 'gtin13')

[Killed] EqualityOperator
src/catalog/domain/extract-puzzle-draft.ts:81:6
 ): { ean?: string; upc?: string } => {
   const gtin13 =
     product?.gtin13 ??
-    (product?.gtin?.length === 13 ? product.gtin : undefined);
+    (product?.gtin?.length !== 13 ? product.gtin : undefined);
   const gtin12 =
     product?.gtin12 ??
killedBy: extractPuzzleDraft falls back to OpenGraph then <title> (tiers 2-3)
statusReason: Cannot read properties of undefined (reading 'gtin')

[Killed] OptionalChaining
src/catalog/domain/extract-puzzle-draft.ts:81:6
 ): { ean?: string; upc?: string } => {
   const gtin13 =
     product?.gtin13 ??
-    (product?.gtin?.length === 13 ? product.gtin : undefined);
+    (product.gtin?.length === 13 ? product.gtin : undefined);
   const gtin12 =
     product?.gtin12 ??
killedBy: extractPuzzleDraft falls back to OpenGraph then <title> (tiers 2-3)
statusReason: Cannot read properties of undefined (reading 'gtin')

[Killed] LogicalOperator
src/catalog/domain/extract-puzzle-draft.ts:83:5
     product?.gtin13 ??
     (product?.gtin?.length === 13 ? product.gtin : undefined);
   const gtin12 =
-    product?.gtin12 ??
-    (product?.gtin?.length === 12 ? product.gtin : undefined);
+    product?.gtin12 && (product?.gtin?.length === 12 ? product.gtin : undefined);
   return { ean: gtin13, upc: gtin12 };
 };
killedBy: extractPuzzleDraft maps gtin12 to upc
statusReason: expected undefined to be '036000291452' // Object.is equality

[Killed] OptionalChaining
src/catalog/domain/extract-puzzle-draft.ts:83:5
     product?.gtin13 ??
     (product?.gtin?.length === 13 ? product.gtin : undefined);
   const gtin12 =
-    product?.gtin12 ??
+    product.gtin12 ??
     (product?.gtin?.length === 12 ? product.gtin : undefined);
   return { ean: gtin13, upc: gtin12 };
killedBy: extractPuzzleDraft falls back to OpenGraph then <title> (tiers 2-3)
statusReason: Cannot read properties of undefined (reading 'gtin12')

[Killed] ConditionalExpression
src/catalog/domain/extract-puzzle-draft.ts:84:6
     (product?.gtin?.length === 13 ? product.gtin : undefined);
   const gtin12 =
     product?.gtin12 ??
-    (product?.gtin?.length === 12 ? product.gtin : undefined);
+    (false ? product.gtin : undefined);
   return { ean: gtin13, upc: gtin12 };
 };
killedBy: extractPuzzleDraft gtin length-based barcode mapping (L57 / L60) maps a 12-digit gtin to upc
statusReason: expected undefined to be '036000291452' // Object.is equality

[Killed] OptionalChaining
src/catalog/domain/extract-puzzle-draft.ts:84:6
     (product?.gtin?.length === 13 ? product.gtin : undefined);
   const gtin12 =
     product?.gtin12 ??
-    (product?.gtin?.length === 12 ? product.gtin : undefined);
+    (product.gtin?.length === 12 ? product.gtin : undefined);
   return { ean: gtin13, upc: gtin12 };
 };
killedBy: extractPuzzleDraft falls back to OpenGraph then <title> (tiers 2-3)
statusReason: Cannot read properties of undefined (reading 'gtin')

[Killed] BlockStatement
src/catalog/domain/extract-puzzle-draft.ts:88:66
   return { ean: gtin13, upc: gtin12 };
 };
 
-const clean = (value: string | undefined): string | undefined => {
-  const trimmed = value?.trim();
-  return trimmed ? trimmed : undefined;
-};
+const clean = (value: string | undefined): string | undefined => {};
 
 // Tiered, in order: JSON-LD Product -> OpenGraph -> <title>/<meta>. Piece count regex runs over
killedBy: extractPuzzleDraft prefers JSON-LD Product fields (tier 1)
statusReason: expected undefined to be 'Ravensburger' // Object.is equality

[Killed] OptionalChaining
src/catalog/domain/extract-puzzle-draft.ts:89:19
 };
 
 const clean = (value: string | undefined): string | undefined => {
-  const trimmed = value?.trim();
+  const trimmed = value.trim();
   return trimmed ? trimmed : undefined;
 };
killedBy: extractPuzzleDraft falls back to OpenGraph then <title> (tiers 2-3)
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] MethodExpression
src/catalog/domain/extract-puzzle-draft.ts:89:19
 };
 
 const clean = (value: string | undefined): string | undefined => {
-  const trimmed = value?.trim();
+  const trimmed = value;
   return trimmed ? trimmed : undefined;
 };
killedBy: extractPuzzleDraft clean() trimming (L65) trims surrounding whitespace from brand
statusReason: expected '  Ravensburger  ' to be 'Ravensburger' // Object.is equality

[Killed] LogicalOperator
src/catalog/domain/extract-puzzle-draft.ts:102:20
   const product = raw.jsonLdProducts[0];
   // Compute rawTitle BEFORE cleaning — pieceCount is parsed from it. No outer trim is needed:
   // parsePieceCount tolerates surrounding whitespace and cleanPuzzleTitle trims internally.
-  const rawTitle = product?.name ?? raw.ogTitle ?? raw.basicTitle ?? "";
+  const rawTitle = (product?.name ?? raw.ogTitle ?? raw.basicTitle) && "";
   const description = clean(
     product?.description ?? raw.ogDescription ?? raw.basicDescription,
killedBy: extractPuzzleDraft prefers JSON-LD Product fields (tier 1)
statusReason: expected '' to be 'Ravensburger Mountain Vista' // Object.is equality

[Killed] LogicalOperator
src/catalog/domain/extract-puzzle-draft.ts:102:20
   const product = raw.jsonLdProducts[0];
   // Compute rawTitle BEFORE cleaning — pieceCount is parsed from it. No outer trim is needed:
   // parsePieceCount tolerates surrounding whitespace and cleanPuzzleTitle trims internally.
-  const rawTitle = product?.name ?? raw.ogTitle ?? raw.basicTitle ?? "";
+  const rawTitle = product?.name && raw.ogTitle ?? raw.basicTitle ?? "";
   const description = clean(
     product?.description ?? raw.ogDescription ?? raw.basicDescription,
killedBy: extractPuzzleDraft prefers JSON-LD Product fields (tier 1)
statusReason: expected 'OG fallback title' to be 'Ravensburger Mountain Vista' // Object.is equality

[Killed] OptionalChaining
src/catalog/domain/extract-puzzle-draft.ts:104:5
   // parsePieceCount tolerates surrounding whitespace and cleanPuzzleTitle trims internally.
   const rawTitle = product?.name ?? raw.ogTitle ?? raw.basicTitle ?? "";
   const description = clean(
-    product?.description ?? raw.ogDescription ?? raw.basicDescription,
+    product.description ?? raw.ogDescription ?? raw.basicDescription,
   );
   const { ean, upc } = barcodes(product);
killedBy: extractPuzzleDraft falls back to OpenGraph then <title> (tiers 2-3)
statusReason: Cannot read properties of undefined (reading 'description')

[Killed] LogicalOperator
src/catalog/domain/extract-puzzle-draft.ts:104:5
   // parsePieceCount tolerates surrounding whitespace and cleanPuzzleTitle trims internally.
   const rawTitle = product?.name ?? raw.ogTitle ?? raw.basicTitle ?? "";
   const description = clean(
-    product?.description ?? raw.ogDescription ?? raw.basicDescription,
+    product?.description && raw.ogDescription ?? raw.basicDescription,
   );
   const { ean, upc } = barcodes(product);
killedBy: extractPuzzleDraft clean() trimming (L65) trims surrounding whitespace from description
statusReason: expected undefined to be 'A nice scene' // Object.is equality

[Killed] OptionalChaining
src/catalog/domain/extract-puzzle-draft.ts:107:23
     product?.description ?? raw.ogDescription ?? raw.basicDescription,
   );
   const { ean, upc } = barcodes(product);
-  const brand = clean(product?.brand);
+  const brand = clean(product.brand);
   // Parse piece count from the ORIGINAL title + description so cleaning doesn't lose the count.
   // Stryker disable next-line StringLiteral: the "" fallback only applies when description is
killedBy: extractPuzzleDraft falls back to OpenGraph then <title> (tiers 2-3)
statusReason: Cannot read properties of undefined (reading 'brand')

[Killed] LogicalOperator
src/catalog/domain/extract-puzzle-draft.ts:112:53
   // Stryker disable next-line StringLiteral: the "" fallback only applies when description is
   // absent; any replacement string is whitespace/word-only and carries no digit+unit token, so it
   // cannot change the parsed piece count — an equivalent mutant.
-  const pieceCount = parsePieceCount(`${rawTitle} ${description ?? ""}`);
+  const pieceCount = parsePieceCount(`${rawTitle} ${description && ""}`);
   // Clean title AFTER deriving pieceCount (cleaning may strip the count phrase).
   const title = cleanPuzzleTitle(rawTitle);
killedBy: extractPuzzleDraft piece-count parsed across title AND description (L89) finds the piece count when it is only in the description
statusReason: expected undefined to be 1500 // Object.is equality
