[Killed] BooleanLiteral
catalog/application/use-cases/approve-change-proposal.ts:28:9
     cmd: ApproveChangeProposalCommand,
   ): Promise<DecideChangeProposalResult> => {
     const proposal = await deps.proposals.findById(cmd.changeProposalId);
-    if (!proposal) {
+    if (proposal) {
       return err(
         CatalogApplicationError.changeProposalNotFound(cmd.changeProposalId),
killedBy: makeApproveChangeProposal approves the proposal AND applies the patch to the definition, publishing both batches
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
catalog/application/use-cases/approve-change-proposal.ts:28:9
     cmd: ApproveChangeProposalCommand,
   ): Promise<DecideChangeProposalResult> => {
     const proposal = await deps.proposals.findById(cmd.changeProposalId);
-    if (!proposal) {
+    if (false) {
       return err(
         CatalogApplicationError.changeProposalNotFound(cmd.changeProposalId),
killedBy: makeApproveChangeProposal fails with ChangeProposalNotFound for an unknown id
statusReason: Cannot read properties of null (reading 'puzzleDefinitionId')

[Killed] ConditionalExpression
catalog/application/use-cases/approve-change-proposal.ts:37:9
     const definition = await deps.definitions.findById(
       proposal.puzzleDefinitionId,
     );
-    if (!definition) {
+    if (false) {
       return err(
         CatalogApplicationError.puzzleDefinitionNotFound(
killedBy: makeApproveChangeProposal saves NOTHING when applying the patch fails on the definition
statusReason: Cannot read properties of null (reading 'update')

[Killed] ConditionalExpression
catalog/application/use-cases/approve-change-proposal.ts:37:9
     const definition = await deps.definitions.findById(
       proposal.puzzleDefinitionId,
     );
-    if (!definition) {
+    if (true) {
       return err(
         CatalogApplicationError.puzzleDefinitionNotFound(
killedBy: makeApproveChangeProposal approves the proposal AND applies the patch to the definition, publishing both batches
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
catalog/application/use-cases/approve-change-proposal.ts:47:9
 
     const now = deps.clock.now();
     const approved = proposal.approve(now);
-    if (approved.isErr) return err(approved.error);
+    if (true) return err(approved.error);
 
     const applied = definition.update(proposal.changes, now);
killedBy: makeApproveChangeProposal approves the proposal AND applies the patch to the definition, publishing both batches
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
catalog/application/use-cases/approve-change-proposal.ts:47:9
 
     const now = deps.clock.now();
     const approved = proposal.approve(now);
-    if (approved.isErr) return err(approved.error);
+    if (false) return err(approved.error);
 
     const applied = definition.update(proposal.changes, now);
killedBy: makeApproveChangeProposal cannot approve twice — and does not double-apply the patch
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
catalog/application/use-cases/approve-change-proposal.ts:50:9
     if (approved.isErr) return err(approved.error);
 
     const applied = definition.update(proposal.changes, now);
-    if (applied.isErr) return err(applied.error);
+    if (false) return err(applied.error);
 
     await deps.proposals.save(proposal);
killedBy: makeApproveChangeProposal saves NOTHING when the definition rejects the patch (invalid stored proposal)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
catalog/application/use-cases/approve-change-proposal.ts:50:9
     if (approved.isErr) return err(approved.error);
 
     const applied = definition.update(proposal.changes, now);
-    if (applied.isErr) return err(applied.error);
+    if (true) return err(applied.error);
 
     await deps.proposals.save(proposal);
killedBy: makeApproveChangeProposal approves the proposal AND applies the patch to the definition, publishing both batches
statusReason: expected false to be true // Object.is equality
