[Killed] BlockStatement
catalog/application/use-cases/approve-puzzle-definition.ts:9:31
 
 export const makeApprovePuzzleDefinition = (
   deps: DefinitionActionDeps,
-): ApprovePuzzleDefinition => {
-  const run = runDefinitionAction(deps, (definition, now) =>
-    definition.approve(now),
-  );
-  return (cmd) => run(cmd.puzzleDefinitionId);
-};
+): ApprovePuzzleDefinition => {};
 
killedBy: Catalog PuzzleDefinition use cases approves a stored definition and publishes PuzzleDefinitionApproved
statusReason: approve is not a function

[Killed] ArrowFunction
catalog/application/use-cases/approve-puzzle-definition.ts:10:41
 export const makeApprovePuzzleDefinition = (
   deps: DefinitionActionDeps,
 ): ApprovePuzzleDefinition => {
-  const run = runDefinitionAction(deps, (definition, now) =>
-    definition.approve(now),
+  const run = runDefinitionAction(deps, () => undefined,
   );
   return (cmd) => run(cmd.puzzleDefinitionId);
killedBy: Catalog PuzzleDefinition use cases approves a stored definition and publishes PuzzleDefinitionApproved
statusReason: Cannot read properties of undefined (reading 'isErr')

[Killed] ArrowFunction
catalog/application/use-cases/approve-puzzle-definition.ts:13:10
   const run = runDefinitionAction(deps, (definition, now) =>
     definition.approve(now),
   );
-  return (cmd) => run(cmd.puzzleDefinitionId);
+  return () => undefined;
 };
 
killedBy: Catalog PuzzleDefinition use cases approves a stored definition and publishes PuzzleDefinitionApproved
statusReason: Cannot read properties of undefined (reading 'isOk')
