[Killed] ArrowFunction
catalog/application/use-cases/create-catalog-category.ts:26:3
 
 // Transaction script: mint id, delegate name-completeness to the aggregate, persist, publish.
 export const makeCreateCatalogCategory =
-  (deps: CreateCatalogCategoryDeps): CreateCatalogCategory =>
-  async (
-    cmd: CreateCatalogCategoryCommand,
-  ): Promise<
-    Result<CatalogCategoryId, CatalogError | CatalogApplicationError>
-  > => {
-    const category = CatalogCategory.create({
-      id: deps.ids.nextCatalogCategoryId(),
-      name: cmd.name,
-      sortOrder: cmd.sortOrder,
-      now: deps.clock.now(),
-      description: cmd.description,
-      color: cmd.color,
-    });
-    if (category.isErr) return err(category.error);
-
-    await deps.categories.save(category.value);
-    await deps.events.publish(category.value.pullEvents());
-    return ok(category.value.id);
-  };
+  () => undefined;
 
killedBy: Catalog category use cases creates a category and publishes CatalogCategoryCreated
statusReason: create is not a function

[Killed] BlockStatement
catalog/application/use-cases/create-catalog-category.ts:31:8
     cmd: CreateCatalogCategoryCommand,
   ): Promise<
     Result<CatalogCategoryId, CatalogError | CatalogApplicationError>
-  > => {
-    const category = CatalogCategory.create({
-      id: deps.ids.nextCatalogCategoryId(),
-      name: cmd.name,
-      sortOrder: cmd.sortOrder,
-      now: deps.clock.now(),
-      description: cmd.description,
-      color: cmd.color,
-    });
-    if (category.isErr) return err(category.error);
-
-    await deps.categories.save(category.value);
-    await deps.events.publish(category.value.pullEvents());
-    return ok(category.value.id);
-  };
+  > => {};
 
killedBy: Catalog category use cases creates a category and publishes CatalogCategoryCreated
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] ObjectLiteral
catalog/application/use-cases/create-catalog-category.ts:32:45
   ): Promise<
     Result<CatalogCategoryId, CatalogError | CatalogApplicationError>
   > => {
-    const category = CatalogCategory.create({
-      id: deps.ids.nextCatalogCategoryId(),
-      name: cmd.name,
-      sortOrder: cmd.sortOrder,
-      now: deps.clock.now(),
-      description: cmd.description,
-      color: cmd.color,
-    });
+    const category = CatalogCategory.create({});
     if (category.isErr) return err(category.error);
 
killedBy: Catalog category use cases creates a category and publishes CatalogCategoryCreated
statusReason: Cannot read properties of undefined (reading 'en')

[Killed] ConditionalExpression
catalog/application/use-cases/create-catalog-category.ts:40:9
       description: cmd.description,
       color: cmd.color,
     });
-    if (category.isErr) return err(category.error);
+    if (true) return err(category.error);
 
     await deps.categories.save(category.value);
killedBy: Catalog category use cases creates a category and publishes CatalogCategoryCreated
statusReason: Cannot read properties of undefined (reading 'code')

[Killed] ConditionalExpression
catalog/application/use-cases/create-catalog-category.ts:40:9
       description: cmd.description,
       color: cmd.color,
     });
-    if (category.isErr) return err(category.error);
+    if (false) return err(category.error);
 
     await deps.categories.save(category.value);
killedBy: Catalog category use cases rejects creation with an incomplete name (EmptyCategoryName)
statusReason: Cannot read properties of undefined (reading 'id')
