[Killed] BlockStatement
catalog/application/use-cases/disable-puzzle-definition.ts:9:31
 
 export const makeDisablePuzzleDefinition = (
   deps: DefinitionActionDeps,
-): DisablePuzzleDefinition => {
-  const run = runDefinitionAction(deps, (definition, now) =>
-    definition.disable(now),
-  );
-  return (cmd) => run(cmd.puzzleDefinitionId);
-};
+): DisablePuzzleDefinition => {};
 
killedBy: Catalog PuzzleDefinition use cases disables a stored approved definition and publishes PuzzleDefinitionDisabled
statusReason: disable is not a function

[Killed] ArrowFunction
catalog/application/use-cases/disable-puzzle-definition.ts:10:41
 export const makeDisablePuzzleDefinition = (
   deps: DefinitionActionDeps,
 ): DisablePuzzleDefinition => {
-  const run = runDefinitionAction(deps, (definition, now) =>
-    definition.disable(now),
+  const run = runDefinitionAction(deps, () => undefined,
   );
   return (cmd) => run(cmd.puzzleDefinitionId);
killedBy: Catalog PuzzleDefinition use cases disables a stored approved definition and publishes PuzzleDefinitionDisabled
statusReason: Cannot read properties of undefined (reading 'isErr')
