[Killed] ConditionalExpression
catalog/application/use-cases/edit-change-proposal.ts:33:9
     cmd: EditChangeProposalCommand,
   ): Promise<Result<void, CatalogError | CatalogApplicationError>> => {
     const proposal = await deps.proposals.findById(cmd.changeProposalId);
-    if (!proposal) {
+    if (true) {
       return err(
         CatalogApplicationError.changeProposalNotFound(cmd.changeProposalId),
killedBy: makeEditChangeProposal replaces changes/comment and re-derives the baseline against the CURRENT definition
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
catalog/application/use-cases/edit-change-proposal.ts:42:9
     const definition = await deps.definitions.findById(
       proposal.puzzleDefinitionId,
     );
-    if (!definition) {
+    if (definition) {
       return err(
         CatalogApplicationError.puzzleDefinitionNotFound(
killedBy: makeEditChangeProposal replaces changes/comment and re-derives the baseline against the CURRENT definition
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
catalog/application/use-cases/edit-change-proposal.ts:42:22
     const definition = await deps.definitions.findById(
       proposal.puzzleDefinitionId,
     );
-    if (!definition) {
-      return err(
-        CatalogApplicationError.puzzleDefinitionNotFound(
-          proposal.puzzleDefinitionId,
-        ),
-      );
-    }
+    if (!definition) {}
 
     const outcome = proposal.edit(
killedBy: makeEditChangeProposal fails with PuzzleDefinitionNotFound when the target definition has disappeared
statusReason: Cannot read properties of null (reading 'toState')

[Killed] ConditionalExpression
catalog/application/use-cases/edit-change-proposal.ts:56:9
       cmd.comment,
       deps.clock.now(),
     );
-    if (outcome.isErr) return err(outcome.error);
+    if (true) return err(outcome.error);
 
     await deps.proposals.save(proposal);
killedBy: makeEditChangeProposal replaces changes/comment and re-derives the baseline against the CURRENT definition
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
catalog/application/use-cases/edit-change-proposal.ts:56:9
       cmd.comment,
       deps.clock.now(),
     );
-    if (outcome.isErr) return err(outcome.error);
+    if (false) return err(outcome.error);
 
     await deps.proposals.save(proposal);
killedBy: makeEditChangeProposal propagates ProposalNotPending from the aggregate
statusReason: expected false to be true // Object.is equality
