[Killed] BlockStatement
catalog/application/use-cases/file-change-proposal.ts:42:22
     Result<ChangeProposalId, CatalogError | CatalogApplicationError>
   > => {
     const definition = await deps.definitions.findById(cmd.puzzleDefinitionId);
-    if (!definition) {
-      return err(
-        CatalogApplicationError.puzzleDefinitionNotFound(
-          cmd.puzzleDefinitionId,
-        ),
-      );
-    }
+    if (!definition) {}
     if (definition.status !== "approved") {
       return err(
killedBy: makeFileChangeProposal rejects a proposal against a missing definition
statusReason: Cannot read properties of null (reading 'status')

[Killed] ConditionalExpression
catalog/application/use-cases/file-change-proposal.ts:42:9
     Result<ChangeProposalId, CatalogError | CatalogApplicationError>
   > => {
     const definition = await deps.definitions.findById(cmd.puzzleDefinitionId);
-    if (!definition) {
+    if (true) {
       return err(
         CatalogApplicationError.puzzleDefinitionNotFound(
killedBy: makeFileChangeProposal files a pending proposal with a server-derived baseline and publishes ChangeProposalFiled
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
catalog/application/use-cases/file-change-proposal.ts:49:9
         ),
       );
     }
-    if (definition.status !== "approved") {
+    if (true) {
       return err(
         CatalogApplicationError.definitionNotProposable(
killedBy: makeFileChangeProposal files a pending proposal with a server-derived baseline and publishes ChangeProposalFiled
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
catalog/application/use-cases/file-change-proposal.ts:49:9
         ),
       );
     }
-    if (definition.status !== "approved") {
+    if (definition.status === "approved") {
       return err(
         CatalogApplicationError.definitionNotProposable(
killedBy: makeFileChangeProposal files a pending proposal with a server-derived baseline and publishes ChangeProposalFiled
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
catalog/application/use-cases/file-change-proposal.ts:62:9
       cmd.puzzleDefinitionId,
       cmd.proposedBy,
     );
-    if (open) {
+    if (true) {
       return err(
         CatalogApplicationError.openProposalAlreadyExists(
killedBy: makeFileChangeProposal files a pending proposal with a server-derived baseline and publishes ChangeProposalFiled
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
catalog/application/use-cases/file-change-proposal.ts:62:9
       cmd.puzzleDefinitionId,
       cmd.proposedBy,
     );
-    if (open) {
+    if (false) {
       return err(
         CatalogApplicationError.openProposalAlreadyExists(
killedBy: makeFileChangeProposal enforces one OPEN proposal per (definition, proposer)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
catalog/application/use-cases/file-change-proposal.ts:79:9
       comment: cmd.comment,
       now: deps.clock.now(),
     });
-    if (proposal.isErr) return err(proposal.error);
+    if (false) return err(proposal.error);
 
     await deps.proposals.save(proposal.value);
killedBy: makeFileChangeProposal propagates aggregate validation failures without saving
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
catalog/application/use-cases/file-change-proposal.ts:79:9
       comment: cmd.comment,
       now: deps.clock.now(),
     });
-    if (proposal.isErr) return err(proposal.error);
+    if (true) return err(proposal.error);
 
     await deps.proposals.save(proposal.value);
killedBy: makeFileChangeProposal files a pending proposal with a server-derived baseline and publishes ChangeProposalFiled
statusReason: expected false to be true // Object.is equality
