[Killed] ConditionalExpression
catalog/application/use-cases/proposal-baseline.ts:14:12
 ): PuzzleDefinitionChanges => {
   const state = definition.toState();
   return {
-    title: changes.title !== undefined ? state.title : undefined,
+    title: false ? state.title : undefined,
     description:
       changes.description !== undefined ? state.description : undefined,
killedBy: makeFileChangeProposal files a pending proposal with a server-derived baseline and publishes ChangeProposalFiled
statusReason: expected { title: undefined, …(13) } to deeply equal { title: 'Starry Night', …(1) }

[Killed] EqualityOperator
catalog/application/use-cases/proposal-baseline.ts:14:12
 ): PuzzleDefinitionChanges => {
   const state = definition.toState();
   return {
-    title: changes.title !== undefined ? state.title : undefined,
+    title: changes.title === undefined ? state.title : undefined,
     description:
       changes.description !== undefined ? state.description : undefined,
killedBy: makeFileChangeProposal files a pending proposal with a server-derived baseline and publishes ChangeProposalFiled
statusReason: expected { title: undefined, …(13) } to deeply equal { title: 'Starry Night', …(1) }

[Killed] EqualityOperator
catalog/application/use-cases/proposal-baseline.ts:16:7
   return {
     title: changes.title !== undefined ? state.title : undefined,
     description:
-      changes.description !== undefined ? state.description : undefined,
+      changes.description === undefined ? state.description : undefined,
     brand: changes.brand !== undefined ? state.brand : undefined,
     publisher: changes.publisher !== undefined ? state.publisher : undefined,
killedBy: baselineFor snapshots every field the diff touches
statusReason: expected { title: 'Starry Night', …(13) } to deeply equal { title: 'Starry Night', …(13) }

[Killed] ConditionalExpression
catalog/application/use-cases/proposal-baseline.ts:16:7
   return {
     title: changes.title !== undefined ? state.title : undefined,
     description:
-      changes.description !== undefined ? state.description : undefined,
+      true ? state.description : undefined,
     brand: changes.brand !== undefined ? state.brand : undefined,
     publisher: changes.publisher !== undefined ? state.publisher : undefined,
killedBy: baselineFor leaves untouched fields undefined
statusReason: expected { title: 'Starry Night', …(13) } to deeply equal { title: 'Starry Night' }

[Killed] EqualityOperator
catalog/application/use-cases/proposal-baseline.ts:17:12
     title: changes.title !== undefined ? state.title : undefined,
     description:
       changes.description !== undefined ? state.description : undefined,
-    brand: changes.brand !== undefined ? state.brand : undefined,
+    brand: changes.brand === undefined ? state.brand : undefined,
     publisher: changes.publisher !== undefined ? state.publisher : undefined,
     pieceCount: changes.pieceCount !== undefined ? state.pieceCount : undefined,
killedBy: baselineFor snapshots every field the diff touches
statusReason: expected { title: 'Starry Night', …(13) } to deeply equal { title: 'Starry Night', …(13) }

[Killed] ConditionalExpression
catalog/application/use-cases/proposal-baseline.ts:17:12
     title: changes.title !== undefined ? state.title : undefined,
     description:
       changes.description !== undefined ? state.description : undefined,
-    brand: changes.brand !== undefined ? state.brand : undefined,
+    brand: false ? state.brand : undefined,
     publisher: changes.publisher !== undefined ? state.publisher : undefined,
     pieceCount: changes.pieceCount !== undefined ? state.pieceCount : undefined,
killedBy: baselineFor snapshots every field the diff touches
statusReason: expected { title: 'Starry Night', …(13) } to deeply equal { title: 'Starry Night', …(13) }

[Killed] ConditionalExpression
catalog/application/use-cases/proposal-baseline.ts:18:16
     description:
       changes.description !== undefined ? state.description : undefined,
     brand: changes.brand !== undefined ? state.brand : undefined,
-    publisher: changes.publisher !== undefined ? state.publisher : undefined,
+    publisher: false ? state.publisher : undefined,
     pieceCount: changes.pieceCount !== undefined ? state.pieceCount : undefined,
     artist: changes.artist !== undefined ? state.artist : undefined,
killedBy: baselineFor snapshots every field the diff touches
statusReason: expected { title: 'Starry Night', …(13) } to deeply equal { title: 'Starry Night', …(13) }

[Killed] EqualityOperator
catalog/application/use-cases/proposal-baseline.ts:18:16
     description:
       changes.description !== undefined ? state.description : undefined,
     brand: changes.brand !== undefined ? state.brand : undefined,
-    publisher: changes.publisher !== undefined ? state.publisher : undefined,
+    publisher: changes.publisher === undefined ? state.publisher : undefined,
     pieceCount: changes.pieceCount !== undefined ? state.pieceCount : undefined,
     artist: changes.artist !== undefined ? state.artist : undefined,
killedBy: baselineFor snapshots every field the diff touches
statusReason: expected { title: 'Starry Night', …(13) } to deeply equal { title: 'Starry Night', …(13) }

[Killed] ConditionalExpression
catalog/application/use-cases/proposal-baseline.ts:19:17
       changes.description !== undefined ? state.description : undefined,
     brand: changes.brand !== undefined ? state.brand : undefined,
     publisher: changes.publisher !== undefined ? state.publisher : undefined,
-    pieceCount: changes.pieceCount !== undefined ? state.pieceCount : undefined,
+    pieceCount: false ? state.pieceCount : undefined,
     artist: changes.artist !== undefined ? state.artist : undefined,
     series: changes.series !== undefined ? state.series : undefined,
killedBy: baselineFor snapshots every field the diff touches
statusReason: expected { title: 'Starry Night', …(13) } to deeply equal { title: 'Starry Night', …(13) }

[Killed] EqualityOperator
catalog/application/use-cases/proposal-baseline.ts:19:17
       changes.description !== undefined ? state.description : undefined,
     brand: changes.brand !== undefined ? state.brand : undefined,
     publisher: changes.publisher !== undefined ? state.publisher : undefined,
-    pieceCount: changes.pieceCount !== undefined ? state.pieceCount : undefined,
+    pieceCount: changes.pieceCount === undefined ? state.pieceCount : undefined,
     artist: changes.artist !== undefined ? state.artist : undefined,
     series: changes.series !== undefined ? state.series : undefined,
killedBy: baselineFor snapshots every field the diff touches
statusReason: expected { title: 'Starry Night', …(13) } to deeply equal { title: 'Starry Night', …(13) }

[Killed] ConditionalExpression
catalog/application/use-cases/proposal-baseline.ts:20:13
     brand: changes.brand !== undefined ? state.brand : undefined,
     publisher: changes.publisher !== undefined ? state.publisher : undefined,
     pieceCount: changes.pieceCount !== undefined ? state.pieceCount : undefined,
-    artist: changes.artist !== undefined ? state.artist : undefined,
+    artist: false ? state.artist : undefined,
     series: changes.series !== undefined ? state.series : undefined,
     barcodes:
killedBy: baselineFor snapshots every field the diff touches
statusReason: expected { title: 'Starry Night', …(13) } to deeply equal { title: 'Starry Night', …(13) }

[Killed] EqualityOperator
catalog/application/use-cases/proposal-baseline.ts:20:13
     brand: changes.brand !== undefined ? state.brand : undefined,
     publisher: changes.publisher !== undefined ? state.publisher : undefined,
     pieceCount: changes.pieceCount !== undefined ? state.pieceCount : undefined,
-    artist: changes.artist !== undefined ? state.artist : undefined,
+    artist: changes.artist === undefined ? state.artist : undefined,
     series: changes.series !== undefined ? state.series : undefined,
     barcodes:
killedBy: baselineFor snapshots every field the diff touches
statusReason: expected { title: 'Starry Night', …(13) } to deeply equal { title: 'Starry Night', …(13) }

[Killed] ConditionalExpression
catalog/application/use-cases/proposal-baseline.ts:21:13
     publisher: changes.publisher !== undefined ? state.publisher : undefined,
     pieceCount: changes.pieceCount !== undefined ? state.pieceCount : undefined,
     artist: changes.artist !== undefined ? state.artist : undefined,
-    series: changes.series !== undefined ? state.series : undefined,
+    series: true ? state.series : undefined,
     barcodes:
       changes.barcodes !== undefined
killedBy: baselineFor leaves untouched fields undefined
statusReason: expected { title: 'Starry Night', …(13) } to deeply equal { title: 'Starry Night' }

[Killed] ConditionalExpression
catalog/application/use-cases/proposal-baseline.ts:21:13
     publisher: changes.publisher !== undefined ? state.publisher : undefined,
     pieceCount: changes.pieceCount !== undefined ? state.pieceCount : undefined,
     artist: changes.artist !== undefined ? state.artist : undefined,
-    series: changes.series !== undefined ? state.series : undefined,
+    series: false ? state.series : undefined,
     barcodes:
       changes.barcodes !== undefined
killedBy: baselineFor snapshots every field the diff touches
statusReason: expected { title: 'Starry Night', …(13) } to deeply equal { title: 'Starry Night', …(13) }

[Killed] EqualityOperator
catalog/application/use-cases/proposal-baseline.ts:23:7
     artist: changes.artist !== undefined ? state.artist : undefined,
     series: changes.series !== undefined ? state.series : undefined,
     barcodes:
-      changes.barcodes !== undefined
+      changes.barcodes === undefined
         ? { ean: state.ean, upc: state.upc, modelNumber: state.modelNumber }
         : undefined,
killedBy: baselineFor snapshots every field the diff touches
statusReason: expected { title: 'Starry Night', …(13) } to deeply equal { title: 'Starry Night', …(13) }

[Killed] ConditionalExpression
catalog/application/use-cases/proposal-baseline.ts:23:7
     artist: changes.artist !== undefined ? state.artist : undefined,
     series: changes.series !== undefined ? state.series : undefined,
     barcodes:
-      changes.barcodes !== undefined
+      false
         ? { ean: state.ean, upc: state.upc, modelNumber: state.modelNumber }
         : undefined,
killedBy: baselineFor snapshots every field the diff touches
statusReason: expected { title: 'Starry Night', …(13) } to deeply equal { title: 'Starry Night', …(13) }

[Killed] EqualityOperator
catalog/application/use-cases/proposal-baseline.ts:26:17
       changes.barcodes !== undefined
         ? { ean: state.ean, upc: state.upc, modelNumber: state.modelNumber }
         : undefined,
-    dimensions: changes.dimensions !== undefined ? state.dimensions : undefined,
+    dimensions: changes.dimensions === undefined ? state.dimensions : undefined,
     shape: changes.shape !== undefined ? state.shape : undefined,
     difficulty: changes.difficulty !== undefined ? state.difficulty : undefined,
killedBy: baselineFor snapshots every field the diff touches
statusReason: expected { title: 'Starry Night', …(13) } to deeply equal { title: 'Starry Night', …(13) }

[Killed] ConditionalExpression
catalog/application/use-cases/proposal-baseline.ts:26:17
       changes.barcodes !== undefined
         ? { ean: state.ean, upc: state.upc, modelNumber: state.modelNumber }
         : undefined,
-    dimensions: changes.dimensions !== undefined ? state.dimensions : undefined,
+    dimensions: false ? state.dimensions : undefined,
     shape: changes.shape !== undefined ? state.shape : undefined,
     difficulty: changes.difficulty !== undefined ? state.difficulty : undefined,
killedBy: baselineFor snapshots every field the diff touches
statusReason: expected { title: 'Starry Night', …(13) } to deeply equal { title: 'Starry Night', …(13) }

[Killed] EqualityOperator
catalog/application/use-cases/proposal-baseline.ts:27:12
         ? { ean: state.ean, upc: state.upc, modelNumber: state.modelNumber }
         : undefined,
     dimensions: changes.dimensions !== undefined ? state.dimensions : undefined,
-    shape: changes.shape !== undefined ? state.shape : undefined,
+    shape: changes.shape === undefined ? state.shape : undefined,
     difficulty: changes.difficulty !== undefined ? state.difficulty : undefined,
     category: changes.category !== undefined ? state.category : undefined,
killedBy: baselineFor snapshots every field the diff touches
statusReason: expected { title: 'Starry Night', …(13) } to deeply equal { title: 'Starry Night', …(13) }

[Killed] ConditionalExpression
catalog/application/use-cases/proposal-baseline.ts:27:12
         ? { ean: state.ean, upc: state.upc, modelNumber: state.modelNumber }
         : undefined,
     dimensions: changes.dimensions !== undefined ? state.dimensions : undefined,
-    shape: changes.shape !== undefined ? state.shape : undefined,
+    shape: false ? state.shape : undefined,
     difficulty: changes.difficulty !== undefined ? state.difficulty : undefined,
     category: changes.category !== undefined ? state.category : undefined,
killedBy: baselineFor snapshots every field the diff touches
statusReason: expected { title: 'Starry Night', …(13) } to deeply equal { title: 'Starry Night', …(13) }

[Killed] ConditionalExpression
catalog/application/use-cases/proposal-baseline.ts:28:17
         : undefined,
     dimensions: changes.dimensions !== undefined ? state.dimensions : undefined,
     shape: changes.shape !== undefined ? state.shape : undefined,
-    difficulty: changes.difficulty !== undefined ? state.difficulty : undefined,
+    difficulty: false ? state.difficulty : undefined,
     category: changes.category !== undefined ? state.category : undefined,
     tags:
killedBy: baselineFor snapshots every field the diff touches
statusReason: expected { title: 'Starry Night', …(13) } to deeply equal { title: 'Starry Night', …(13) }

[Killed] EqualityOperator
catalog/application/use-cases/proposal-baseline.ts:28:17
         : undefined,
     dimensions: changes.dimensions !== undefined ? state.dimensions : undefined,
     shape: changes.shape !== undefined ? state.shape : undefined,
-    difficulty: changes.difficulty !== undefined ? state.difficulty : undefined,
+    difficulty: changes.difficulty === undefined ? state.difficulty : undefined,
     category: changes.category !== undefined ? state.category : undefined,
     tags:
killedBy: baselineFor snapshots every field the diff touches
statusReason: expected { title: 'Starry Night', …(13) } to deeply equal { title: 'Starry Night', …(13) }

[Killed] EqualityOperator
catalog/application/use-cases/proposal-baseline.ts:29:15
     dimensions: changes.dimensions !== undefined ? state.dimensions : undefined,
     shape: changes.shape !== undefined ? state.shape : undefined,
     difficulty: changes.difficulty !== undefined ? state.difficulty : undefined,
-    category: changes.category !== undefined ? state.category : undefined,
+    category: changes.category === undefined ? state.category : undefined,
     tags:
       changes.tags !== undefined
killedBy: baselineFor snapshots every field the diff touches
statusReason: expected { title: 'Starry Night', …(13) } to deeply equal { title: 'Starry Night', …(13) }

[Killed] ConditionalExpression
catalog/application/use-cases/proposal-baseline.ts:29:15
     dimensions: changes.dimensions !== undefined ? state.dimensions : undefined,
     shape: changes.shape !== undefined ? state.shape : undefined,
     difficulty: changes.difficulty !== undefined ? state.difficulty : undefined,
-    category: changes.category !== undefined ? state.category : undefined,
+    category: true ? state.category : undefined,
     tags:
       changes.tags !== undefined
killedBy: baselineFor leaves untouched fields undefined
statusReason: expected { title: 'Starry Night', …(13) } to deeply equal { title: 'Starry Night' }

[Killed] EqualityOperator
catalog/application/use-cases/proposal-baseline.ts:31:7
     difficulty: changes.difficulty !== undefined ? state.difficulty : undefined,
     category: changes.category !== undefined ? state.category : undefined,
     tags:
-      changes.tags !== undefined
+      changes.tags === undefined
         ? state.tags
           ? [...state.tags]
killedBy: baselineFor snapshots every field the diff touches
statusReason: expected { title: 'Starry Night', …(13) } to deeply equal { title: 'Starry Night', …(13) }

[Killed] ConditionalExpression
catalog/application/use-cases/proposal-baseline.ts:31:7
     difficulty: changes.difficulty !== undefined ? state.difficulty : undefined,
     category: changes.category !== undefined ? state.category : undefined,
     tags:
-      changes.tags !== undefined
+      true
         ? state.tags
           ? [...state.tags]
killedBy: baselineFor leaves untouched fields undefined
statusReason: expected { title: 'Starry Night', …(13) } to deeply equal { title: 'Starry Night' }

[Killed] ConditionalExpression
catalog/application/use-cases/proposal-baseline.ts:36:12
           ? [...state.tags]
           : undefined
         : undefined,
-    image: changes.image !== undefined ? state.image : undefined,
+    image: true ? state.image : undefined,
   };
 };
killedBy: baselineFor leaves untouched fields undefined
statusReason: expected { title: 'Starry Night', …(13) } to deeply equal { title: 'Starry Night' }

[Killed] EqualityOperator
catalog/application/use-cases/proposal-baseline.ts:36:12
           ? [...state.tags]
           : undefined
         : undefined,
-    image: changes.image !== undefined ? state.image : undefined,
+    image: changes.image === undefined ? state.image : undefined,
   };
 };
killedBy: baselineFor snapshots every field the diff touches
statusReason: expected { title: 'Starry Night', …(13) } to deeply equal { title: 'Starry Night', …(13) }
