[Killed] BlockStatement
catalog/application/use-cases/reenable-puzzle-definition.ts:9:32
 
 export const makeReenablePuzzleDefinition = (
   deps: DefinitionActionDeps,
-): ReenablePuzzleDefinition => {
-  const run = runDefinitionAction(deps, (definition, now) =>
-    definition.reenable(now),
-  );
-  return (cmd) => run(cmd.puzzleDefinitionId);
-};
+): ReenablePuzzleDefinition => {};
 
killedBy: Catalog PuzzleDefinition use cases re-enables a disabled definition and publishes PuzzleDefinitionReenabled
statusReason: reenable is not a function

[Killed] ArrowFunction
catalog/application/use-cases/reenable-puzzle-definition.ts:10:41
 export const makeReenablePuzzleDefinition = (
   deps: DefinitionActionDeps,
 ): ReenablePuzzleDefinition => {
-  const run = runDefinitionAction(deps, (definition, now) =>
-    definition.reenable(now),
+  const run = runDefinitionAction(deps, () => undefined,
   );
   return (cmd) => run(cmd.puzzleDefinitionId);
killedBy: Catalog PuzzleDefinition use cases re-enables a disabled definition and publishes PuzzleDefinitionReenabled
statusReason: Cannot read properties of undefined (reading 'isErr')
