[Killed] BlockStatement
catalog/application/use-cases/reject-puzzle-definition.ts:9:30
 
 export const makeRejectPuzzleDefinition = (
   deps: DefinitionActionDeps,
-): RejectPuzzleDefinition => {
-  const run = runDefinitionAction(deps, (definition, now) =>
-    definition.reject(now),
-  );
-  return (cmd) => run(cmd.puzzleDefinitionId);
-};
+): RejectPuzzleDefinition => {};
 
killedBy: Catalog PuzzleDefinition use cases rejects a definition and publishes PuzzleDefinitionRejected
statusReason: reject is not a function

[Killed] ArrowFunction
catalog/application/use-cases/reject-puzzle-definition.ts:10:41
 export const makeRejectPuzzleDefinition = (
   deps: DefinitionActionDeps,
 ): RejectPuzzleDefinition => {
-  const run = runDefinitionAction(deps, (definition, now) =>
-    definition.reject(now),
+  const run = runDefinitionAction(deps, () => undefined,
   );
   return (cmd) => run(cmd.puzzleDefinitionId);
killedBy: Catalog PuzzleDefinition use cases rejects a definition and publishes PuzzleDefinitionRejected
statusReason: Cannot read properties of undefined (reading 'isErr')
