[Killed] ArrowFunction
catalog/application/use-cases/set-catalog-category-active.ts:24:3
 // Transaction script: load (→ CatalogCategoryNotFound), soft (de)activate (never delete),
 // persist, publish. The aggregate makes the toggle idempotent (no event when unchanged).
 export const makeSetCatalogCategoryActive =
-  (deps: SetCatalogCategoryActiveDeps): SetCatalogCategoryActive =>
-  async (
-    cmd: SetCatalogCategoryActiveCommand,
-  ): Promise<Result<void, CatalogApplicationError>> => {
-    const category = await deps.categories.findById(cmd.catalogCategoryId);
-    if (!category) {
-      return err(
-        CatalogApplicationError.catalogCategoryNotFound(cmd.catalogCategoryId),
-      );
-    }
-
-    const now = deps.clock.now();
-    if (cmd.isActive) category.activate(now);
-    else category.deactivate(now);
-
-    await deps.categories.save(category);
-    await deps.events.publish(category.pullEvents());
-    return ok(undefined);
-  };
+  () => undefined;
 
killedBy: Catalog category use cases soft-deactivates so the node drops out of listActive but is not deleted
statusReason: setActive is not a function

[Killed] BlockStatement
catalog/application/use-cases/set-catalog-category-active.ts:27:56
   (deps: SetCatalogCategoryActiveDeps): SetCatalogCategoryActive =>
   async (
     cmd: SetCatalogCategoryActiveCommand,
-  ): Promise<Result<void, CatalogApplicationError>> => {
-    const category = await deps.categories.findById(cmd.catalogCategoryId);
-    if (!category) {
-      return err(
-        CatalogApplicationError.catalogCategoryNotFound(cmd.catalogCategoryId),
-      );
-    }
-
-    const now = deps.clock.now();
-    if (cmd.isActive) category.activate(now);
-    else category.deactivate(now);
-
-    await deps.categories.save(category);
-    await deps.events.publish(category.pullEvents());
-    return ok(undefined);
-  };
+  ): Promise<Result<void, CatalogApplicationError>> => {};
 
killedBy: Catalog category use cases soft-deactivates so the node drops out of listActive but is not deleted
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] ConditionalExpression
catalog/application/use-cases/set-catalog-category-active.ts:29:9
     cmd: SetCatalogCategoryActiveCommand,
   ): Promise<Result<void, CatalogApplicationError>> => {
     const category = await deps.categories.findById(cmd.catalogCategoryId);
-    if (!category) {
+    if (false) {
       return err(
         CatalogApplicationError.catalogCategoryNotFound(cmd.catalogCategoryId),
killedBy: Catalog category use cases rejects (de)activating an unknown category
statusReason: Cannot read properties of null (reading 'activate')

[Killed] BooleanLiteral
catalog/application/use-cases/set-catalog-category-active.ts:29:9
     cmd: SetCatalogCategoryActiveCommand,
   ): Promise<Result<void, CatalogApplicationError>> => {
     const category = await deps.categories.findById(cmd.catalogCategoryId);
-    if (!category) {
+    if (category) {
       return err(
         CatalogApplicationError.catalogCategoryNotFound(cmd.catalogCategoryId),
killedBy: Catalog category use cases soft-deactivates so the node drops out of listActive but is not deleted
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
catalog/application/use-cases/set-catalog-category-active.ts:36:9
     }
 
     const now = deps.clock.now();
-    if (cmd.isActive) category.activate(now);
+    if (true) category.activate(now);
     else category.deactivate(now);
 
killedBy: Catalog category use cases soft-deactivates so the node drops out of listActive but is not deleted
statusReason: expected [ CatalogCategory{ …(2) } ] to have a length of +0 but got 1

[Killed] ConditionalExpression
catalog/application/use-cases/set-catalog-category-active.ts:36:9
     }
 
     const now = deps.clock.now();
-    if (cmd.isActive) category.activate(now);
+    if (false) category.activate(now);
     else category.deactivate(now);
 
killedBy: Catalog category use cases reactivates a previously deactivated category
statusReason: expected [] to have a length of 1 but got +0
