[Killed] BlockStatement
catalog/application/use-cases/update-puzzle-definition.ts:12:30
 
 export const makeUpdatePuzzleDefinition = (
   deps: DefinitionActionDeps,
-): UpdatePuzzleDefinition => {
-  return (cmd: UpdatePuzzleDefinitionCommand) =>
-    runDefinitionAction(deps, (definition, now) =>
-      definition.update(cmd.changes, now),
-    )(cmd.puzzleDefinitionId);
-};
+): UpdatePuzzleDefinition => {};
 
killedBy: Catalog PuzzleDefinition use cases updates a definition and publishes PuzzleDefinitionUpdated
statusReason: update is not a function

[Killed] ArrowFunction
catalog/application/use-cases/update-puzzle-definition.ts:13:10
 export const makeUpdatePuzzleDefinition = (
   deps: DefinitionActionDeps,
 ): UpdatePuzzleDefinition => {
-  return (cmd: UpdatePuzzleDefinitionCommand) =>
-    runDefinitionAction(deps, (definition, now) =>
-      definition.update(cmd.changes, now),
-    )(cmd.puzzleDefinitionId);
+  return () => undefined;
 };
 
killedBy: Catalog PuzzleDefinition use cases updates a definition and publishes PuzzleDefinitionUpdated
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] ArrowFunction
catalog/application/use-cases/update-puzzle-definition.ts:14:31
   deps: DefinitionActionDeps,
 ): UpdatePuzzleDefinition => {
   return (cmd: UpdatePuzzleDefinitionCommand) =>
-    runDefinitionAction(deps, (definition, now) =>
-      definition.update(cmd.changes, now),
+    runDefinitionAction(deps, () => undefined,
     )(cmd.puzzleDefinitionId);
 };
killedBy: Catalog PuzzleDefinition use cases updates a definition and publishes PuzzleDefinitionUpdated
statusReason: Cannot read properties of undefined (reading 'isErr')
