[Killed] ArrowFunction
src/catalog/domain/barcode.ts:4:21
 import { err, ok, Result } from "../../shared-kernel";
 import { CatalogError } from "./errors";
 
-const isAllDigits = (value: string): boolean => /^[0-9]+$/.test(value);
+const isAllDigits = () => undefined;
 
 // GS1 mod-10 check digit (shared by EAN-13 and UPC-A): weight digits 3-1-3-… from the right
killedBy: PuzzleDefinition.submit flattens validated barcodes into state columns
statusReason: setup failed: Invalid EAN: must be 13 digits

[Killed] Regex
src/catalog/domain/barcode.ts:4:49
 import { err, ok, Result } from "../../shared-kernel";
 import { CatalogError } from "./errors";
 
-const isAllDigits = (value: string): boolean => /^[0-9]+$/.test(value);
+const isAllDigits = (value: string): boolean => /^[^0-9]+$/.test(value);
 
 // GS1 mod-10 check digit (shared by EAN-13 and UPC-A): weight digits 3-1-3-… from the right
killedBy: makeFileChangeProposal snapshots the grouped barcode baseline from the definition's flat fields
statusReason: seed failed

[Killed] BlockStatement
src/catalog/domain/barcode.ts:8:57
 
 // GS1 mod-10 check digit (shared by EAN-13 and UPC-A): weight digits 3-1-3-… from the right
 // (excluding the check digit), sum, and the check digit makes the total a multiple of 10.
-const hasValidCheckDigit = (digits: string): boolean => {
-  const body = digits.slice(0, -1);
-  const check = Number(digits[digits.length - 1]);
-  let sum = 0;
-  for (let i = 0; i < body.length; i += 1) {
-    const digit = Number(body[body.length - 1 - i]);
-    sum += i % 2 === 0 ? digit * 3 : digit;
-  }
-  return (10 - (sum % 10)) % 10 === check;
-};
+const hasValidCheckDigit = (digits: string): boolean => {};
 
 // European Article Number: 13 digits with a valid GS1 check digit.
killedBy: baselineFor snapshots every field the diff touches
statusReason: setup failed: Invalid EAN: check digit does not match

[Killed] MethodExpression
src/catalog/domain/barcode.ts:9:16
 // GS1 mod-10 check digit (shared by EAN-13 and UPC-A): weight digits 3-1-3-… from the right
 // (excluding the check digit), sum, and the check digit makes the total a multiple of 10.
 const hasValidCheckDigit = (digits: string): boolean => {
-  const body = digits.slice(0, -1);
+  const body = digits;
   const check = Number(digits[digits.length - 1]);
   let sum = 0;
killedBy: baselineFor snapshots every field the diff touches
statusReason: setup failed: Invalid EAN: check digit does not match

[Killed] UnaryOperator
src/catalog/domain/barcode.ts:9:32
 // GS1 mod-10 check digit (shared by EAN-13 and UPC-A): weight digits 3-1-3-… from the right
 // (excluding the check digit), sum, and the check digit makes the total a multiple of 10.
 const hasValidCheckDigit = (digits: string): boolean => {
-  const body = digits.slice(0, -1);
+  const body = digits.slice(0, +1);
   const check = Number(digits[digits.length - 1]);
   let sum = 0;
killedBy: baselineFor snapshots every field the diff touches
statusReason: setup failed: Invalid EAN: check digit does not match

[Killed] ArithmeticOperator
src/catalog/domain/barcode.ts:10:31
 // (excluding the check digit), sum, and the check digit makes the total a multiple of 10.
 const hasValidCheckDigit = (digits: string): boolean => {
   const body = digits.slice(0, -1);
-  const check = Number(digits[digits.length - 1]);
+  const check = Number(digits[digits.length + 1]);
   let sum = 0;
   for (let i = 0; i < body.length; i += 1) {
killedBy: makeFileChangeProposal snapshots the grouped barcode baseline from the definition's flat fields
statusReason: seed failed

[Killed] EqualityOperator
src/catalog/domain/barcode.ts:12:19
   const body = digits.slice(0, -1);
   const check = Number(digits[digits.length - 1]);
   let sum = 0;
-  for (let i = 0; i < body.length; i += 1) {
+  for (let i = 0; i <= body.length; i += 1) {
     const digit = Number(body[body.length - 1 - i]);
     sum += i % 2 === 0 ? digit * 3 : digit;
killedBy: baselineFor snapshots every field the diff touches
statusReason: setup failed: Invalid EAN: check digit does not match

[Killed] EqualityOperator
src/catalog/domain/barcode.ts:12:19
   const body = digits.slice(0, -1);
   const check = Number(digits[digits.length - 1]);
   let sum = 0;
-  for (let i = 0; i < body.length; i += 1) {
+  for (let i = 0; i >= body.length; i += 1) {
     const digit = Number(body[body.length - 1 - i]);
     sum += i % 2 === 0 ? digit * 3 : digit;
killedBy: Ean accepts a valid EAN-13 with a correct check digit
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
src/catalog/domain/barcode.ts:13:31
   const check = Number(digits[digits.length - 1]);
   let sum = 0;
   for (let i = 0; i < body.length; i += 1) {
-    const digit = Number(body[body.length - 1 - i]);
+    const digit = Number(body[body.length - 1 + i]);
     sum += i % 2 === 0 ? digit * 3 : digit;
   }
killedBy: baselineFor snapshots every field the diff touches
statusReason: setup failed: Invalid EAN: check digit does not match

[Killed] ArithmeticOperator
src/catalog/domain/barcode.ts:13:31
   const check = Number(digits[digits.length - 1]);
   let sum = 0;
   for (let i = 0; i < body.length; i += 1) {
-    const digit = Number(body[body.length - 1 - i]);
+    const digit = Number(body[body.length + 1 - i]);
     sum += i % 2 === 0 ? digit * 3 : digit;
   }
killedBy: makeFileChangeProposal snapshots the grouped barcode baseline from the definition's flat fields
statusReason: seed failed

[Killed] EqualityOperator
src/catalog/domain/barcode.ts:14:12
   let sum = 0;
   for (let i = 0; i < body.length; i += 1) {
     const digit = Number(body[body.length - 1 - i]);
-    sum += i % 2 === 0 ? digit * 3 : digit;
+    sum += i % 2 !== 0 ? digit * 3 : digit;
   }
   return (10 - (sum % 10)) % 10 === check;
killedBy: Ean accepts a valid EAN-13 with a correct check digit
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/catalog/domain/barcode.ts:14:12
   let sum = 0;
   for (let i = 0; i < body.length; i += 1) {
     const digit = Number(body[body.length - 1 - i]);
-    sum += i % 2 === 0 ? digit * 3 : digit;
+    sum += false ? digit * 3 : digit;
   }
   return (10 - (sum % 10)) % 10 === check;
killedBy: makeFileChangeProposal snapshots the grouped barcode baseline from the definition's flat fields
statusReason: seed failed

[Killed] EqualityOperator
src/catalog/domain/barcode.ts:16:10
     const digit = Number(body[body.length - 1 - i]);
     sum += i % 2 === 0 ? digit * 3 : digit;
   }
-  return (10 - (sum % 10)) % 10 === check;
+  return (10 - sum % 10) % 10 !== check;
 };
 
killedBy: Ean accepts a valid EAN-13 with a correct check digit
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/catalog/domain/barcode.ts:16:10
     const digit = Number(body[body.length - 1 - i]);
     sum += i % 2 === 0 ? digit * 3 : digit;
   }
-  return (10 - (sum % 10)) % 10 === check;
+  return false;
 };
 
killedBy: makeFileChangeProposal snapshots the grouped barcode baseline from the definition's flat fields
statusReason: seed failed

[Killed] BlockStatement
src/catalog/domain/barcode.ts:23:59
 export class Ean {
   private constructor(readonly value: string) {}
 
-  static create(value: string): Result<Ean, CatalogError> {
-    if (value.length !== 13 || !isAllDigits(value)) {
-      return err(CatalogError.invalidBarcode("EAN", "must be 13 digits"));
-    }
-    if (!hasValidCheckDigit(value)) {
-      return err(
-        CatalogError.invalidBarcode("EAN", "check digit does not match"),
-      );
-    }
-    return ok(new Ean(value));
-  }
+  static create(value: string): Result<Ean, CatalogError> {}
 }
 
killedBy: Catalog PuzzleDefinition use cases rejects a duplicate barcode via the repository (DuplicateBarcode)
statusReason: Cannot read properties of undefined (reading 'isErr')

[Killed] ConditionalExpression
src/catalog/domain/barcode.ts:24:9
   private constructor(readonly value: string) {}
 
   static create(value: string): Result<Ean, CatalogError> {
-    if (value.length !== 13 || !isAllDigits(value)) {
+    if (true) {
       return err(CatalogError.invalidBarcode("EAN", "must be 13 digits"));
     }
killedBy: Catalog PuzzleDefinition use cases rejects a duplicate barcode via the repository (DuplicateBarcode)
statusReason: submit failed: InvalidBarcode

[Killed] ConditionalExpression
src/catalog/domain/barcode.ts:24:9
   private constructor(readonly value: string) {}
 
   static create(value: string): Result<Ean, CatalogError> {
-    if (value.length !== 13 || !isAllDigits(value)) {
+    if (false) {
       return err(CatalogError.invalidBarcode("EAN", "must be 13 digits"));
     }
killedBy: Ean rejects too short (12 digits) with InvalidBarcode (400638133393)
statusReason: expected 'Invalid EAN: check digit does not mat…' to be 'Invalid EAN: must be 13 digits' // Object.is equality

[Killed] StringLiteral
src/catalog/domain/barcode.ts:25:53
 
   static create(value: string): Result<Ean, CatalogError> {
     if (value.length !== 13 || !isAllDigits(value)) {
-      return err(CatalogError.invalidBarcode("EAN", "must be 13 digits"));
+      return err(CatalogError.invalidBarcode("EAN", ""));
     }
     if (!hasValidCheckDigit(value)) {
killedBy: Ean rejects too short (12 digits) with InvalidBarcode (400638133393)
statusReason: expected 'Invalid EAN: ' to be 'Invalid EAN: must be 13 digits' // Object.is equality

[Killed] BlockStatement
src/catalog/domain/barcode.ts:27:37
     if (value.length !== 13 || !isAllDigits(value)) {
       return err(CatalogError.invalidBarcode("EAN", "must be 13 digits"));
     }
-    if (!hasValidCheckDigit(value)) {
-      return err(
-        CatalogError.invalidBarcode("EAN", "check digit does not match"),
-      );
-    }
+    if (!hasValidCheckDigit(value)) {}
     return ok(new Ean(value));
   }
killedBy: Ean rejects right length but bad check digit with InvalidBarcode (4006381333930)
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/catalog/domain/barcode.ts:27:9
     if (value.length !== 13 || !isAllDigits(value)) {
       return err(CatalogError.invalidBarcode("EAN", "must be 13 digits"));
     }
-    if (!hasValidCheckDigit(value)) {
+    if (hasValidCheckDigit(value)) {
       return err(
         CatalogError.invalidBarcode("EAN", "check digit does not match"),
killedBy: Ean accepts a valid EAN-13 with a correct check digit
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/catalog/domain/barcode.ts:29:37
     }
     if (!hasValidCheckDigit(value)) {
       return err(
-        CatalogError.invalidBarcode("EAN", "check digit does not match"),
+        CatalogError.invalidBarcode("", "check digit does not match"),
       );
     }
killedBy: Ean rejects right length but bad check digit with InvalidBarcode (4006381333930)
statusReason: expected 'Invalid : check digit does not match' to be 'Invalid EAN: check digit does not mat…' // Object.is equality

[Killed] BlockStatement
src/catalog/domain/barcode.ts:40:59
 export class Upc {
   private constructor(readonly value: string) {}
 
-  static create(value: string): Result<Upc, CatalogError> {
-    if (value.length !== 12 || !isAllDigits(value)) {
-      return err(CatalogError.invalidBarcode("UPC", "must be 12 digits"));
-    }
-    if (!hasValidCheckDigit(value)) {
-      return err(
-        CatalogError.invalidBarcode("UPC", "check digit does not match"),
-      );
-    }
-    return ok(new Upc(value));
-  }
+  static create(value: string): Result<Upc, CatalogError> {}
 }
 
killedBy: Upc accepts a valid UPC-A with a correct check digit
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] BlockStatement
src/catalog/domain/barcode.ts:41:53
   private constructor(readonly value: string) {}
 
   static create(value: string): Result<Upc, CatalogError> {
-    if (value.length !== 12 || !isAllDigits(value)) {
-      return err(CatalogError.invalidBarcode("UPC", "must be 12 digits"));
-    }
+    if (value.length !== 12 || !isAllDigits(value)) {}
     if (!hasValidCheckDigit(value)) {
       return err(
killedBy: Upc rejects too short (11 digits) with InvalidBarcode (03600029145)
statusReason: expected 'Invalid UPC: check digit does not mat…' to be 'Invalid UPC: must be 12 digits' // Object.is equality

[Killed] EqualityOperator
src/catalog/domain/barcode.ts:41:9
   private constructor(readonly value: string) {}
 
   static create(value: string): Result<Upc, CatalogError> {
-    if (value.length !== 12 || !isAllDigits(value)) {
+    if (value.length === 12 || !isAllDigits(value)) {
       return err(CatalogError.invalidBarcode("UPC", "must be 12 digits"));
     }
killedBy: Upc accepts a valid UPC-A with a correct check digit
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/catalog/domain/barcode.ts:44:37
     if (value.length !== 12 || !isAllDigits(value)) {
       return err(CatalogError.invalidBarcode("UPC", "must be 12 digits"));
     }
-    if (!hasValidCheckDigit(value)) {
-      return err(
-        CatalogError.invalidBarcode("UPC", "check digit does not match"),
-      );
-    }
+    if (!hasValidCheckDigit(value)) {}
     return ok(new Upc(value));
   }
killedBy: Upc rejects right length but bad check digit with InvalidBarcode (036000291451)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/catalog/domain/barcode.ts:44:9
     if (value.length !== 12 || !isAllDigits(value)) {
       return err(CatalogError.invalidBarcode("UPC", "must be 12 digits"));
     }
-    if (!hasValidCheckDigit(value)) {
+    if (true) {
       return err(
         CatalogError.invalidBarcode("UPC", "check digit does not match"),
killedBy: Upc accepts a valid UPC-A with a correct check digit
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/catalog/domain/barcode.ts:46:44
     }
     if (!hasValidCheckDigit(value)) {
       return err(
-        CatalogError.invalidBarcode("UPC", "check digit does not match"),
+        CatalogError.invalidBarcode("UPC", ""),
       );
     }
killedBy: Upc rejects right length but bad check digit with InvalidBarcode (036000291451)
statusReason: expected 'Invalid UPC: ' to be 'Invalid UPC: check digit does not mat…' // Object.is equality

[Killed] StringLiteral
src/catalog/domain/barcode.ts:46:37
     }
     if (!hasValidCheckDigit(value)) {
       return err(
-        CatalogError.invalidBarcode("UPC", "check digit does not match"),
+        CatalogError.invalidBarcode("", "check digit does not match"),
       );
     }
killedBy: Upc rejects right length but bad check digit with InvalidBarcode (036000291451)
statusReason: expected 'Invalid : check digit does not match' to be 'Invalid UPC: check digit does not mat…' // Object.is equality

[Killed] BlockStatement
src/catalog/domain/barcode.ts:57:67
 export class ModelNumber {
   private constructor(readonly value: string) {}
 
-  static create(value: string): Result<ModelNumber, CatalogError> {
-    const trimmed = value.trim();
-    if (trimmed.length === 0) {
-      return err(
-        CatalogError.invalidBarcode("model number", "must not be blank"),
-      );
-    }
-    return ok(new ModelNumber(trimmed));
-  }
+  static create(value: string): Result<ModelNumber, CatalogError> {}
 }
 
killedBy: ModelNumber trims and accepts a non-blank model number
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] MethodExpression
src/catalog/domain/barcode.ts:58:21
   private constructor(readonly value: string) {}
 
   static create(value: string): Result<ModelNumber, CatalogError> {
-    const trimmed = value.trim();
+    const trimmed = value;
     if (trimmed.length === 0) {
       return err(
killedBy: ModelNumber trims and accepts a non-blank model number
statusReason: expected '  RV-12345  ' to be 'RV-12345' // Object.is equality

[Killed] BlockStatement
src/catalog/domain/barcode.ts:59:31
 
   static create(value: string): Result<ModelNumber, CatalogError> {
     const trimmed = value.trim();
-    if (trimmed.length === 0) {
-      return err(
-        CatalogError.invalidBarcode("model number", "must not be blank"),
-      );
-    }
+    if (trimmed.length === 0) {}
     return ok(new ModelNumber(trimmed));
   }
killedBy: ModelNumber rejects a blank model number
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/catalog/domain/barcode.ts:59:9
 
   static create(value: string): Result<ModelNumber, CatalogError> {
     const trimmed = value.trim();
-    if (trimmed.length === 0) {
+    if (true) {
       return err(
         CatalogError.invalidBarcode("model number", "must not be blank"),
killedBy: ModelNumber trims and accepts a non-blank model number
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/catalog/domain/barcode.ts:61:37
     const trimmed = value.trim();
     if (trimmed.length === 0) {
       return err(
-        CatalogError.invalidBarcode("model number", "must not be blank"),
+        CatalogError.invalidBarcode("", "must not be blank"),
       );
     }
killedBy: ModelNumber rejects a blank model number
statusReason: expected 'Invalid : must not be blank' to be 'Invalid model number: must not be bla…' // Object.is equality

[Killed] BlockStatement
src/catalog/domain/barcode.ts:85:38
 // Validate whichever identifiers are present, short-circuiting on the first malformed one.
 export const validateBarcodes = (
   input: BarcodesInput,
-): Result<Barcodes, CatalogError> => {
-  let ean: Ean | undefined;
-  let upc: Upc | undefined;
-  let modelNumber: ModelNumber | undefined;
-
-  if (input.ean !== undefined) {
-    const r = Ean.create(input.ean);
-    if (r.isErr) return err(r.error);
-    ean = r.value;
-  }
-  if (input.upc !== undefined) {
-    const r = Upc.create(input.upc);
-    if (r.isErr) return err(r.error);
-    upc = r.value;
-  }
-  if (input.modelNumber !== undefined) {
-    const r = ModelNumber.create(input.modelNumber);
-    if (r.isErr) return err(r.error);
-    modelNumber = r.value;
-  }
-
-  return ok({ ean, upc, modelNumber });
-};
+): Result<Barcodes, CatalogError> => {};
 
killedBy: validateBarcodes validates only the present identifiers
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] ConditionalExpression
src/catalog/domain/barcode.ts:90:7
   let upc: Upc | undefined;
   let modelNumber: ModelNumber | undefined;
 
-  if (input.ean !== undefined) {
+  if (true) {
     const r = Ean.create(input.ean);
     if (r.isErr) return err(r.error);
killedBy: validateBarcodes validates a present UPC and model number, surfacing the parsed values
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/catalog/domain/barcode.ts:90:32
   let upc: Upc | undefined;
   let modelNumber: ModelNumber | undefined;
 
-  if (input.ean !== undefined) {
-    const r = Ean.create(input.ean);
-    if (r.isErr) return err(r.error);
-    ean = r.value;
-  }
+  if (input.ean !== undefined) {}
   if (input.upc !== undefined) {
     const r = Upc.create(input.upc);
killedBy: validateBarcodes validates only the present identifiers
statusReason: expected undefined to be '4006381333931' // Object.is equality

[Killed] ConditionalExpression
src/catalog/domain/barcode.ts:92:9
 
   if (input.ean !== undefined) {
     const r = Ean.create(input.ean);
-    if (r.isErr) return err(r.error);
+    if (true) return err(r.error);
     ean = r.value;
   }
killedBy: validateBarcodes validates only the present identifiers
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/catalog/domain/barcode.ts:92:9
 
   if (input.ean !== undefined) {
     const r = Ean.create(input.ean);
-    if (r.isErr) return err(r.error);
+    if (false) return err(r.error);
     ean = r.value;
   }
killedBy: Catalog PuzzleDefinition use cases delegates barcode-format validation to the aggregate
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/catalog/domain/barcode.ts:95:7
     if (r.isErr) return err(r.error);
     ean = r.value;
   }
-  if (input.upc !== undefined) {
+  if (false) {
     const r = Upc.create(input.upc);
     if (r.isErr) return err(r.error);
killedBy: validateBarcodes validates a present UPC and model number, surfacing the parsed values
statusReason: expected undefined to be '036000291452' // Object.is equality

[Killed] ConditionalExpression
src/catalog/domain/barcode.ts:95:7
     if (r.isErr) return err(r.error);
     ean = r.value;
   }
-  if (input.upc !== undefined) {
+  if (true) {
     const r = Upc.create(input.upc);
     if (r.isErr) return err(r.error);
killedBy: validateBarcodes validates only the present identifiers
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/catalog/domain/barcode.ts:97:9
   }
   if (input.upc !== undefined) {
     const r = Upc.create(input.upc);
-    if (r.isErr) return err(r.error);
+    if (true) return err(r.error);
     upc = r.value;
   }
killedBy: validateBarcodes validates a present UPC and model number, surfacing the parsed values
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/catalog/domain/barcode.ts:97:9
   }
   if (input.upc !== undefined) {
     const r = Upc.create(input.upc);
-    if (r.isErr) return err(r.error);
+    if (false) return err(r.error);
     upc = r.value;
   }
killedBy: validateBarcodes rejects a malformed UPC even when the EAN is valid
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/catalog/domain/barcode.ts:100:7
     if (r.isErr) return err(r.error);
     upc = r.value;
   }
-  if (input.modelNumber !== undefined) {
+  if (false) {
     const r = ModelNumber.create(input.modelNumber);
     if (r.isErr) return err(r.error);
killedBy: PuzzleDefinition.submit flattens validated barcodes into state columns
statusReason: expected undefined to be 'RV-1' // Object.is equality

[Killed] ConditionalExpression
src/catalog/domain/barcode.ts:100:7
     if (r.isErr) return err(r.error);
     upc = r.value;
   }
-  if (input.modelNumber !== undefined) {
+  if (true) {
     const r = ModelNumber.create(input.modelNumber);
     if (r.isErr) return err(r.error);
killedBy: validateBarcodes validates only the present identifiers
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] ConditionalExpression
src/catalog/domain/barcode.ts:102:9
   }
   if (input.modelNumber !== undefined) {
     const r = ModelNumber.create(input.modelNumber);
-    if (r.isErr) return err(r.error);
+    if (true) return err(r.error);
     modelNumber = r.value;
   }
killedBy: validateBarcodes validates a present UPC and model number, surfacing the parsed values
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/catalog/domain/barcode.ts:102:9
   }
   if (input.modelNumber !== undefined) {
     const r = ModelNumber.create(input.modelNumber);
-    if (r.isErr) return err(r.error);
+    if (false) return err(r.error);
     modelNumber = r.value;
   }
killedBy: validateBarcodes rejects a blank model number even when other identifiers are valid
statusReason: expected false to be true // Object.is equality
