[Killed] ArrowFunction
src/catalog/domain/catalog-category.ts:48:24
 }
 
 // Every supported locale must be non-blank — a half-translated category is invalid.
-const isNameComplete = (name: LocalizedText): boolean =>
-  name.en.trim().length > 0 && name.nl.trim().length > 0;
+const isNameComplete = () => undefined;
 
 export class CatalogCategory {
killedBy: CatalogCategory.create starts active and records CatalogCategoryCreated
statusReason: setup failed: A catalog category requires a non-empty name in each locale

[Killed] MethodExpression
src/catalog/domain/catalog-category.ts:49:3
 
 // Every supported locale must be non-blank — a half-translated category is invalid.
 const isNameComplete = (name: LocalizedText): boolean =>
-  name.en.trim().length > 0 && name.nl.trim().length > 0;
+  name.en.length > 0 && name.nl.trim().length > 0;
 
 export class CatalogCategory {
killedBy: CatalogCategory.create rejects an incomplete name (blank en)
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/catalog/domain/catalog-category.ts:49:32
 
 // Every supported locale must be non-blank — a half-translated category is invalid.
 const isNameComplete = (name: LocalizedText): boolean =>
-  name.en.trim().length > 0 && name.nl.trim().length > 0;
+  name.en.trim().length > 0 && name.nl.trim().length >= 0;
 
 export class CatalogCategory {
killedBy: CatalogCategory.create rejects an incomplete name (blank nl)
statusReason: expected false to be true // Object.is equality

[Killed] ArrayDeclaration
src/catalog/domain/catalog-category.ts:52:35
   name.en.trim().length > 0 && name.nl.trim().length > 0;
 
 export class CatalogCategory {
-  private events: DomainEvent[] = [];
+  private events: DomainEvent[] = ["Stryker was here"];
 
   private constructor(private state: CatalogCategoryState) {}
killedBy: CatalogCategory.create starts active and records CatalogCategoryCreated
statusReason: expected [ undefined, 'CatalogCategoryCreated' ] to deeply equal [ 'CatalogCategoryCreated' ]

[Killed] BlockStatement
src/catalog/domain/catalog-category.ts:56:31
 
   private constructor(private state: CatalogCategoryState) {}
 
-  get id(): CatalogCategoryId {
-    return this.state.id;
-  }
+  get id(): CatalogCategoryId {}
 
   get isActive(): boolean {
killedBy: Catalog category use cases creates a category and publishes CatalogCategoryCreated
statusReason: expected undefined to be 'cc-1' // Object.is equality

[Killed] BlockStatement
src/catalog/domain/catalog-category.ts:60:27
     return this.state.id;
   }
 
-  get isActive(): boolean {
-    return this.state.isActive;
-  }
+  get isActive(): boolean {}
 
   get sortOrder(): number {
killedBy: CatalogCategory.create starts active and records CatalogCategoryCreated
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/catalog/domain/catalog-category.ts:64:27
     return this.state.isActive;
   }
 
-  get sortOrder(): number {
-    return this.state.sortOrder;
-  }
+  get sortOrder(): number {}
 
   // Create a new taxonomy node. Starts active.
killedBy: CatalogCategory.create starts active and records CatalogCategoryCreated
statusReason: expected undefined to be +0 // Object.is equality

[Killed] BlockStatement
src/catalog/domain/catalog-category.ts:71:44
   // Create a new taxonomy node. Starts active.
   static create(
     props: CreateCatalogCategoryProps,
-  ): Result<CatalogCategory, CatalogError> {
-    if (!isNameComplete(props.name))
-      return err(CatalogError.emptyCategoryName());
-
-    const state: CatalogCategoryState = {
-      id: props.id,
-      name: props.name,
-      description: props.description,
-      color: props.color,
-      isActive: true,
-      sortOrder: props.sortOrder,
-      createdAt: props.now,
-      updatedAt: props.now,
-    };
-    const category = new CatalogCategory(state);
-    category.record(new CatalogCategoryCreated(state.id, props.now));
-    return ok(category);
-  }
+  ): Result<CatalogCategory, CatalogError> {}
 
   // Patch presentation fields; a replacement name must still be complete in every locale.
killedBy: CatalogCategory.create starts active and records CatalogCategoryCreated
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] ConditionalExpression
src/catalog/domain/catalog-category.ts:72:9
   static create(
     props: CreateCatalogCategoryProps,
   ): Result<CatalogCategory, CatalogError> {
-    if (!isNameComplete(props.name))
+    if (true)
       return err(CatalogError.emptyCategoryName());
 
killedBy: CatalogCategory.create starts active and records CatalogCategoryCreated
statusReason: setup failed: A catalog category requires a non-empty name in each locale

[Killed] BooleanLiteral
src/catalog/domain/catalog-category.ts:72:9
   static create(
     props: CreateCatalogCategoryProps,
   ): Result<CatalogCategory, CatalogError> {
-    if (!isNameComplete(props.name))
+    if (isNameComplete(props.name))
       return err(CatalogError.emptyCategoryName());
 
killedBy: CatalogCategory.create starts active and records CatalogCategoryCreated
statusReason: setup failed: A catalog category requires a non-empty name in each locale

[Killed] BooleanLiteral
src/catalog/domain/catalog-category.ts:80:17
       name: props.name,
       description: props.description,
       color: props.color,
-      isActive: true,
+      isActive: false,
       sortOrder: props.sortOrder,
       createdAt: props.now,
killedBy: CatalogCategory.create starts active and records CatalogCategoryCreated
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/catalog/domain/catalog-category.ts:94:33
   update(
     changes: CatalogCategoryChanges,
     now: Date,
-  ): Result<void, CatalogError> {
-    if (changes.name !== undefined && !isNameComplete(changes.name)) {
-      return err(CatalogError.emptyCategoryName());
-    }
-    this.state = {
-      ...this.state,
-      name: changes.name ?? this.state.name,
-      description: changes.description ?? this.state.description,
-      color: changes.color ?? this.state.color,
-      updatedAt: now,
-    };
-    this.record(new CatalogCategoryUpdated(this.id, now));
-    return ok(undefined);
-  }
+  ): Result<void, CatalogError> {}
 
   // Soft-deactivate: the node is hidden but never deleted (preserves references). Idempotent.
killedBy: update patches color and localized text, recording CatalogCategoryUpdated
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] ConditionalExpression
src/catalog/domain/catalog-category.ts:95:9
     changes: CatalogCategoryChanges,
     now: Date,
   ): Result<void, CatalogError> {
-    if (changes.name !== undefined && !isNameComplete(changes.name)) {
+    if (false) {
       return err(CatalogError.emptyCategoryName());
     }
killedBy: update rejects a replacement name that is incomplete
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/catalog/domain/catalog-category.ts:95:9
     changes: CatalogCategoryChanges,
     now: Date,
   ): Result<void, CatalogError> {
-    if (changes.name !== undefined && !isNameComplete(changes.name)) {
+    if (changes.name !== undefined || !isNameComplete(changes.name)) {
       return err(CatalogError.emptyCategoryName());
     }
killedBy: update patches color and localized text, recording CatalogCategoryUpdated
statusReason: Cannot read properties of undefined (reading 'en')

[Killed] LogicalOperator
src/catalog/domain/catalog-category.ts:100:13
     }
     this.state = {
       ...this.state,
-      name: changes.name ?? this.state.name,
+      name: changes.name && this.state.name,
       description: changes.description ?? this.state.description,
       color: changes.color ?? this.state.color,
killedBy: update applies a complete replacement name and a new description
statusReason: expected { Object (en, nl) } to deeply equal { en: 'Mountains', nl: 'Bergen' }

[Killed] LogicalOperator
src/catalog/domain/catalog-category.ts:101:20
     this.state = {
       ...this.state,
       name: changes.name ?? this.state.name,
-      description: changes.description ?? this.state.description,
+      description: changes.description && this.state.description,
       color: changes.color ?? this.state.color,
       updatedAt: now,
killedBy: update applies a complete replacement name and a new description
statusReason: expected undefined to deeply equal { en: 'Peaks', nl: 'Toppen' }

[Killed] LogicalOperator
src/catalog/domain/catalog-category.ts:102:14
       ...this.state,
       name: changes.name ?? this.state.name,
       description: changes.description ?? this.state.description,
-      color: changes.color ?? this.state.color,
+      color: changes.color && this.state.color,
       updatedAt: now,
     };
killedBy: update patches color and localized text, recording CatalogCategoryUpdated
statusReason: expected undefined to be '#ff0000' // Object.is equality

[Killed] BlockStatement
src/catalog/domain/catalog-category.ts:110:31
   }
 
   // Soft-deactivate: the node is hidden but never deleted (preserves references). Idempotent.
-  deactivate(now: Date): void {
-    this.setActive(false, now);
-  }
+  deactivate(now: Date): void {}
 
   activate(now: Date): void {
killedBy: activate / deactivate (soft, idempotent) deactivates softly, emitting CatalogCategoryActiveChanged(false)
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/catalog/domain/catalog-category.ts:111:20
 
   // Soft-deactivate: the node is hidden but never deleted (preserves references). Idempotent.
   deactivate(now: Date): void {
-    this.setActive(false, now);
+    this.setActive(true, now);
   }
 
killedBy: activate / deactivate (soft, idempotent) deactivates softly, emitting CatalogCategoryActiveChanged(false)
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/catalog/domain/catalog-category.ts:114:29
     this.setActive(false, now);
   }
 
-  activate(now: Date): void {
-    this.setActive(true, now);
-  }
+  activate(now: Date): void {}
 
   // Move the node to a new stable position in the taxonomy ordering. Idempotent.
killedBy: activate / deactivate (soft, idempotent) can be reactivated
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/catalog/domain/catalog-category.ts:115:20
   }
 
   activate(now: Date): void {
-    this.setActive(true, now);
+    this.setActive(false, now);
   }
 
killedBy: activate / deactivate (soft, idempotent) can be reactivated
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/catalog/domain/catalog-category.ts:119:47
   }
 
   // Move the node to a new stable position in the taxonomy ordering. Idempotent.
-  reorder(sortOrder: number, now: Date): void {
-    if (this.state.sortOrder === sortOrder) return;
-    this.state = { ...this.state, sortOrder, updatedAt: now };
-    this.record(new CatalogCategoryReordered(this.id, sortOrder, now));
-  }
+  reorder(sortOrder: number, now: Date): void {}
 
   // Drain recorded events for the publisher; clears the buffer so a save can't double-emit.
killedBy: reorder (stable, idempotent) moves to a new position, emitting CatalogCategoryReordered
statusReason: expected 1 to be 5 // Object.is equality

[Killed] EqualityOperator
src/catalog/domain/catalog-category.ts:120:9
 
   // Move the node to a new stable position in the taxonomy ordering. Idempotent.
   reorder(sortOrder: number, now: Date): void {
-    if (this.state.sortOrder === sortOrder) return;
+    if (this.state.sortOrder !== sortOrder) return;
     this.state = { ...this.state, sortOrder, updatedAt: now };
     this.record(new CatalogCategoryReordered(this.id, sortOrder, now));
killedBy: reorder (stable, idempotent) moves to a new position, emitting CatalogCategoryReordered
statusReason: expected 1 to be 5 // Object.is equality

[Killed] ConditionalExpression
src/catalog/domain/catalog-category.ts:120:9
 
   // Move the node to a new stable position in the taxonomy ordering. Idempotent.
   reorder(sortOrder: number, now: Date): void {
-    if (this.state.sortOrder === sortOrder) return;
+    if (true) return;
     this.state = { ...this.state, sortOrder, updatedAt: now };
     this.record(new CatalogCategoryReordered(this.id, sortOrder, now));
killedBy: reorder (stable, idempotent) moves to a new position, emitting CatalogCategoryReordered
statusReason: expected 1 to be 5 // Object.is equality

[Killed] BlockStatement
src/catalog/domain/catalog-category.ts:133:66
   }
 
   // Map to/from persistence without the aggregate knowing about any storage technology.
-  static rehydrate(state: CatalogCategoryState): CatalogCategory {
-    return new CatalogCategory(state);
-  }
+  static rehydrate(state: CatalogCategoryState): CatalogCategory {}
 
   toState(): CatalogCategoryState {
killedBy: rehydrate / toState round-trip rehydrates without re-recording events
statusReason: Cannot read properties of undefined (reading 'pullEvents')

[Killed] BlockStatement
src/catalog/domain/catalog-category.ts:137:35
     return new CatalogCategory(state);
   }
 
-  toState(): CatalogCategoryState {
-    return this.state;
-  }
+  toState(): CatalogCategoryState {}
 
   // --- internals ---
killedBy: update patches color and localized text, recording CatalogCategoryUpdated
statusReason: Cannot read properties of undefined (reading 'color')

[Killed] BlockStatement
src/catalog/domain/catalog-category.ts:143:57
 
   // --- internals ---
 
-  private setActive(isActive: boolean, now: Date): void {
-    if (this.state.isActive === isActive) return;
-    this.state = { ...this.state, isActive, updatedAt: now };
-    this.record(new CatalogCategoryActiveChanged(this.id, isActive, now));
-  }
+  private setActive(isActive: boolean, now: Date): void {}
 
   private record(event: DomainEvent): void {
killedBy: activate / deactivate (soft, idempotent) deactivates softly, emitting CatalogCategoryActiveChanged(false)
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/catalog/domain/catalog-category.ts:144:9
   // --- internals ---
 
   private setActive(isActive: boolean, now: Date): void {
-    if (this.state.isActive === isActive) return;
+    if (this.state.isActive !== isActive) return;
     this.state = { ...this.state, isActive, updatedAt: now };
     this.record(new CatalogCategoryActiveChanged(this.id, isActive, now));
killedBy: activate / deactivate (soft, idempotent) deactivates softly, emitting CatalogCategoryActiveChanged(false)
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/catalog/domain/catalog-category.ts:144:9
   // --- internals ---
 
   private setActive(isActive: boolean, now: Date): void {
-    if (this.state.isActive === isActive) return;
+    if (true) return;
     this.state = { ...this.state, isActive, updatedAt: now };
     this.record(new CatalogCategoryActiveChanged(this.id, isActive, now));
killedBy: activate / deactivate (soft, idempotent) deactivates softly, emitting CatalogCategoryActiveChanged(false)
statusReason: expected true to be false // Object.is equality
