[Killed] Regex
src/catalog/domain/clean-puzzle-title.ts:6:3
 // Matches piece-count phrases (with optional thousands separators):
 //   "1000 pieces", "1.000 stukjes", "500 pcs", "2000 Teile", etc.
 const PIECE_PHRASE_RE =
-  /(\d[\d.,\s]{0,7}\d|\d+)\s*(?:pieces?|pcs|stukjes|stukken|stuks|teile|piezas|pi[eè]ces)\b/gi;
+  /(\d[\d.,\s]{0,7}\D|\d+)\s*(?:pieces?|pcs|stukjes|stukken|stuks|teile|piezas|pi[eè]ces)\b/gi;
 
 // Generic puzzle/jigsaw noise tokens — whole-word, case-insensitive.
killedBy: cleanPuzzleTitle does NOT strip a number that ends in a separator before the unit (L6 trailing \d)
statusReason: expected 'Vista' to be 'Vista 1. pieces' // Object.is equality

[Killed] Regex
src/catalog/domain/clean-puzzle-title.ts:6:3
 // Matches piece-count phrases (with optional thousands separators):
 //   "1000 pieces", "1.000 stukjes", "500 pcs", "2000 Teile", etc.
 const PIECE_PHRASE_RE =
-  /(\d[\d.,\s]{0,7}\d|\d+)\s*(?:pieces?|pcs|stukjes|stukken|stuks|teile|piezas|pi[eè]ces)\b/gi;
+  /(\d[\d.,\s]\d|\d+)\s*(?:pieces?|pcs|stukjes|stukken|stuks|teile|piezas|pi[eè]ces)\b/gi;
 
 // Generic puzzle/jigsaw noise tokens — whole-word, case-insensitive.
killedBy: cleanPuzzleTitle strips thousands-separator piece counts
statusReason: expected 'Beautiful Landscape 1.' to be 'Beautiful Landscape' // Object.is equality

[Killed] Regex
src/catalog/domain/clean-puzzle-title.ts:15:3
 // the segment to be dropped. Checked word-by-word (not as a full segment regex) to handle
 // multi-word combos like "Recycled cardboard" or "Gerecycled karton".
 const DESCRIPTOR_WORD_RE =
-  /^(?:karton|cardboard|recycled|gerecycled|hout|houten|wooden|volwassenen|adults|kinderen|children|\d+\+?\s*(?:jaar|years|yr))$/i;
+  /^(?:karton|cardboard|recycled|gerecycled|hout|houten|wooden|volwassenen|adults|kinderen|children|\d\+?\s*(?:jaar|years|yr))$/i;
 
 // Separator patterns used to split the raw title into segments.
killedBy: cleanPuzzleTitle drops a multi-digit age descriptor (`\d+` quantifier)
statusReason: expected 'Castle 10+jaar' to be 'Castle' // Object.is equality

[Killed] Regex
src/catalog/domain/clean-puzzle-title.ts:15:3
 // the segment to be dropped. Checked word-by-word (not as a full segment regex) to handle
 // multi-word combos like "Recycled cardboard" or "Gerecycled karton".
 const DESCRIPTOR_WORD_RE =
-  /^(?:karton|cardboard|recycled|gerecycled|hout|houten|wooden|volwassenen|adults|kinderen|children|\d+\+?\s*(?:jaar|years|yr))$/i;
+  /(?:karton|cardboard|recycled|gerecycled|hout|houten|wooden|volwassenen|adults|kinderen|children|\d+\+?\s*(?:jaar|years|yr))$/i;
 
 // Separator patterns used to split the raw title into segments.
killedBy: cleanPuzzleTitle does NOT drop a word that merely ends with a descriptor (L15 ^ anchor)
statusReason: expected 'Title' to be 'Title Suncardboard' // Object.is equality

[Killed] Regex
src/catalog/domain/clean-puzzle-title.ts:18:26
   /^(?:karton|cardboard|recycled|gerecycled|hout|houten|wooden|volwassenen|adults|kinderen|children|\d+\+?\s*(?:jaar|years|yr))$/i;
 
 // Separator patterns used to split the raw title into segments.
-const SEGMENT_SPLIT_RE = / [-–—] | [|] | \/ /g;
+const SEGMENT_SPLIT_RE = / [^-–—] | [|] | \/ /g;
 
 /**
killedBy: cleanPuzzleTitle strips piece count and noise segments (Dutch)
statusReason: expected 'Jan van Haasteren Jungletocht - - Ger…' to be 'Jan van Haasteren Jungletocht' // Object.is equality

[Killed] BlockStatement
src/catalog/domain/clean-puzzle-title.ts:24:52
  * Returns true if every word in the segment is a material/audience descriptor.
  * An empty string returns false (handled separately).
  */
-const isAllDescriptors = (seg: string): boolean => {
-  // `seg` is always a non-empty, single-space-collapsed segment (callers filter empties first),
-  // so a literal-space split yields the words directly without needing a regex or `filter(Boolean)`.
-  const words = seg.split(" ");
-  return words.every((w) => DESCRIPTOR_WORD_RE.test(w));
-};
+const isAllDescriptors = (seg: string): boolean => {};
 
 /**
killedBy: cleanPuzzleTitle strips piece count and noise segments (Dutch)
statusReason: expected 'Jan van Haasteren Jungletocht Gerecyc…' to be 'Jan van Haasteren Jungletocht' // Object.is equality

[Killed] MethodExpression
src/catalog/domain/clean-puzzle-title.ts:28:10
   // `seg` is always a non-empty, single-space-collapsed segment (callers filter empties first),
   // so a literal-space split yields the words directly without needing a regex or `filter(Boolean)`.
   const words = seg.split(" ");
-  return words.every((w) => DESCRIPTOR_WORD_RE.test(w));
+  return words.some(w => DESCRIPTOR_WORD_RE.test(w));
 };
 
killedBy: cleanPuzzleTitle keeps a mixed segment where only some words are descriptors (L26 every vs some)
statusReason: expected 'Sunset' to be 'Sunset Forest Recycled' // Object.is equality

[Killed] ArrowFunction
src/catalog/domain/clean-puzzle-title.ts:28:22
   // `seg` is always a non-empty, single-space-collapsed segment (callers filter empties first),
   // so a literal-space split yields the words directly without needing a regex or `filter(Boolean)`.
   const words = seg.split(" ");
-  return words.every((w) => DESCRIPTOR_WORD_RE.test(w));
+  return words.every(() => undefined);
 };
 
killedBy: cleanPuzzleTitle strips piece count and noise segments (Dutch)
statusReason: expected 'Jan van Haasteren Jungletocht Gerecyc…' to be 'Jan van Haasteren Jungletocht' // Object.is equality

[Killed] BlockStatement
src/catalog/domain/clean-puzzle-title.ts:40:58
  * 5. Joining surviving segments with a space.
  * 6. Falling back to the trimmed raw input if everything was dropped.
  */
-export const cleanPuzzleTitle = (raw: string): string => {
-  const trimmed = raw.trim();
-
-  const segments = trimmed
-    .split(SEGMENT_SPLIT_RE)
-    .map((seg) => {
-      // Remove piece-count phrases first (number + unit together).
-      let cleaned = seg.replace(PIECE_PHRASE_RE, "");
-      // Remove noise tokens.
-      cleaned = cleaned.replace(NOISE_TOKEN_RE, "");
-      // Collapse multiple spaces and trim.
-      return cleaned.replace(/\s+/g, " ").trim();
-    })
-    .filter((seg) => {
-      if (!seg) return false;
-      // Drop if all remaining words are material or audience descriptors.
-      return !isAllDescriptors(seg);
-    });
-
-  if (segments.length === 0) return trimmed;
-
-  return segments.join(" ");
-};
+export const cleanPuzzleTitle = (raw: string): string => {};
 
killedBy: cleanPuzzleTitle strips piece count and noise segments (Dutch)
statusReason: expected undefined to be 'Jan van Haasteren Jungletocht' // Object.is equality

[Killed] MethodExpression
src/catalog/domain/clean-puzzle-title.ts:41:19
  * 6. Falling back to the trimmed raw input if everything was dropped.
  */
 export const cleanPuzzleTitle = (raw: string): string => {
-  const trimmed = raw.trim();
+  const trimmed = raw;
 
   const segments = trimmed
killedBy: cleanPuzzleTitle returns trimmed input when result would be empty
statusReason: expected '  puzzel  ' to be 'puzzel' // Object.is equality

[Killed] MethodExpression
src/catalog/domain/clean-puzzle-title.ts:43:20
 export const cleanPuzzleTitle = (raw: string): string => {
   const trimmed = raw.trim();
 
-  const segments = trimmed
-    .split(SEGMENT_SPLIT_RE)
-    .map((seg) => {
-      // Remove piece-count phrases first (number + unit together).
-      let cleaned = seg.replace(PIECE_PHRASE_RE, "");
-      // Remove noise tokens.
-      cleaned = cleaned.replace(NOISE_TOKEN_RE, "");
-      // Collapse multiple spaces and trim.
-      return cleaned.replace(/\s+/g, " ").trim();
-    })
-    .filter((seg) => {
-      if (!seg) return false;
-      // Drop if all remaining words are material or audience descriptors.
-      return !isAllDescriptors(seg);
-    });
+  const segments = trimmed.split(SEGMENT_SPLIT_RE).map(seg => {
+  // Remove piece-count phrases first (number + unit together).
+  let cleaned = seg.replace(PIECE_PHRASE_RE, "");
+  // Remove noise tokens.
+  cleaned = cleaned.replace(NOISE_TOKEN_RE, "");
+  // Collapse multiple spaces and trim.
+  return cleaned.replace(/\s+/g, " ").trim();
+});
 
   if (segments.length === 0) return trimmed;
killedBy: cleanPuzzleTitle strips piece count and noise segments (Dutch)
statusReason: expected 'Jan van Haasteren Jungletocht  Gerecy…' to be 'Jan van Haasteren Jungletocht' // Object.is equality

[Killed] BlockStatement
src/catalog/domain/clean-puzzle-title.ts:45:19
 
   const segments = trimmed
     .split(SEGMENT_SPLIT_RE)
-    .map((seg) => {
-      // Remove piece-count phrases first (number + unit together).
-      let cleaned = seg.replace(PIECE_PHRASE_RE, "");
-      // Remove noise tokens.
-      cleaned = cleaned.replace(NOISE_TOKEN_RE, "");
-      // Collapse multiple spaces and trim.
-      return cleaned.replace(/\s+/g, " ").trim();
-    })
+    .map((seg) => {})
     .filter((seg) => {
       if (!seg) return false;
killedBy: cleanPuzzleTitle strips piece count and noise segments (Dutch)
statusReason: expected 'Jan van Haasteren Jungletocht - 1000 …' to be 'Jan van Haasteren Jungletocht' // Object.is equality

[Killed] MethodExpression
src/catalog/domain/clean-puzzle-title.ts:51:14
       // Remove noise tokens.
       cleaned = cleaned.replace(NOISE_TOKEN_RE, "");
       // Collapse multiple spaces and trim.
-      return cleaned.replace(/\s+/g, " ").trim();
+      return cleaned.replace(/\s+/g, " ");
     })
     .filter((seg) => {
killedBy: cleanPuzzleTitle strips piece count and noise segments (Dutch)
statusReason: expected 'Jan van Haasteren Jungletocht  ' to be 'Jan van Haasteren Jungletocht' // Object.is equality

[Killed] Regex
src/catalog/domain/clean-puzzle-title.ts:51:30
       // Remove noise tokens.
       cleaned = cleaned.replace(NOISE_TOKEN_RE, "");
       // Collapse multiple spaces and trim.
-      return cleaned.replace(/\s+/g, " ").trim();
+      return cleaned.replace(/\s/g, " ").trim();
     })
     .filter((seg) => {
killedBy: cleanPuzzleTitle collapses internal whitespace left by mid-segment noise removal (L53 \s+ vs \s)
statusReason: expected 'City  Skyline' to be 'City Skyline' // Object.is equality

[Killed] BlockStatement
src/catalog/domain/clean-puzzle-title.ts:53:22
       // Collapse multiple spaces and trim.
       return cleaned.replace(/\s+/g, " ").trim();
     })
-    .filter((seg) => {
-      if (!seg) return false;
-      // Drop if all remaining words are material or audience descriptors.
-      return !isAllDescriptors(seg);
-    });
+    .filter((seg) => {});
 
   if (segments.length === 0) return trimmed;
killedBy: cleanPuzzleTitle strips piece count and noise segments (Dutch)
statusReason: expected 'Jan van Haasteren Jungletocht - 1000 …' to be 'Jan van Haasteren Jungletocht' // Object.is equality

[Killed] BooleanLiteral
src/catalog/domain/clean-puzzle-title.ts:54:11
       return cleaned.replace(/\s+/g, " ").trim();
     })
     .filter((seg) => {
-      if (!seg) return false;
+      if (seg) return false;
       // Drop if all remaining words are material or audience descriptors.
       return !isAllDescriptors(seg);
killedBy: cleanPuzzleTitle strips piece count and noise segments (Dutch)
statusReason: expected '' to be 'Jan van Haasteren Jungletocht' // Object.is equality

[Killed] ConditionalExpression
src/catalog/domain/clean-puzzle-title.ts:54:11
       return cleaned.replace(/\s+/g, " ").trim();
     })
     .filter((seg) => {
-      if (!seg) return false;
+      if (true) return false;
       // Drop if all remaining words are material or audience descriptors.
       return !isAllDescriptors(seg);
killedBy: cleanPuzzleTitle strips piece count and noise segments (Dutch)
statusReason: expected 'Jan van Haasteren Jungletocht - 1000 …' to be 'Jan van Haasteren Jungletocht' // Object.is equality

[Killed] BooleanLiteral
src/catalog/domain/clean-puzzle-title.ts:56:14
     .filter((seg) => {
       if (!seg) return false;
       // Drop if all remaining words are material or audience descriptors.
-      return !isAllDescriptors(seg);
+      return isAllDescriptors(seg);
     });
 
killedBy: cleanPuzzleTitle strips piece count and noise segments (Dutch)
statusReason: expected 'Gerecycled karton' to be 'Jan van Haasteren Jungletocht' // Object.is equality

[Killed] ConditionalExpression
src/catalog/domain/clean-puzzle-title.ts:59:7
       return !isAllDescriptors(seg);
     });
 
-  if (segments.length === 0) return trimmed;
+  if (true) return trimmed;
 
   return segments.join(" ");
killedBy: cleanPuzzleTitle strips piece count and noise segments (Dutch)
statusReason: expected 'Jan van Haasteren Jungletocht - 1000 …' to be 'Jan van Haasteren Jungletocht' // Object.is equality

[Killed] EqualityOperator
src/catalog/domain/clean-puzzle-title.ts:59:7
       return !isAllDescriptors(seg);
     });
 
-  if (segments.length === 0) return trimmed;
+  if (segments.length !== 0) return trimmed;
 
   return segments.join(" ");
killedBy: cleanPuzzleTitle strips piece count and noise segments (Dutch)
statusReason: expected 'Jan van Haasteren Jungletocht - 1000 …' to be 'Jan van Haasteren Jungletocht' // Object.is equality
