[Killed] StringLiteral
src/catalog/domain/events.ts:99:19
 }
 
 export class ChangeProposalApproved implements DomainEvent {
-  readonly name = "ChangeProposalApproved";
+  readonly name = "";
   constructor(
     readonly changeProposalId: ChangeProposalId,
killedBy: decision lifecycle approve moves pending → approved, stamps decidedAt, records ChangeProposalApproved
statusReason: expected [ '' ] to deeply equal [ 'ChangeProposalApproved' ]

[Killed] StringLiteral
src/catalog/domain/events.ts:128:19
 }
 
 export class CatalogCategoryUpdated implements DomainEvent {
-  readonly name = "CatalogCategoryUpdated";
+  readonly name = "";
   constructor(
     readonly catalogCategoryId: CatalogCategoryId,
killedBy: update patches color and localized text, recording CatalogCategoryUpdated
statusReason: expected [ '' ] to deeply equal [ 'CatalogCategoryUpdated' ]

[Killed] StringLiteral
src/catalog/domain/events.ts:137:19
 
 // Soft-deactivation toggle: the taxonomy is never deleted, only made (in)active.
 export class CatalogCategoryActiveChanged implements DomainEvent {
-  readonly name = "CatalogCategoryActiveChanged";
+  readonly name = "";
   constructor(
     readonly catalogCategoryId: CatalogCategoryId,
killedBy: activate / deactivate (soft, idempotent) deactivates softly, emitting CatalogCategoryActiveChanged(false)
statusReason: expected [ '' ] to deeply equal [ 'CatalogCategoryActiveChanged' ]
