[Killed] ArrowFunction
src/catalog/domain/puzzle-change-proposal.ts:47:22
   readonly decidedAt?: Date;
 }
 
-const hasAnyChange = (changes: PuzzleDefinitionChanges): boolean =>
-  Object.values(changes).some((value) => value !== undefined);
+const hasAnyChange = () => undefined;
 
 // The same invariants PuzzleDefinition.update() enforces (non-blank title, positive integer
killedBy: PuzzleChangeProposal.file starts pending and records ChangeProposalFiled with definition + proposer
statusReason: setup failed: A change proposal requires at least one changed field

[Killed] ConditionalExpression
src/catalog/domain/puzzle-change-proposal.ts:48:42
 }
 
 const hasAnyChange = (changes: PuzzleDefinitionChanges): boolean =>
-  Object.values(changes).some((value) => value !== undefined);
+  Object.values(changes).some((value) => true);
 
 // The same invariants PuzzleDefinition.update() enforces (non-blank title, positive integer
killedBy: hasAnyChange with only explicitly-undefined members rejects filing a diff whose only keys are explicitly undefined
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/catalog/domain/puzzle-change-proposal.ts:48:3
 }
 
 const hasAnyChange = (changes: PuzzleDefinitionChanges): boolean =>
-  Object.values(changes).some((value) => value !== undefined);
+  Object.values(changes).every(value => value !== undefined);
 
 // The same invariants PuzzleDefinition.update() enforces (non-blank title, positive integer
killedBy: makeFileChangeProposal propagates aggregate validation failures without saving
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/catalog/domain/puzzle-change-proposal.ts:55:34
 // sit in the review queue and then fail at approval.
 const validateChanges = (
   changes: PuzzleDefinitionChanges,
-): Result<void, CatalogError> => {
-  if (!hasAnyChange(changes)) return err(CatalogError.emptyProposal());
-  if (changes.title !== undefined && changes.title.trim().length === 0) {
-    return err(CatalogError.emptyTitle());
-  }
-  if (changes.pieceCount !== undefined) {
-    const validated = PieceCount.create(changes.pieceCount);
-    if (validated.isErr) return err(validated.error);
-  }
-  if (changes.barcodes !== undefined) {
-    const validated = validateBarcodes(changes.barcodes);
-    if (validated.isErr) return err(validated.error);
-  }
-  return ok(undefined);
-};
+): Result<void, CatalogError> => {};
 
 export class PuzzleChangeProposal {
killedBy: PuzzleChangeProposal.file starts pending and records ChangeProposalFiled with definition + proposer
statusReason: Cannot read properties of undefined (reading 'isErr')

[Killed] ConditionalExpression
src/catalog/domain/puzzle-change-proposal.ts:56:7
 const validateChanges = (
   changes: PuzzleDefinitionChanges,
 ): Result<void, CatalogError> => {
-  if (!hasAnyChange(changes)) return err(CatalogError.emptyProposal());
+  if (true) return err(CatalogError.emptyProposal());
   if (changes.title !== undefined && changes.title.trim().length === 0) {
     return err(CatalogError.emptyTitle());
killedBy: PuzzleChangeProposal.file starts pending and records ChangeProposalFiled with definition + proposer
statusReason: setup failed: A change proposal requires at least one changed field

[Killed] BooleanLiteral
src/catalog/domain/puzzle-change-proposal.ts:56:7
 const validateChanges = (
   changes: PuzzleDefinitionChanges,
 ): Result<void, CatalogError> => {
-  if (!hasAnyChange(changes)) return err(CatalogError.emptyProposal());
+  if (hasAnyChange(changes)) return err(CatalogError.emptyProposal());
   if (changes.title !== undefined && changes.title.trim().length === 0) {
     return err(CatalogError.emptyTitle());
killedBy: makeFileChangeProposal files a pending proposal with a server-derived baseline and publishes ChangeProposalFiled
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/catalog/domain/puzzle-change-proposal.ts:57:7
   changes: PuzzleDefinitionChanges,
 ): Result<void, CatalogError> => {
   if (!hasAnyChange(changes)) return err(CatalogError.emptyProposal());
-  if (changes.title !== undefined && changes.title.trim().length === 0) {
+  if (true) {
     return err(CatalogError.emptyTitle());
   }
killedBy: PuzzleChangeProposal.file starts pending and records ChangeProposalFiled with definition + proposer
statusReason: setup failed: A puzzle definition requires a non-empty title

[Killed] ConditionalExpression
src/catalog/domain/puzzle-change-proposal.ts:57:7
   changes: PuzzleDefinitionChanges,
 ): Result<void, CatalogError> => {
   if (!hasAnyChange(changes)) return err(CatalogError.emptyProposal());
-  if (changes.title !== undefined && changes.title.trim().length === 0) {
+  if (true && changes.title.trim().length === 0) {
     return err(CatalogError.emptyTitle());
   }
killedBy: PuzzleChangeProposal.file runs the definition's own invariants: blank title, bad piece count, bad barcode
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] BlockStatement
src/catalog/domain/puzzle-change-proposal.ts:60:41
   if (changes.title !== undefined && changes.title.trim().length === 0) {
     return err(CatalogError.emptyTitle());
   }
-  if (changes.pieceCount !== undefined) {
-    const validated = PieceCount.create(changes.pieceCount);
-    if (validated.isErr) return err(validated.error);
-  }
+  if (changes.pieceCount !== undefined) {}
   if (changes.barcodes !== undefined) {
     const validated = validateBarcodes(changes.barcodes);
killedBy: PuzzleChangeProposal.file runs the definition's own invariants: blank title, bad piece count, bad barcode
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/catalog/domain/puzzle-change-proposal.ts:60:7
   if (changes.title !== undefined && changes.title.trim().length === 0) {
     return err(CatalogError.emptyTitle());
   }
-  if (changes.pieceCount !== undefined) {
+  if (changes.pieceCount === undefined) {
     const validated = PieceCount.create(changes.pieceCount);
     if (validated.isErr) return err(validated.error);
killedBy: PuzzleChangeProposal.file starts pending and records ChangeProposalFiled with definition + proposer
statusReason: setup failed: Piece count must be a positive integer, got undefined

[Killed] ConditionalExpression
src/catalog/domain/puzzle-change-proposal.ts:62:9
   }
   if (changes.pieceCount !== undefined) {
     const validated = PieceCount.create(changes.pieceCount);
-    if (validated.isErr) return err(validated.error);
+    if (false) return err(validated.error);
   }
   if (changes.barcodes !== undefined) {
killedBy: PuzzleChangeProposal.file runs the definition's own invariants: blank title, bad piece count, bad barcode
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/catalog/domain/puzzle-change-proposal.ts:62:9
   }
   if (changes.pieceCount !== undefined) {
     const validated = PieceCount.create(changes.pieceCount);
-    if (validated.isErr) return err(validated.error);
+    if (true) return err(validated.error);
   }
   if (changes.barcodes !== undefined) {
killedBy: edit replaces changes, baseline and comment in place on a pending proposal
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/catalog/domain/puzzle-change-proposal.ts:64:39
     const validated = PieceCount.create(changes.pieceCount);
     if (validated.isErr) return err(validated.error);
   }
-  if (changes.barcodes !== undefined) {
-    const validated = validateBarcodes(changes.barcodes);
-    if (validated.isErr) return err(validated.error);
-  }
+  if (changes.barcodes !== undefined) {}
   return ok(undefined);
 };
killedBy: PuzzleChangeProposal.file runs the definition's own invariants: blank title, bad piece count, bad barcode
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/catalog/domain/puzzle-change-proposal.ts:64:7
     const validated = PieceCount.create(changes.pieceCount);
     if (validated.isErr) return err(validated.error);
   }
-  if (changes.barcodes !== undefined) {
+  if (false) {
     const validated = validateBarcodes(changes.barcodes);
     if (validated.isErr) return err(validated.error);
killedBy: PuzzleChangeProposal.file runs the definition's own invariants: blank title, bad piece count, bad barcode
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/catalog/domain/puzzle-change-proposal.ts:66:9
   }
   if (changes.barcodes !== undefined) {
     const validated = validateBarcodes(changes.barcodes);
-    if (validated.isErr) return err(validated.error);
+    if (false) return err(validated.error);
   }
   return ok(undefined);
killedBy: PuzzleChangeProposal.file runs the definition's own invariants: blank title, bad piece count, bad barcode
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/catalog/domain/puzzle-change-proposal.ts:66:9
   }
   if (changes.barcodes !== undefined) {
     const validated = validateBarcodes(changes.barcodes);
-    if (validated.isErr) return err(validated.error);
+    if (true) return err(validated.error);
   }
   return ok(undefined);
killedBy: makeFileChangeProposal snapshots the grouped barcode baseline from the definition's flat fields
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/catalog/domain/puzzle-change-proposal.ts:76:30
 
   private constructor(private state: PuzzleChangeProposalState) {}
 
-  get id(): ChangeProposalId {
-    return this.state.id;
-  }
+  get id(): ChangeProposalId {}
 
   get puzzleDefinitionId(): PuzzleDefinitionId {
killedBy: getters expose id, puzzleDefinitionId, proposedBy, status and changes
statusReason: expected undefined to be 'cp1' // Object.is equality

[Killed] BlockStatement
src/catalog/domain/puzzle-change-proposal.ts:80:48
     return this.state.id;
   }
 
-  get puzzleDefinitionId(): PuzzleDefinitionId {
-    return this.state.puzzleDefinitionId;
-  }
+  get puzzleDefinitionId(): PuzzleDefinitionId {}
 
   get proposedBy(): SubmitterId {
killedBy: getters expose id, puzzleDefinitionId, proposedBy, status and changes
statusReason: expected undefined to be 'pd1' // Object.is equality

[Killed] BlockStatement
src/catalog/domain/puzzle-change-proposal.ts:84:33
     return this.state.puzzleDefinitionId;
   }
 
-  get proposedBy(): SubmitterId {
-    return this.state.proposedBy;
-  }
+  get proposedBy(): SubmitterId {}
 
   get status(): ProposalStatus {
killedBy: getters expose id, puzzleDefinitionId, proposedBy, status and changes
statusReason: expected undefined to be 'alice' // Object.is equality

[Killed] BlockStatement
src/catalog/domain/puzzle-change-proposal.ts:88:32
     return this.state.proposedBy;
   }
 
-  get status(): ProposalStatus {
-    return this.state.status;
-  }
+  get status(): ProposalStatus {}
 
   get changes(): PuzzleDefinitionChanges {
killedBy: PuzzleChangeProposal.file starts pending and records ChangeProposalFiled with definition + proposer
statusReason: expected undefined to be 'pending' // Object.is equality

[Killed] BlockStatement
src/catalog/domain/puzzle-change-proposal.ts:92:42
     return this.state.status;
   }
 
-  get changes(): PuzzleDefinitionChanges {
-    return this.state.changes;
-  }
+  get changes(): PuzzleDefinitionChanges {}
 
   // File a new proposal. Validates the diff from its own data only; cross-aggregate rules
killedBy: makeApproveChangeProposal approves the proposal AND applies the patch to the definition, publishing both batches
statusReason: Cannot read properties of undefined (reading 'title')

[Killed] ConditionalExpression
src/catalog/domain/puzzle-change-proposal.ts:103:9
     props: FileChangeProposalProps,
   ): Result<PuzzleChangeProposal, CatalogError> {
     const validated = validateChanges(props.changes);
-    if (validated.isErr) return err(validated.error);
+    if (false) return err(validated.error);
 
     const state: PuzzleChangeProposalState = {
killedBy: PuzzleChangeProposal.file rejects an empty diff
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/catalog/domain/puzzle-change-proposal.ts:103:9
     props: FileChangeProposalProps,
   ): Result<PuzzleChangeProposal, CatalogError> {
     const validated = validateChanges(props.changes);
-    if (validated.isErr) return err(validated.error);
+    if (true) return err(validated.error);
 
     const state: PuzzleChangeProposalState = {
killedBy: PuzzleChangeProposal.file starts pending and records ChangeProposalFiled with definition + proposer
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] ObjectLiteral
src/catalog/domain/puzzle-change-proposal.ts:105:46
     const validated = validateChanges(props.changes);
     if (validated.isErr) return err(validated.error);
 
-    const state: PuzzleChangeProposalState = {
-      id: props.id,
-      puzzleDefinitionId: props.puzzleDefinitionId,
-      proposedBy: props.proposedBy,
-      status: "pending",
-      changes: props.changes,
-      baseline: props.baseline,
-      comment: props.comment,
-      createdAt: props.now,
-      updatedAt: props.now,
-    };
+    const state: PuzzleChangeProposalState = {};
     const proposal = new PuzzleChangeProposal(state);
     proposal.record(
killedBy: PuzzleChangeProposal.file starts pending and records ChangeProposalFiled with definition + proposer
statusReason: expected undefined to be 'pending' // Object.is equality

[Killed] BlockStatement
src/catalog/domain/puzzle-change-proposal.ts:135:33
     baseline: PuzzleDefinitionChanges,
     comment: string | undefined,
     now: Date,
-  ): Result<void, CatalogError> {
-    if (this.state.status !== "pending") {
-      return err(CatalogError.proposalNotPending(this.state.status));
-    }
-    const validated = validateChanges(changes);
-    if (validated.isErr) return err(validated.error);
-
-    this.state = { ...this.state, changes, baseline, comment, updatedAt: now };
-    this.record(
-      new ChangeProposalEdited(
-        this.id,
-        this.state.puzzleDefinitionId,
-        this.state.proposedBy,
-        now,
-      ),
-    );
-    return ok(undefined);
-  }
+  ): Result<void, CatalogError> {}
 
   // Proposer retracts a pending proposal. Terminal; re-filing creates a new proposal.
killedBy: edit replaces changes, baseline and comment in place on a pending proposal
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] BlockStatement
src/catalog/domain/puzzle-change-proposal.ts:136:42
     comment: string | undefined,
     now: Date,
   ): Result<void, CatalogError> {
-    if (this.state.status !== "pending") {
-      return err(CatalogError.proposalNotPending(this.state.status));
-    }
+    if (this.state.status !== "pending") {}
     const validated = validateChanges(changes);
     if (validated.isErr) return err(validated.error);
killedBy: edit cannot edit a decided or withdrawn proposal
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/catalog/domain/puzzle-change-proposal.ts:136:9
     comment: string | undefined,
     now: Date,
   ): Result<void, CatalogError> {
-    if (this.state.status !== "pending") {
+    if (true) {
       return err(CatalogError.proposalNotPending(this.state.status));
     }
killedBy: edit replaces changes, baseline and comment in place on a pending proposal
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/catalog/domain/puzzle-change-proposal.ts:140:9
       return err(CatalogError.proposalNotPending(this.state.status));
     }
     const validated = validateChanges(changes);
-    if (validated.isErr) return err(validated.error);
+    if (true) return err(validated.error);
 
     this.state = { ...this.state, changes, baseline, comment, updatedAt: now };
killedBy: edit replaces changes, baseline and comment in place on a pending proposal
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/catalog/domain/puzzle-change-proposal.ts:140:9
       return err(CatalogError.proposalNotPending(this.state.status));
     }
     const validated = validateChanges(changes);
-    if (validated.isErr) return err(validated.error);
+    if (false) return err(validated.error);
 
     this.state = { ...this.state, changes, baseline, comment, updatedAt: now };
killedBy: edit re-validates the new diff (empty diff rejected)
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/catalog/domain/puzzle-change-proposal.ts:155:51
   }
 
   // Proposer retracts a pending proposal. Terminal; re-filing creates a new proposal.
-  withdraw(now: Date): Result<void, CatalogError> {
-    const moved = this.transition("withdrawn", now);
-    if (moved.isErr) return moved;
-    this.record(
-      new ChangeProposalWithdrawn(
-        this.id,
-        this.state.puzzleDefinitionId,
-        this.state.proposedBy,
-        now,
-      ),
-    );
-    return ok(undefined);
-  }
+  withdraw(now: Date): Result<void, CatalogError> {}
 
   // Admin accepts the proposal. Applying the patch to the definition is the approve use case's
killedBy: edit cannot edit a decided or withdrawn proposal
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/catalog/domain/puzzle-change-proposal.ts:157:9
   // Proposer retracts a pending proposal. Terminal; re-filing creates a new proposal.
   withdraw(now: Date): Result<void, CatalogError> {
     const moved = this.transition("withdrawn", now);
-    if (moved.isErr) return moved;
+    if (true) return moved;
     this.record(
       new ChangeProposalWithdrawn(
killedBy: decision lifecycle withdraw moves pending → withdrawn without decidedAt
statusReason: expected [] to deeply equal [ 'ChangeProposalWithdrawn' ]

[Killed] ConditionalExpression
src/catalog/domain/puzzle-change-proposal.ts:157:9
   // Proposer retracts a pending proposal. Terminal; re-filing creates a new proposal.
   withdraw(now: Date): Result<void, CatalogError> {
     const moved = this.transition("withdrawn", now);
-    if (moved.isErr) return moved;
+    if (false) return moved;
     this.record(
       new ChangeProposalWithdrawn(
killedBy: decision lifecycle withdraw is illegal on an already-decided proposal
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/catalog/domain/puzzle-change-proposal.ts:171:50
 
   // Admin accepts the proposal. Applying the patch to the definition is the approve use case's
   // orchestration; this aggregate only owns its own lifecycle.
-  approve(now: Date): Result<void, CatalogError> {
-    const moved = this.transition("approved", now);
-    if (moved.isErr) return moved;
-    this.state = { ...this.state, decidedAt: now };
-    this.record(
-      new ChangeProposalApproved(
-        this.id,
-        this.state.puzzleDefinitionId,
-        this.state.proposedBy,
-        now,
-      ),
-    );
-    return ok(undefined);
-  }
+  approve(now: Date): Result<void, CatalogError> {}
 
   // Admin declines the proposal, optionally explaining why (surfaced to the proposer).
killedBy: edit cannot edit a decided or withdrawn proposal
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/catalog/domain/puzzle-change-proposal.ts:172:35
   // Admin accepts the proposal. Applying the patch to the definition is the approve use case's
   // orchestration; this aggregate only owns its own lifecycle.
   approve(now: Date): Result<void, CatalogError> {
-    const moved = this.transition("approved", now);
+    const moved = this.transition("", now);
     if (moved.isErr) return moved;
     this.state = { ...this.state, decidedAt: now };
killedBy: edit cannot edit a decided or withdrawn proposal
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/catalog/domain/puzzle-change-proposal.ts:173:9
   // orchestration; this aggregate only owns its own lifecycle.
   approve(now: Date): Result<void, CatalogError> {
     const moved = this.transition("approved", now);
-    if (moved.isErr) return moved;
+    if (true) return moved;
     this.state = { ...this.state, decidedAt: now };
     this.record(
killedBy: decision lifecycle approve moves pending → approved, stamps decidedAt, records ChangeProposalApproved
statusReason: expected undefined to be 2026-07-09T10:00:00.000Z // Object.is equality

[Killed] ConditionalExpression
src/catalog/domain/puzzle-change-proposal.ts:173:9
   // orchestration; this aggregate only owns its own lifecycle.
   approve(now: Date): Result<void, CatalogError> {
     const moved = this.transition("approved", now);
-    if (moved.isErr) return moved;
+    if (false) return moved;
     this.state = { ...this.state, decidedAt: now };
     this.record(
killedBy: decision lifecycle approve is illegal on an already-decided proposal
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/catalog/domain/puzzle-change-proposal.ts:187:77
   }
 
   // Admin declines the proposal, optionally explaining why (surfaced to the proposer).
-  reject(reason: string | undefined, now: Date): Result<void, CatalogError> {
-    const moved = this.transition("rejected", now);
-    if (moved.isErr) return moved;
-    this.state = { ...this.state, rejectionReason: reason, decidedAt: now };
-    this.record(
-      new ChangeProposalRejected(
-        this.id,
-        this.state.puzzleDefinitionId,
-        this.state.proposedBy,
-        reason,
-        now,
-      ),
-    );
-    return ok(undefined);
-  }
+  reject(reason: string | undefined, now: Date): Result<void, CatalogError> {}
 
   // Drain recorded events for the publisher; clears the buffer so a save can't double-emit.
killedBy: decision lifecycle reject stores the reason, stamps decidedAt, records ChangeProposalRejected carrying it
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] ConditionalExpression
src/catalog/domain/puzzle-change-proposal.ts:189:9
   // Admin declines the proposal, optionally explaining why (surfaced to the proposer).
   reject(reason: string | undefined, now: Date): Result<void, CatalogError> {
     const moved = this.transition("rejected", now);
-    if (moved.isErr) return moved;
+    if (true) return moved;
     this.state = { ...this.state, rejectionReason: reason, decidedAt: now };
     this.record(
killedBy: decision lifecycle reject stores the reason, stamps decidedAt, records ChangeProposalRejected carrying it
statusReason: expected undefined to be 'duplicate of an existing fix' // Object.is equality

[Killed] ConditionalExpression
src/catalog/domain/puzzle-change-proposal.ts:189:9
   // Admin declines the proposal, optionally explaining why (surfaced to the proposer).
   reject(reason: string | undefined, now: Date): Result<void, CatalogError> {
     const moved = this.transition("rejected", now);
-    if (moved.isErr) return moved;
+    if (false) return moved;
     this.state = { ...this.state, rejectionReason: reason, decidedAt: now };
     this.record(
killedBy: decision lifecycle reject is illegal on an already-decided proposal
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/catalog/domain/puzzle-change-proposal.ts:190:18
   reject(reason: string | undefined, now: Date): Result<void, CatalogError> {
     const moved = this.transition("rejected", now);
     if (moved.isErr) return moved;
-    this.state = { ...this.state, rejectionReason: reason, decidedAt: now };
+    this.state = {};
     this.record(
       new ChangeProposalRejected(
killedBy: decision lifecycle reject stores the reason, stamps decidedAt, records ChangeProposalRejected carrying it
statusReason: expected undefined to be 'rejected' // Object.is equality

[Killed] BlockStatement
src/catalog/domain/puzzle-change-proposal.ts:211:76
   }
 
   // Map to/from persistence without the aggregate knowing about any storage technology.
-  static rehydrate(state: PuzzleChangeProposalState): PuzzleChangeProposal {
-    return new PuzzleChangeProposal(state);
-  }
+  static rehydrate(state: PuzzleChangeProposalState): PuzzleChangeProposal {}
 
   toState(): PuzzleChangeProposalState {
killedBy: rehydrate/toState round-trip preserves every field
statusReason: Cannot read properties of undefined (reading 'toState')

[Killed] BlockStatement
src/catalog/domain/puzzle-change-proposal.ts:215:40
     return new PuzzleChangeProposal(state);
   }
 
-  toState(): PuzzleChangeProposalState {
-    return this.state;
-  }
+  toState(): PuzzleChangeProposalState {}
 
   // --- internals ---
killedBy: PuzzleChangeProposal.file starts pending and records ChangeProposalFiled with definition + proposer
statusReason: Cannot read properties of undefined (reading 'comment')

[Killed] BlockStatement
src/catalog/domain/puzzle-change-proposal.ts:225:33
   private transition(
     to: ProposalStatus,
     now: Date,
-  ): Result<void, CatalogError> {
-    if (!ALLOWED_PROPOSAL_TRANSITIONS[this.state.status].includes(to)) {
-      return err(CatalogError.illegalProposalTransition(this.state.status, to));
-    }
-    this.state = { ...this.state, status: to, updatedAt: now };
-    return ok(undefined);
-  }
+  ): Result<void, CatalogError> {}
 
   private record(event: DomainEvent): void {
killedBy: edit cannot edit a decided or withdrawn proposal
statusReason: Cannot read properties of undefined (reading 'isErr')

[Killed] BooleanLiteral
src/catalog/domain/puzzle-change-proposal.ts:226:9
     to: ProposalStatus,
     now: Date,
   ): Result<void, CatalogError> {
-    if (!ALLOWED_PROPOSAL_TRANSITIONS[this.state.status].includes(to)) {
+    if (ALLOWED_PROPOSAL_TRANSITIONS[this.state.status].includes(to)) {
       return err(CatalogError.illegalProposalTransition(this.state.status, to));
     }
killedBy: edit cannot edit a decided or withdrawn proposal
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/catalog/domain/puzzle-change-proposal.ts:226:9
     to: ProposalStatus,
     now: Date,
   ): Result<void, CatalogError> {
-    if (!ALLOWED_PROPOSAL_TRANSITIONS[this.state.status].includes(to)) {
+    if (true) {
       return err(CatalogError.illegalProposalTransition(this.state.status, to));
     }
killedBy: edit cannot edit a decided or withdrawn proposal
statusReason: expected false to be true // Object.is equality
