[Killed] ArrowFunction
src/catalog/domain/puzzle-searchable-text.ts:12:37
   readonly tags?: readonly string[];
 }
 
-export const puzzleSearchableText = (parts: PuzzleSearchableParts): string =>
-  [
-    parts.title,
-    parts.brand,
-    parts.publisher,
-    parts.artist,
-    parts.series,
-    ...(parts.tags ?? []),
-  ]
-    .filter((part): part is string => part !== undefined && part.length > 0)
-    .join(" ");
+export const puzzleSearchableText = () => undefined;
 
killedBy: searchableText (derived projection) joins title, brand, artist, series and tags, skipping empties
statusReason: expected undefined to be 'Starry Night Ravensburger Van Gogh Ma…' // Object.is equality

[Killed] MethodExpression
src/catalog/domain/puzzle-searchable-text.ts:13:3
 }
 
 export const puzzleSearchableText = (parts: PuzzleSearchableParts): string =>
-  [
-    parts.title,
-    parts.brand,
-    parts.publisher,
-    parts.artist,
-    parts.series,
-    ...(parts.tags ?? []),
-  ]
-    .filter((part): part is string => part !== undefined && part.length > 0)
+  [parts.title, parts.brand, parts.publisher, parts.artist, parts.series, ...(parts.tags ?? [])]
     .join(" ");
 
killedBy: searchableText (derived projection) joins title, brand, artist, series and tags, skipping empties
statusReason: expected 'Starry Night Ravensburger  Van Gogh M…' to be 'Starry Night Ravensburger Van Gogh Ma…' // Object.is equality

[Killed] LogicalOperator
src/catalog/domain/puzzle-searchable-text.ts:19:9
     parts.publisher,
     parts.artist,
     parts.series,
-    ...(parts.tags ?? []),
+    ...(parts.tags && []),
   ]
     .filter((part): part is string => part !== undefined && part.length > 0)
killedBy: searchableText (derived projection) joins title, brand, artist, series and tags, skipping empties
statusReason: expected 'Starry Night Ravensburger Van Gogh Ma…' to be 'Starry Night Ravensburger Van Gogh Ma…' // Object.is equality

[Killed] EqualityOperator
src/catalog/domain/puzzle-searchable-text.ts:21:61
     parts.series,
     ...(parts.tags ?? []),
   ]
-    .filter((part): part is string => part !== undefined && part.length > 0)
+    .filter((part): part is string => part !== undefined && part.length <= 0)
     .join(" ");
 
killedBy: searchableText (derived projection) joins title, brand, artist, series and tags, skipping empties
statusReason: expected '' to be 'Starry Night Ravensburger Van Gogh Ma…' // Object.is equality

[Killed] EqualityOperator
src/catalog/domain/puzzle-searchable-text.ts:21:39
     parts.series,
     ...(parts.tags ?? []),
   ]
-    .filter((part): part is string => part !== undefined && part.length > 0)
+    .filter((part): part is string => part === undefined && part.length > 0)
     .join(" ");
 
killedBy: searchableText (derived projection) joins title, brand, artist, series and tags, skipping empties
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] StringLiteral
src/catalog/domain/puzzle-searchable-text.ts:22:11
     ...(parts.tags ?? []),
   ]
     .filter((part): part is string => part !== undefined && part.length > 0)
-    .join(" ");
+    .join("");
 
killedBy: searchableText (derived projection) joins title, brand, artist, series and tags, skipping empties
statusReason: expected 'Starry NightRavensburgerVan GoghMaste…' to be 'Starry Night Ravensburger Van Gogh Ma…' // Object.is equality
