[Killed] BlockStatement
src/catalog/domain/store-page-fetch-error.ts:27:72
     super(message);
   }
 
-  static invalidUrl(url: string, detail?: string): StorePageFetchError {
-    return new StorePageFetchError(
-      "InvalidUrl",
-      `Not a valid URL: ${url}`,
-      detail,
-    );
-  }
+  static invalidUrl(url: string, detail?: string): StorePageFetchError {}
   static blocked(url: string, detail?: string): StorePageFetchError {
     return new StorePageFetchError(
killedBy: makeFallbackStorePageFetcher returns primary InvalidUrl error without calling fallback (InvalidUrl is not retryable)
statusReason: Cannot read properties of undefined (reading 'code')

[Killed] StringLiteral
src/catalog/domain/store-page-fetch-error.ts:29:7
 
   static invalidUrl(url: string, detail?: string): StorePageFetchError {
     return new StorePageFetchError(
-      "InvalidUrl",
+      "",
       `Not a valid URL: ${url}`,
       detail,
killedBy: makeFallbackStorePageFetcher returns primary InvalidUrl error without calling fallback (InvalidUrl is not retryable)
statusReason: expected '' to be 'InvalidUrl' // Object.is equality

[Killed] BlockStatement
src/catalog/domain/store-page-fetch-error.ts:34:69
       detail,
     );
   }
-  static blocked(url: string, detail?: string): StorePageFetchError {
-    return new StorePageFetchError(
-      "Blocked",
-      `Refused to fetch (blocked address): ${url}`,
-      detail,
-    );
-  }
+  static blocked(url: string, detail?: string): StorePageFetchError {}
   static timeout(url: string, detail?: string): StorePageFetchError {
     return new StorePageFetchError(
killedBy: makeFallbackStorePageFetcher calls fallback when primary fails Blocked (retryable)
statusReason: Cannot read properties of undefined (reading 'code')

[Killed] StringLiteral
src/catalog/domain/store-page-fetch-error.ts:37:7
   static blocked(url: string, detail?: string): StorePageFetchError {
     return new StorePageFetchError(
       "Blocked",
-      `Refused to fetch (blocked address): ${url}`,
+      ``,
       detail,
     );
killedBy: StorePageFetchError messages blocked interpolates the url
statusReason: expected '' to be 'Refused to fetch (blocked address): h…' // Object.is equality

[Killed] BlockStatement
src/catalog/domain/store-page-fetch-error.ts:41:69
       detail,
     );
   }
-  static timeout(url: string, detail?: string): StorePageFetchError {
-    return new StorePageFetchError(
-      "Timeout",
-      `Timed out fetching ${url}`,
-      detail,
-    );
-  }
+  static timeout(url: string, detail?: string): StorePageFetchError {}
   static notFound(url: string, detail?: string): StorePageFetchError {
     return new StorePageFetchError(
killedBy: makeFallbackStorePageFetcher returns primary Timeout error without calling fallback (Timeout is not retryable)
statusReason: Cannot read properties of undefined (reading 'code')

[Killed] StringLiteral
src/catalog/domain/store-page-fetch-error.ts:43:7
   }
   static timeout(url: string, detail?: string): StorePageFetchError {
     return new StorePageFetchError(
-      "Timeout",
+      "",
       `Timed out fetching ${url}`,
       detail,
killedBy: StorePageFetchError carries a stable code discriminant
statusReason: expected '' to be 'Timeout' // Object.is equality

[Killed] BlockStatement
src/catalog/domain/store-page-fetch-error.ts:48:70
       detail,
     );
   }
-  static notFound(url: string, detail?: string): StorePageFetchError {
-    return new StorePageFetchError(
-      "NotFound",
-      `Page not found: ${url}`,
-      detail,
-    );
-  }
+  static notFound(url: string, detail?: string): StorePageFetchError {}
   static fetchFailed(message: string, detail?: string): StorePageFetchError {
     return new StorePageFetchError(
killedBy: makeFallbackStorePageFetcher calls fallback when primary fails NotFound (retryable)
statusReason: Cannot read properties of undefined (reading 'code')

[Killed] StringLiteral
src/catalog/domain/store-page-fetch-error.ts:51:7
   static notFound(url: string, detail?: string): StorePageFetchError {
     return new StorePageFetchError(
       "NotFound",
-      `Page not found: ${url}`,
+      ``,
       detail,
     );
killedBy: StorePageFetchError messages notFound interpolates the url
statusReason: expected '' to be 'Page not found: https://gone.example' // Object.is equality

[Killed] BlockStatement
src/catalog/domain/store-page-fetch-error.ts:55:77
       detail,
     );
   }
-  static fetchFailed(message: string, detail?: string): StorePageFetchError {
-    return new StorePageFetchError(
-      "FetchFailed",
-      `Fetch failed: ${message}`,
-      detail ?? message,
-    );
-  }
+  static fetchFailed(message: string, detail?: string): StorePageFetchError {}
   static unparseable(url: string, detail?: string): StorePageFetchError {
     return new StorePageFetchError(
killedBy: StorePageFetchError carries a stable code discriminant
statusReason: Cannot read properties of undefined (reading 'code')

[Killed] LogicalOperator
src/catalog/domain/store-page-fetch-error.ts:59:7
     return new StorePageFetchError(
       "FetchFailed",
       `Fetch failed: ${message}`,
-      detail ?? message,
+      detail && message,
     );
   }
killedBy: StorePageFetchError carries an optional diagnostic detail (the underlying cause)
statusReason: expected 'boom' to be 'FETCH_ERROR: dns fail' // Object.is equality

[Killed] BlockStatement
src/catalog/domain/store-page-fetch-error.ts:62:73
       detail ?? message,
     );
   }
-  static unparseable(url: string, detail?: string): StorePageFetchError {
-    return new StorePageFetchError(
-      "Unparseable",
-      `Could not parse metadata from ${url}`,
-      detail,
-    );
-  }
+  static unparseable(url: string, detail?: string): StorePageFetchError {}
 }
 
killedBy: StorePageFetchError carries a stable code discriminant
statusReason: Cannot read properties of undefined (reading 'code')

[Killed] StringLiteral
src/catalog/domain/store-page-fetch-error.ts:65:7
   static unparseable(url: string, detail?: string): StorePageFetchError {
     return new StorePageFetchError(
       "Unparseable",
-      `Could not parse metadata from ${url}`,
+      ``,
       detail,
     );
killedBy: StorePageFetchError messages unparseable interpolates the url
statusReason: expected '' to be 'Could not parse metadata from https:/…' // Object.is equality
