[Killed] ArrowFunction
conversation/application/use-cases/post-message.ts:25:3
 // and non-empty-body rules to Thread.postMessage. On success persist the thread and publish its
 // recorded MessagePosted.
 export const makePostMessage =
-  (deps: PostMessageDeps): PostMessage =>
-  async (
-    cmd: PostMessageCommand,
-  ): Promise<
-    Result<MessageId, ConversationError | ConversationApplicationError>
-  > => {
-    const thread = await deps.threads.findById(cmd.threadId);
-    if (!thread) {
-      return err(ConversationApplicationError.threadNotFound(cmd.threadId));
-    }
-
-    const message = thread.postMessage({
-      id: deps.messageIds.next(),
-      authorId: cmd.authorId,
-      kind: cmd.kind,
-      body: cmd.body,
-      sentAt: deps.clock.now(),
-    });
-    if (message.isErr) return err(message.error);
-
-    await deps.threads.save(thread);
-    await deps.events.publish(thread.pullEvents());
-
-    return ok(message.value.id);
-  };
+  () => undefined;
 
killedBy: makePostMessage posts a participant's message, persists it, and publishes MessagePosted
statusReason: post is not a function

[Killed] BlockStatement
conversation/application/use-cases/post-message.ts:30:8
     cmd: PostMessageCommand,
   ): Promise<
     Result<MessageId, ConversationError | ConversationApplicationError>
-  > => {
-    const thread = await deps.threads.findById(cmd.threadId);
-    if (!thread) {
-      return err(ConversationApplicationError.threadNotFound(cmd.threadId));
-    }
-
-    const message = thread.postMessage({
-      id: deps.messageIds.next(),
-      authorId: cmd.authorId,
-      kind: cmd.kind,
-      body: cmd.body,
-      sentAt: deps.clock.now(),
-    });
-    if (message.isErr) return err(message.error);
-
-    await deps.threads.save(thread);
-    await deps.events.publish(thread.pullEvents());
-
-    return ok(message.value.id);
-  };
+  > => {};
 
killedBy: makePostMessage posts a participant's message, persists it, and publishes MessagePosted
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] BlockStatement
conversation/application/use-cases/post-message.ts:32:18
     Result<MessageId, ConversationError | ConversationApplicationError>
   > => {
     const thread = await deps.threads.findById(cmd.threadId);
-    if (!thread) {
-      return err(ConversationApplicationError.threadNotFound(cmd.threadId));
-    }
+    if (!thread) {}
 
     const message = thread.postMessage({
killedBy: makePostMessage rejects ThreadNotFound and writes nothing
statusReason: Cannot read properties of null (reading 'postMessage')

[Killed] ObjectLiteral
conversation/application/use-cases/post-message.ts:36:40
       return err(ConversationApplicationError.threadNotFound(cmd.threadId));
     }
 
-    const message = thread.postMessage({
-      id: deps.messageIds.next(),
-      authorId: cmd.authorId,
-      kind: cmd.kind,
-      body: cmd.body,
-      sentAt: deps.clock.now(),
-    });
+    const message = thread.postMessage({});
     if (message.isErr) return err(message.error);
 
killedBy: makePostMessage posts a participant's message, persists it, and publishes MessagePosted
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
conversation/application/use-cases/post-message.ts:43:9
       body: cmd.body,
       sentAt: deps.clock.now(),
     });
-    if (message.isErr) return err(message.error);
+    if (false) return err(message.error);
 
     await deps.threads.save(thread);
killedBy: makePostMessage rejects a non-participant and writes nothing
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
conversation/application/use-cases/post-message.ts:43:9
       body: cmd.body,
       sentAt: deps.clock.now(),
     });
-    if (message.isErr) return err(message.error);
+    if (true) return err(message.error);
 
     await deps.threads.save(thread);
killedBy: makePostMessage posts a participant's message, persists it, and publishes MessagePosted
statusReason: expected false to be true // Object.is equality
