[Killed] ArrowFunction
conversation/application/use-cases/post-system-message.ts:28:3
 // then delegate to Thread.postSystemMessage (only the non-empty-body rule applies; there is no
 // member author and no participant check). On success persist and publish MessagePosted.
 export const makePostSystemMessage =
-  (deps: PostSystemMessageDeps): PostSystemMessage =>
-  async (
-    cmd: PostSystemMessageCommand,
-  ): Promise<
-    Result<MessageId, ConversationError | ConversationApplicationError>
-  > => {
-    const thread = await deps.threads.findById(cmd.threadId);
-    if (!thread) {
-      return err(ConversationApplicationError.threadNotFound(cmd.threadId));
-    }
-
-    const message = thread.postSystemMessage({
-      id: deps.messageIds.next(),
-      body: cmd.body,
-      sentAt: deps.clock.now(),
-    });
-    if (message.isErr) return err(message.error);
-
-    await deps.threads.save(thread);
-    await deps.events.publish(thread.pullEvents());
-
-    return ok(message.value.id);
-  };
+  () => undefined;
 
killedBy: makePostSystemMessage posts a service-authored system message with no member author and publishes MessagePosted
statusReason: post is not a function

[Killed] BlockStatement
conversation/application/use-cases/post-system-message.ts:33:8
     cmd: PostSystemMessageCommand,
   ): Promise<
     Result<MessageId, ConversationError | ConversationApplicationError>
-  > => {
-    const thread = await deps.threads.findById(cmd.threadId);
-    if (!thread) {
-      return err(ConversationApplicationError.threadNotFound(cmd.threadId));
-    }
-
-    const message = thread.postSystemMessage({
-      id: deps.messageIds.next(),
-      body: cmd.body,
-      sentAt: deps.clock.now(),
-    });
-    if (message.isErr) return err(message.error);
-
-    await deps.threads.save(thread);
-    await deps.events.publish(thread.pullEvents());
-
-    return ok(message.value.id);
-  };
+  > => {};
 
killedBy: makePostSystemMessage posts a service-authored system message with no member author and publishes MessagePosted
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] ObjectLiteral
conversation/application/use-cases/post-system-message.ts:39:46
       return err(ConversationApplicationError.threadNotFound(cmd.threadId));
     }
 
-    const message = thread.postSystemMessage({
-      id: deps.messageIds.next(),
-      body: cmd.body,
-      sentAt: deps.clock.now(),
-    });
+    const message = thread.postSystemMessage({});
     if (message.isErr) return err(message.error);
 
killedBy: makePostSystemMessage posts a service-authored system message with no member author and publishes MessagePosted
statusReason: Cannot read properties of undefined (reading 'trim')
