[Killed] ArrowFunction
exchange/application/use-cases/confirm-completion.ts:4:38
 import { ConfirmCompletion } from "../ports/in/confirm-completion.port";
 import { ExchangeActionDeps, runExchangeAction } from "./run-exchange-action";
 
-export const makeConfirmCompletion = (
-  deps: ExchangeActionDeps,
-): ConfirmCompletion =>
-  runExchangeAction(deps, (exchange, by, now) =>
-    exchange.confirmCompletion(by, now),
-  );
+export const makeConfirmCompletion = () => undefined;
 
killedBy: makeConfirmCompletion (dual confirmation) first confirmation keeps the exchange accepted and emits no completion events
statusReason: makeConfirmCompletion(...) is not a function

[Killed] ArrowFunction
exchange/application/use-cases/confirm-completion.ts:7:27
 export const makeConfirmCompletion = (
   deps: ExchangeActionDeps,
 ): ConfirmCompletion =>
-  runExchangeAction(deps, (exchange, by, now) =>
-    exchange.confirmCompletion(by, now),
+  runExchangeAction(deps, () => undefined,
   );
 
killedBy: makeConfirmCompletion (dual confirmation) first confirmation keeps the exchange accepted and emits no completion events
statusReason: Cannot read properties of undefined (reading 'isErr')
