[Killed] ArrowFunction
exchange/application/use-cases/cancel-exchange.ts:4:35
 import { CancelExchange } from "../ports/in/cancel-exchange.port";
 import { ExchangeActionDeps, runExchangeAction } from "./run-exchange-action";
 
-export const makeCancelExchange = (deps: ExchangeActionDeps): CancelExchange =>
-  runExchangeAction(deps, (exchange, by, now) => exchange.cancel(by, now));
+export const makeCancelExchange = () => undefined;
 
killedBy: makeCancelExchange lets the initiator cancel, publishing ExchangeCancelled
statusReason: makeCancelExchange(...) is not a function

[Killed] ArrowFunction
exchange/application/use-cases/cancel-exchange.ts:5:27
 import { ExchangeActionDeps, runExchangeAction } from "./run-exchange-action";
 
 export const makeCancelExchange = (deps: ExchangeActionDeps): CancelExchange =>
-  runExchangeAction(deps, (exchange, by, now) => exchange.cancel(by, now));
+  runExchangeAction(deps, () => undefined);
 
killedBy: makeCancelExchange lets the initiator cancel, publishing ExchangeCancelled
statusReason: Cannot read properties of undefined (reading 'isErr')
