[Killed] ArrowFunction
exchange/application/use-cases/decline-exchange.ts:4:36
 import { DeclineExchange } from "../ports/in/decline-exchange.port";
 import { ExchangeActionDeps, runExchangeAction } from "./run-exchange-action";
 
-export const makeDeclineExchange = (
-  deps: ExchangeActionDeps,
-): DeclineExchange =>
-  runExchangeAction(deps, (exchange, by, now) => exchange.decline(by, now));
+export const makeDeclineExchange = () => undefined;
 
killedBy: makeDeclineExchange declines a proposed exchange, publishing ExchangeRejected
statusReason: makeDeclineExchange(...) is not a function

[Killed] ArrowFunction
exchange/application/use-cases/decline-exchange.ts:7:27
 export const makeDeclineExchange = (
   deps: ExchangeActionDeps,
 ): DeclineExchange =>
-  runExchangeAction(deps, (exchange, by, now) => exchange.decline(by, now));
+  runExchangeAction(deps, () => undefined);
 
killedBy: makeDeclineExchange declines a proposed exchange, publishing ExchangeRejected
statusReason: Cannot read properties of undefined (reading 'isErr')
