[Killed] BlockStatement
exchange/application/use-cases/propose-exchange.ts:33:71
 }
 
 // Is the copy offered for this kind? swap⇒forTrade, sale⇒forSale, lend⇒forLend.
-const availableFor = (copy: CopyView, kind: ExchangeKind): boolean => {
-  switch (kind) {
-    case "swap":
-      return copy.availability.forTrade;
-    case "sale":
-      return copy.availability.forSale;
-    case "lend":
-      return copy.availability.forLend;
-  }
-};
+const availableFor = (copy: CopyView, kind: ExchangeKind): boolean => {};
 
 // Transaction script: cross-aggregate read checks (dedup, copy existence/availability/ownership)
killedBy: makeProposeExchange proposes a swap, saving state and publishing ExchangeProposed
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
exchange/application/use-cases/propose-exchange.ts:35:5
 // Is the copy offered for this kind? swap⇒forTrade, sale⇒forSale, lend⇒forLend.
 const availableFor = (copy: CopyView, kind: ExchangeKind): boolean => {
   switch (kind) {
-    case "swap":
-      return copy.availability.forTrade;
+    case "swap":
     case "sale":
       return copy.availability.forSale;
killedBy: makeProposeExchange proposes a swap, saving state and publishing ExchangeProposed
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
exchange/application/use-cases/propose-exchange.ts:35:10
 // Is the copy offered for this kind? swap⇒forTrade, sale⇒forSale, lend⇒forLend.
 const availableFor = (copy: CopyView, kind: ExchangeKind): boolean => {
   switch (kind) {
-    case "swap":
+    case "":
       return copy.availability.forTrade;
     case "sale":
killedBy: makeProposeExchange proposes a swap, saving state and publishing ExchangeProposed
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
exchange/application/use-cases/propose-exchange.ts:37:5
   switch (kind) {
     case "swap":
       return copy.availability.forTrade;
-    case "sale":
-      return copy.availability.forSale;
+    case "sale":
     case "lend":
       return copy.availability.forLend;
killedBy: makeProposeExchange availability is checked per kind (corrected direction) sale proceeds only when forSale is true
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
exchange/application/use-cases/propose-exchange.ts:39:5
       return copy.availability.forTrade;
     case "sale":
       return copy.availability.forSale;
-    case "lend":
-      return copy.availability.forLend;
+    case "lend":
   }
 };
killedBy: makeProposeExchange availability is checked per kind (corrected direction) lend proceeds only when forLend is true
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
exchange/application/use-cases/propose-exchange.ts:56:9
       cmd.initiatorId,
       cmd.requestedCopyId,
     );
-    if (duplicate)
+    if (true)
       return err(ApplicationError.duplicateProposal(cmd.requestedCopyId));
 
killedBy: makeProposeExchange proposes a swap, saving state and publishing ExchangeProposed
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
exchange/application/use-cases/propose-exchange.ts:56:9
       cmd.initiatorId,
       cmd.requestedCopyId,
     );
-    if (duplicate)
+    if (false)
       return err(ApplicationError.duplicateProposal(cmd.requestedCopyId));
 
killedBy: makeProposeExchange rejects a duplicate active proposal for the same requested copy
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
exchange/application/use-cases/propose-exchange.ts:60:9
       return err(ApplicationError.duplicateProposal(cmd.requestedCopyId));
 
     const requested = await deps.copies.getCopy(cmd.requestedCopyId);
-    if (!requested)
+    if (true)
       return err(ApplicationError.copyNotFound(cmd.requestedCopyId));
     if (!availableFor(requested, cmd.kind)) {
killedBy: makeProposeExchange proposes a swap, saving state and publishing ExchangeProposed
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
exchange/application/use-cases/propose-exchange.ts:60:9
       return err(ApplicationError.duplicateProposal(cmd.requestedCopyId));
 
     const requested = await deps.copies.getCopy(cmd.requestedCopyId);
-    if (!requested)
+    if (requested)
       return err(ApplicationError.copyNotFound(cmd.requestedCopyId));
     if (!availableFor(requested, cmd.kind)) {
killedBy: makeProposeExchange proposes a swap, saving state and publishing ExchangeProposed
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
exchange/application/use-cases/propose-exchange.ts:62:9
     const requested = await deps.copies.getCopy(cmd.requestedCopyId);
     if (!requested)
       return err(ApplicationError.copyNotFound(cmd.requestedCopyId));
-    if (!availableFor(requested, cmd.kind)) {
+    if (true) {
       return err(
         ApplicationError.copyNotAvailable(cmd.requestedCopyId, cmd.kind),
killedBy: makeProposeExchange proposes a swap, saving state and publishing ExchangeProposed
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
exchange/application/use-cases/propose-exchange.ts:62:45
     const requested = await deps.copies.getCopy(cmd.requestedCopyId);
     if (!requested)
       return err(ApplicationError.copyNotFound(cmd.requestedCopyId));
-    if (!availableFor(requested, cmd.kind)) {
-      return err(
-        ApplicationError.copyNotAvailable(cmd.requestedCopyId, cmd.kind),
-      );
-    }
+    if (!availableFor(requested, cmd.kind)) {}
     // The recipient must actually own the requested copy, else the proposal targets an arbitrary
     // member (spam) and could never settle.
killedBy: makeProposeExchange availability is checked per kind (corrected direction) swap proceeds only when forTrade is true
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
exchange/application/use-cases/propose-exchange.ts:69:9
     }
     // The recipient must actually own the requested copy, else the proposal targets an arbitrary
     // member (spam) and could never settle.
-    if (requested.ownerId !== cmd.recipientId) {
+    if (requested.ownerId === cmd.recipientId) {
       return err(ApplicationError.recipientNotOwner(cmd.requestedCopyId));
     }
killedBy: makeProposeExchange proposes a swap, saving state and publishing ExchangeProposed
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
exchange/application/use-cases/propose-exchange.ts:69:9
     }
     // The recipient must actually own the requested copy, else the proposal targets an arbitrary
     // member (spam) and could never settle.
-    if (requested.ownerId !== cmd.recipientId) {
+    if (false) {
       return err(ApplicationError.recipientNotOwner(cmd.requestedCopyId));
     }
killedBy: makeProposeExchange rejects when the requested copy is not owned by the named recipient
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
exchange/application/use-cases/propose-exchange.ts:73:30
       return err(ApplicationError.recipientNotOwner(cmd.requestedCopyId));
     }
 
-    if (cmd.kind === "swap") {
-      const offered = await loadOfferedCopy(deps.copies, cmd);
-      if (offered.isErr) return offered;
-    }
+    if (cmd.kind === "swap") {}
 
     const exchange = Exchange.propose({
killedBy: makeProposeExchange rejects a swap whose offered copy is not owned by the initiator
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
exchange/application/use-cases/propose-exchange.ts:73:9
       return err(ApplicationError.recipientNotOwner(cmd.requestedCopyId));
     }
 
-    if (cmd.kind === "swap") {
+    if (cmd.kind !== "swap") {
       const offered = await loadOfferedCopy(deps.copies, cmd);
       if (offered.isErr) return offered;
killedBy: makeProposeExchange rejects a swap whose offered copy is not owned by the initiator
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
exchange/application/use-cases/propose-exchange.ts:75:11
 
     if (cmd.kind === "swap") {
       const offered = await loadOfferedCopy(deps.copies, cmd);
-      if (offered.isErr) return offered;
+      if (false) return offered;
     }
 
killedBy: makeProposeExchange rejects a swap whose offered copy is not owned by the initiator
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
exchange/application/use-cases/propose-exchange.ts:75:11
 
     if (cmd.kind === "swap") {
       const offered = await loadOfferedCopy(deps.copies, cmd);
-      if (offered.isErr) return offered;
+      if (true) return offered;
     }
 
killedBy: makeProposeExchange proposes a swap, saving state and publishing ExchangeProposed
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ObjectLiteral
exchange/application/use-cases/propose-exchange.ts:78:39
       if (offered.isErr) return offered;
     }
 
-    const exchange = Exchange.propose({
-      id: deps.ids.next(),
-      initiator: cmd.initiatorId,
-      recipient: cmd.recipientId,
-      requestedCopyId: cmd.requestedCopyId,
-      terms: cmd.terms,
-      now: deps.clock.now(),
-    });
+    const exchange = Exchange.propose({});
     if (exchange.isErr) return err(exchange.error);
 
killedBy: makeProposeExchange proposes a swap, saving state and publishing ExchangeProposed
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
exchange/application/use-cases/propose-exchange.ts:86:9
       terms: cmd.terms,
       now: deps.clock.now(),
     });
-    if (exchange.isErr) return err(exchange.error);
+    if (true) return err(exchange.error);
 
     await deps.exchanges.save(exchange.value);
killedBy: makeProposeExchange proposes a swap, saving state and publishing ExchangeProposed
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
exchange/application/use-cases/propose-exchange.ts:86:9
       terms: cmd.terms,
       now: deps.clock.now(),
     });
-    if (exchange.isErr) return err(exchange.error);
+    if (false) return err(exchange.error);
 
     await deps.exchanges.save(exchange.value);
killedBy: makeProposeExchange delegates self-exchange rejection to the aggregate
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] BlockStatement
exchange/application/use-cases/propose-exchange.ts:98:47
 const loadOfferedCopy = async (
   copies: CopyPort,
   cmd: ProposeExchangeCommand,
-): Promise<Result<void, ApplicationError>> => {
-  const offeredCopyId: CopyId | undefined =
-    cmd.terms.kind === "swap" ? cmd.terms.offeredCopyId : undefined;
-  // No offered copy: defer to Exchange.propose, which rejects swap terms without one (MissingTerms).
-  if (!offeredCopyId) return ok(undefined);
-
-  const offered = await copies.getCopy(offeredCopyId);
-  if (!offered) return err(ApplicationError.copyNotFound(offeredCopyId));
-  if (offered.ownerId !== cmd.initiatorId) {
-    return err(ApplicationError.offeredCopyNotOwned(offeredCopyId));
-  }
-  return ok(undefined);
-};
+): Promise<Result<void, ApplicationError>> => {};
 
killedBy: makeProposeExchange proposes a swap, saving state and publishing ExchangeProposed
statusReason: Cannot read properties of undefined (reading 'isErr')

[Killed] EqualityOperator
exchange/application/use-cases/propose-exchange.ts:100:5
   cmd: ProposeExchangeCommand,
 ): Promise<Result<void, ApplicationError>> => {
   const offeredCopyId: CopyId | undefined =
-    cmd.terms.kind === "swap" ? cmd.terms.offeredCopyId : undefined;
+    cmd.terms.kind !== "swap" ? cmd.terms.offeredCopyId : undefined;
   // No offered copy: defer to Exchange.propose, which rejects swap terms without one (MissingTerms).
   if (!offeredCopyId) return ok(undefined);
killedBy: makeProposeExchange rejects a swap whose offered copy is not owned by the initiator
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
exchange/application/use-cases/propose-exchange.ts:100:5
   cmd: ProposeExchangeCommand,
 ): Promise<Result<void, ApplicationError>> => {
   const offeredCopyId: CopyId | undefined =
-    cmd.terms.kind === "swap" ? cmd.terms.offeredCopyId : undefined;
+    false ? cmd.terms.offeredCopyId : undefined;
   // No offered copy: defer to Exchange.propose, which rejects swap terms without one (MissingTerms).
   if (!offeredCopyId) return ok(undefined);
killedBy: makeProposeExchange rejects a swap whose offered copy is not owned by the initiator
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
exchange/application/use-cases/propose-exchange.ts:102:7
   const offeredCopyId: CopyId | undefined =
     cmd.terms.kind === "swap" ? cmd.terms.offeredCopyId : undefined;
   // No offered copy: defer to Exchange.propose, which rejects swap terms without one (MissingTerms).
-  if (!offeredCopyId) return ok(undefined);
+  if (offeredCopyId) return ok(undefined);
 
   const offered = await copies.getCopy(offeredCopyId);
killedBy: makeProposeExchange rejects a swap whose offered copy is not owned by the initiator
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
exchange/application/use-cases/propose-exchange.ts:102:7
   const offeredCopyId: CopyId | undefined =
     cmd.terms.kind === "swap" ? cmd.terms.offeredCopyId : undefined;
   // No offered copy: defer to Exchange.propose, which rejects swap terms without one (MissingTerms).
-  if (!offeredCopyId) return ok(undefined);
+  if (true) return ok(undefined);
 
   const offered = await copies.getCopy(offeredCopyId);
killedBy: makeProposeExchange rejects a swap whose offered copy is not owned by the initiator
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
exchange/application/use-cases/propose-exchange.ts:105:7
   if (!offeredCopyId) return ok(undefined);
 
   const offered = await copies.getCopy(offeredCopyId);
-  if (!offered) return err(ApplicationError.copyNotFound(offeredCopyId));
+  if (false) return err(ApplicationError.copyNotFound(offeredCopyId));
   if (offered.ownerId !== cmd.initiatorId) {
     return err(ApplicationError.offeredCopyNotOwned(offeredCopyId));
killedBy: makeProposeExchange rejects a swap whose offered copy does not exist
statusReason: Cannot read properties of null (reading 'ownerId')

[Killed] ConditionalExpression
exchange/application/use-cases/propose-exchange.ts:105:7
   if (!offeredCopyId) return ok(undefined);
 
   const offered = await copies.getCopy(offeredCopyId);
-  if (!offered) return err(ApplicationError.copyNotFound(offeredCopyId));
+  if (true) return err(ApplicationError.copyNotFound(offeredCopyId));
   if (offered.ownerId !== cmd.initiatorId) {
     return err(ApplicationError.offeredCopyNotOwned(offeredCopyId));
killedBy: makeProposeExchange proposes a swap, saving state and publishing ExchangeProposed
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
exchange/application/use-cases/propose-exchange.ts:106:7
 
   const offered = await copies.getCopy(offeredCopyId);
   if (!offered) return err(ApplicationError.copyNotFound(offeredCopyId));
-  if (offered.ownerId !== cmd.initiatorId) {
+  if (offered.ownerId === cmd.initiatorId) {
     return err(ApplicationError.offeredCopyNotOwned(offeredCopyId));
   }
killedBy: makeProposeExchange proposes a swap, saving state and publishing ExchangeProposed
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
exchange/application/use-cases/propose-exchange.ts:106:44
 
   const offered = await copies.getCopy(offeredCopyId);
   if (!offered) return err(ApplicationError.copyNotFound(offeredCopyId));
-  if (offered.ownerId !== cmd.initiatorId) {
-    return err(ApplicationError.offeredCopyNotOwned(offeredCopyId));
-  }
+  if (offered.ownerId !== cmd.initiatorId) {}
   return ok(undefined);
 };
killedBy: makeProposeExchange rejects a swap whose offered copy is not owned by the initiator
statusReason: expected false to be true // Object.is equality
