[Killed] ArrowFunction
exchange/application/use-cases/raise-dispute.ts:4:33
 import { RaiseDispute } from "../ports/in/raise-dispute.port";
 import { ExchangeActionDeps, runExchangeAction } from "./run-exchange-action";
 
-export const makeRaiseDispute = (deps: ExchangeActionDeps): RaiseDispute =>
-  runExchangeAction(deps, (exchange, by, now) =>
-    exchange.raiseDispute(by, now),
-  );
+export const makeRaiseDispute = () => undefined;
 
killedBy: makeRaiseDispute lets a party dispute an accepted exchange, publishing DisputeRaised
statusReason: makeRaiseDispute(...) is not a function

[Killed] ArrowFunction
exchange/application/use-cases/raise-dispute.ts:5:27
 import { ExchangeActionDeps, runExchangeAction } from "./run-exchange-action";
 
 export const makeRaiseDispute = (deps: ExchangeActionDeps): RaiseDispute =>
-  runExchangeAction(deps, (exchange, by, now) =>
-    exchange.raiseDispute(by, now),
+  runExchangeAction(deps, () => undefined,
   );
 
killedBy: makeRaiseDispute lets a party dispute an accepted exchange, publishing DisputeRaised
statusReason: Cannot read properties of undefined (reading 'isErr')
