[Killed] ArrowFunction
exchange/application/use-cases/run-exchange-action.ts:30:3
 // Shared transaction script for the lifecycle use cases: load (→ ExchangeNotFound), invoke
 // the aggregate method (it owns party-auth + legal transitions), persist, publish.
 export const runExchangeAction =
-  (deps: ExchangeActionDeps, action: AggregateAction) =>
-  async (
-    cmd: ExchangeActionCommand,
-  ): Promise<Result<void, ExchangeError | ApplicationError>> => {
-    const exchange = await deps.exchanges.findById(cmd.exchangeId);
-    if (!exchange)
-      return err(ApplicationError.exchangeNotFound(cmd.exchangeId));
-
-    const outcome = action(exchange, cmd.actingMemberId, deps.clock.now());
-    if (outcome.isErr) return err(outcome.error);
-
-    await deps.exchanges.save(exchange);
-    await deps.events.publish(exchange.pullEvents());
-    return ok(undefined);
-  };
+  () => undefined;
 
killedBy: makeAcceptExchange accepts a proposed exchange, persisting and publishing ExchangeAccepted
statusReason: makeAcceptExchange(...) is not a function

[Killed] BlockStatement
exchange/application/use-cases/run-exchange-action.ts:33:65
   (deps: ExchangeActionDeps, action: AggregateAction) =>
   async (
     cmd: ExchangeActionCommand,
-  ): Promise<Result<void, ExchangeError | ApplicationError>> => {
-    const exchange = await deps.exchanges.findById(cmd.exchangeId);
-    if (!exchange)
-      return err(ApplicationError.exchangeNotFound(cmd.exchangeId));
-
-    const outcome = action(exchange, cmd.actingMemberId, deps.clock.now());
-    if (outcome.isErr) return err(outcome.error);
-
-    await deps.exchanges.save(exchange);
-    await deps.events.publish(exchange.pullEvents());
-    return ok(undefined);
-  };
+  ): Promise<Result<void, ExchangeError | ApplicationError>> => {};
 
killedBy: makeAcceptExchange accepts a proposed exchange, persisting and publishing ExchangeAccepted
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] ConditionalExpression
exchange/application/use-cases/run-exchange-action.ts:35:9
     cmd: ExchangeActionCommand,
   ): Promise<Result<void, ExchangeError | ApplicationError>> => {
     const exchange = await deps.exchanges.findById(cmd.exchangeId);
-    if (!exchange)
+    if (false)
       return err(ApplicationError.exchangeNotFound(cmd.exchangeId));
 
killedBy: makeAcceptExchange returns ExchangeNotFound when no exchange exists
statusReason: Cannot read properties of null (reading 'accept')

[Killed] BooleanLiteral
exchange/application/use-cases/run-exchange-action.ts:35:9
     cmd: ExchangeActionCommand,
   ): Promise<Result<void, ExchangeError | ApplicationError>> => {
     const exchange = await deps.exchanges.findById(cmd.exchangeId);
-    if (!exchange)
+    if (exchange)
       return err(ApplicationError.exchangeNotFound(cmd.exchangeId));
 
killedBy: makeAcceptExchange accepts a proposed exchange, persisting and publishing ExchangeAccepted
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
exchange/application/use-cases/run-exchange-action.ts:39:9
       return err(ApplicationError.exchangeNotFound(cmd.exchangeId));
 
     const outcome = action(exchange, cmd.actingMemberId, deps.clock.now());
-    if (outcome.isErr) return err(outcome.error);
+    if (true) return err(outcome.error);
 
     await deps.exchanges.save(exchange);
killedBy: makeAcceptExchange accepts a proposed exchange, persisting and publishing ExchangeAccepted
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
exchange/application/use-cases/run-exchange-action.ts:39:9
       return err(ApplicationError.exchangeNotFound(cmd.exchangeId));
 
     const outcome = action(exchange, cmd.actingMemberId, deps.clock.now());
-    if (outcome.isErr) return err(outcome.error);
+    if (false) return err(outcome.error);
 
     await deps.exchanges.save(exchange);
killedBy: makeAcceptExchange delegates wrong-party rejection to the aggregate
statusReason: expected false to be true // Object.is equality
