[Killed] StringLiteral
src/exchange/domain/events.ts:10:19
 // and dispatches them to subscribers (Library, Reputation, Notifications, Insights).
 
 export class ExchangeProposed implements DomainEvent {
-  readonly name = "ExchangeProposed";
+  readonly name = "";
   constructor(
     readonly exchangeId: ExchangeId,
killedBy: Exchange.propose starts proposed and records ExchangeProposed carrying parties and kind
statusReason: expected [ '' ] to deeply equal [ 'ExchangeProposed' ]

[Killed] StringLiteral
src/exchange/domain/events.ts:29:19
 }
 
 export class ExchangeRejected implements DomainEvent {
-  readonly name = "ExchangeRejected";
+  readonly name = "";
   constructor(
     readonly exchangeId: ExchangeId,
killedBy: decline lets the recipient decline, moving to rejected
statusReason: expected [ '' ] to deeply equal [ 'ExchangeRejected' ]

[Killed] StringLiteral
src/exchange/domain/events.ts:37:19
 }
 
 export class ExchangeCancelled implements DomainEvent {
-  readonly name = "ExchangeCancelled";
+  readonly name = "";
   constructor(
     readonly exchangeId: ExchangeId,
killedBy: makeCancelExchange lets the initiator cancel, publishing ExchangeCancelled
statusReason: expected [ '' ] to deeply equal [ 'ExchangeCancelled' ]

[Killed] StringLiteral
src/exchange/domain/events.ts:45:19
 }
 
 export class ExchangeCompleted implements DomainEvent {
-  readonly name = "ExchangeCompleted";
+  readonly name = "";
   constructor(
     readonly exchangeId: ExchangeId,
killedBy: settlement events a swap transfers BOTH copies: requested→initiator, offered→recipient
statusReason: expected [ '', 'OwnershipTransferred', …(1) ] to deeply equal [ 'ExchangeCompleted', …(2) ]
