[Killed] ObjectLiteral
src/exchange/domain/exchange.ts:27:5
 // any move not listed here is an IllegalTransition. (proposal §1.4)
 const ALLOWED_TRANSITIONS: Readonly<
   Record<ExchangeStatus, readonly ExchangeStatus[]>
-> = {
-  proposed: ["accepted", "rejected", "cancelled"],
-  accepted: ["completed", "cancelled", "disputed"],
-  completed: ["disputed"], // a problem can surface after settlement
-  rejected: [],
-  cancelled: [],
-  disputed: [],
-};
+> = {};
 
 // Input to propose(): the requested copy plus kind-tagged (still-unvalidated) terms.
killedBy: accept lets the recipient accept a proposed exchange
statusReason: Cannot read properties of undefined (reading 'includes')

[Killed] ArrayDeclaration
src/exchange/domain/exchange.ts:28:13
 const ALLOWED_TRANSITIONS: Readonly<
   Record<ExchangeStatus, readonly ExchangeStatus[]>
 > = {
-  proposed: ["accepted", "rejected", "cancelled"],
+  proposed: [],
   accepted: ["completed", "cancelled", "disputed"],
   completed: ["disputed"], // a problem can surface after settlement
killedBy: accept lets the recipient accept a proposed exchange
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/exchange/domain/exchange.ts:29:27
   Record<ExchangeStatus, readonly ExchangeStatus[]>
 > = {
   proposed: ["accepted", "rejected", "cancelled"],
-  accepted: ["completed", "cancelled", "disputed"],
+  accepted: ["completed", "", "disputed"],
   completed: ["disputed"], // a problem can surface after settlement
   rejected: [],
killedBy: cancel lets the initiator cancel an accepted exchange
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/exchange/domain/exchange.ts:30:15
 > = {
   proposed: ["accepted", "rejected", "cancelled"],
   accepted: ["completed", "cancelled", "disputed"],
-  completed: ["disputed"], // a problem can surface after settlement
+  completed: [""], // a problem can surface after settlement
   rejected: [],
   cancelled: [],
killedBy: raiseDispute a completed exchange can still be disputed
statusReason: expected false to be true // Object.is equality

[Killed] ArrayDeclaration
src/exchange/domain/exchange.ts:30:14
 > = {
   proposed: ["accepted", "rejected", "cancelled"],
   accepted: ["completed", "cancelled", "disputed"],
-  completed: ["disputed"], // a problem can surface after settlement
+  completed: [], // a problem can surface after settlement
   rejected: [],
   cancelled: [],
killedBy: raiseDispute a completed exchange can still be disputed
statusReason: expected false to be true // Object.is equality

[Survived] ArrayDeclaration
src/exchange/domain/exchange.ts:31:13
   proposed: ["accepted", "rejected", "cancelled"],
   accepted: ["completed", "cancelled", "disputed"],
   completed: ["disputed"], // a problem can surface after settlement
-  rejected: [],
+  rejected: ["Stryker was here"],
   cancelled: [],
   disputed: [],

[Killed] BlockStatement
src/exchange/domain/exchange.ts:69:24
 
   private constructor(private state: ExchangeState) {}
 
-  get id(): ExchangeId {
-    return this.state.id;
-  }
+  get id(): ExchangeId {}
 
   get status(): ExchangeStatus {
killedBy: makeAcceptExchange accepts a proposed exchange, persisting and publishing ExchangeAccepted
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/exchange/domain/exchange.ts:73:32
     return this.state.id;
   }
 
-  get status(): ExchangeStatus {
-    return this.state.status;
-  }
+  get status(): ExchangeStatus {}
 
   get kind(): ExchangeKind {
killedBy: Exchange.propose starts proposed and records ExchangeProposed carrying parties and kind
statusReason: expected undefined to be 'proposed' // Object.is equality

[Killed] BlockStatement
src/exchange/domain/exchange.ts:77:28
     return this.state.status;
   }
 
-  get kind(): ExchangeKind {
-    return this.state.kind;
-  }
+  get kind(): ExchangeKind {}
 
   // Create a brand-new proposal. Decides only from its own data: rejects self-exchange
killedBy: Exchange.propose starts proposed and records ExchangeProposed carrying parties and kind
statusReason: expected undefined to be 'swap' // Object.is equality

[Killed] BlockStatement
src/exchange/domain/exchange.ts:84:72
   // Create a brand-new proposal. Decides only from its own data: rejects self-exchange
   // and invalid kind-specific terms. Availability/dedup checks need repositories and live
   // in the application layer (1b), not here.
-  static propose(props: ProposeProps): Result<Exchange, ExchangeError> {
-    if (props.initiator === props.recipient) {
-      return err(ExchangeError.selfExchange());
-    }
-
-    const terms = validateTerms(props.terms);
-    if (terms.isErr) return err(terms.error);
-
-    const state = Exchange.stateFromTerms(props, terms.value);
-    const exchange = new Exchange(state);
-    exchange.record(
-      new ExchangeProposed(
-        state.id,
-        state.kind,
-        state.initiatorId,
-        state.recipientId,
-        props.now,
-      ),
-    );
-    return ok(exchange);
-  }
+  static propose(props: ProposeProps): Result<Exchange, ExchangeError> {}
 
   // Recipient agrees to the proposal.
killedBy: makeProposeExchange proposes a swap, saving state and publishing ExchangeProposed
statusReason: Cannot read properties of undefined (reading 'isErr')

[Killed] ConditionalExpression
src/exchange/domain/exchange.ts:85:9
   // and invalid kind-specific terms. Availability/dedup checks need repositories and live
   // in the application layer (1b), not here.
   static propose(props: ProposeProps): Result<Exchange, ExchangeError> {
-    if (props.initiator === props.recipient) {
+    if (false) {
       return err(ExchangeError.selfExchange());
     }
killedBy: makeProposeExchange delegates self-exchange rejection to the aggregate
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/exchange/domain/exchange.ts:85:9
   // and invalid kind-specific terms. Availability/dedup checks need repositories and live
   // in the application layer (1b), not here.
   static propose(props: ProposeProps): Result<Exchange, ExchangeError> {
-    if (props.initiator === props.recipient) {
+    if (true) {
       return err(ExchangeError.selfExchange());
     }
killedBy: makeProposeExchange proposes a swap, saving state and publishing ExchangeProposed
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/exchange/domain/exchange.ts:90:9
     }
 
     const terms = validateTerms(props.terms);
-    if (terms.isErr) return err(terms.error);
+    if (true) return err(terms.error);
 
     const state = Exchange.stateFromTerms(props, terms.value);
killedBy: makeAcceptExchange accepts a proposed exchange, persisting and publishing ExchangeAccepted
statusReason: setup

[Killed] ConditionalExpression
src/exchange/domain/exchange.ts:90:9
     }
 
     const terms = validateTerms(props.terms);
-    if (terms.isErr) return err(terms.error);
+    if (false) return err(terms.error);
 
     const state = Exchange.stateFromTerms(props, terms.value);
killedBy: Exchange.propose rejects swap without offered copy with MissingTerms
statusReason: Cannot read properties of undefined (reading 'kind')

[Killed] BlockStatement
src/exchange/domain/exchange.ts:107:64
   }
 
   // Recipient agrees to the proposal.
-  accept(by: MemberId, now: Date): Result<void, ExchangeError> {
-    return this.guarded(
-      "accepted",
-      () => this.requireParty(by, "recipient", "accept"),
-      now,
-      () => {
-        this.record(new ExchangeAccepted(this.id, now));
-      },
-    );
-  }
+  accept(by: MemberId, now: Date): Result<void, ExchangeError> {}
 
   // Recipient declines the proposal.
killedBy: accept lets the recipient accept a proposed exchange
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] StringLiteral
src/exchange/domain/exchange.ts:109:7
   // Recipient agrees to the proposal.
   accept(by: MemberId, now: Date): Result<void, ExchangeError> {
     return this.guarded(
-      "accepted",
+      "",
       () => this.requireParty(by, "recipient", "accept"),
       now,
killedBy: makeAcceptExchange accepts a proposed exchange, persisting and publishing ExchangeAccepted
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/exchange/domain/exchange.ts:110:7
   accept(by: MemberId, now: Date): Result<void, ExchangeError> {
     return this.guarded(
       "accepted",
-      () => this.requireParty(by, "recipient", "accept"),
+      () => undefined,
       now,
       () => {
killedBy: accept lets the recipient accept a proposed exchange
statusReason: Cannot read properties of undefined (reading 'isErr')

[Survived] StringLiteral
src/exchange/domain/exchange.ts:110:35
   accept(by: MemberId, now: Date): Result<void, ExchangeError> {
     return this.guarded(
       "accepted",
-      () => this.requireParty(by, "recipient", "accept"),
+      () => this.requireParty(by, "", "accept"),
       now,
       () => {

[Killed] BlockStatement
src/exchange/domain/exchange.ts:112:13
       "accepted",
       () => this.requireParty(by, "recipient", "accept"),
       now,
-      () => {
-        this.record(new ExchangeAccepted(this.id, now));
-      },
+      () => {},
     );
   }
killedBy: accept lets the recipient accept a proposed exchange
statusReason: expected [] to deeply equal [ 'ExchangeAccepted' ]

[Killed] BlockStatement
src/exchange/domain/exchange.ts:119:65
   }
 
   // Recipient declines the proposal.
-  decline(by: MemberId, now: Date): Result<void, ExchangeError> {
-    return this.guarded(
-      "rejected",
-      () => this.requireParty(by, "recipient", "decline"),
-      now,
-      () => {
-        this.record(new ExchangeRejected(this.id, now));
-      },
-    );
-  }
+  decline(by: MemberId, now: Date): Result<void, ExchangeError> {}
 
   // Initiator withdraws a proposed or accepted deal.
killedBy: decline lets the recipient decline, moving to rejected
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] ArrowFunction
src/exchange/domain/exchange.ts:122:7
   decline(by: MemberId, now: Date): Result<void, ExchangeError> {
     return this.guarded(
       "rejected",
-      () => this.requireParty(by, "recipient", "decline"),
+      () => undefined,
       now,
       () => {
killedBy: decline lets the recipient decline, moving to rejected
statusReason: Cannot read properties of undefined (reading 'isErr')

[Killed] BlockStatement
src/exchange/domain/exchange.ts:124:13
       "rejected",
       () => this.requireParty(by, "recipient", "decline"),
       now,
-      () => {
-        this.record(new ExchangeRejected(this.id, now));
-      },
+      () => {},
     );
   }
killedBy: decline lets the recipient decline, moving to rejected
statusReason: expected [] to deeply equal [ 'ExchangeRejected' ]

[Killed] BlockStatement
src/exchange/domain/exchange.ts:131:64
   }
 
   // Initiator withdraws a proposed or accepted deal.
-  cancel(by: MemberId, now: Date): Result<void, ExchangeError> {
-    return this.guarded(
-      "cancelled",
-      () => this.requireParty(by, "initiator", "cancel"),
-      now,
-      () => {
-        this.record(new ExchangeCancelled(this.id, now));
-      },
-    );
-  }
+  cancel(by: MemberId, now: Date): Result<void, ExchangeError> {}
 
   // Dual confirmation: record the acting party's timestamp; only settle to `completed`
killedBy: cancel lets the initiator cancel a proposed exchange
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] ArrowFunction
src/exchange/domain/exchange.ts:134:7
   cancel(by: MemberId, now: Date): Result<void, ExchangeError> {
     return this.guarded(
       "cancelled",
-      () => this.requireParty(by, "initiator", "cancel"),
+      () => undefined,
       now,
       () => {
killedBy: cancel lets the initiator cancel a proposed exchange
statusReason: Cannot read properties of undefined (reading 'isErr')

[Killed] StringLiteral
src/exchange/domain/exchange.ts:134:35
   cancel(by: MemberId, now: Date): Result<void, ExchangeError> {
     return this.guarded(
       "cancelled",
-      () => this.requireParty(by, "initiator", "cancel"),
+      () => this.requireParty(by, "", "cancel"),
       now,
       () => {
killedBy: cancel lets the initiator cancel a proposed exchange
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/exchange/domain/exchange.ts:136:13
       "cancelled",
       () => this.requireParty(by, "initiator", "cancel"),
       now,
-      () => {
-        this.record(new ExchangeCancelled(this.id, now));
-      },
+      () => {},
     );
   }
killedBy: cancel lets the initiator cancel a proposed exchange
statusReason: expected [] to deeply equal [ 'ExchangeCancelled' ]

[Killed] BlockStatement
src/exchange/domain/exchange.ts:144:75
 
   // Dual confirmation: record the acting party's timestamp; only settle to `completed`
   // once BOTH parties have confirmed. A lone confirmation does not transition status.
-  confirmCompletion(by: MemberId, now: Date): Result<void, ExchangeError> {
-    if (this.status !== "accepted") {
-      return err(ExchangeError.illegalTransition(this.status, "completed"));
-    }
-    const party = this.partyOf(by);
-    if (!party) return err(ExchangeError.wrongParty("confirm completion"));
-
-    this.state = {
-      ...this.state,
-      ...(party === "initiator"
-        ? { initiatorConfirmationTimestamp: now }
-        : { recipientConfirmationTimestamp: now }),
-      updatedAt: now,
-    };
-
-    if (!this.bothConfirmed()) return ok(undefined);
-    return this.settle(now);
-  }
+  confirmCompletion(by: MemberId, now: Date): Result<void, ExchangeError> {}
 
   // Either party flags a problem (from accepted or after completion).
killedBy: cancel cannot cancel a completed exchange
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/exchange/domain/exchange.ts:145:9
   // Dual confirmation: record the acting party's timestamp; only settle to `completed`
   // once BOTH parties have confirmed. A lone confirmation does not transition status.
   confirmCompletion(by: MemberId, now: Date): Result<void, ExchangeError> {
-    if (this.status !== "accepted") {
+    if (true) {
       return err(ExchangeError.illegalTransition(this.status, "completed"));
     }
killedBy: cancel cannot cancel a completed exchange
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/exchange/domain/exchange.ts:145:9
   // Dual confirmation: record the acting party's timestamp; only settle to `completed`
   // once BOTH parties have confirmed. A lone confirmation does not transition status.
   confirmCompletion(by: MemberId, now: Date): Result<void, ExchangeError> {
-    if (this.status !== "accepted") {
+    if (this.status === "accepted") {
       return err(ExchangeError.illegalTransition(this.status, "completed"));
     }
killedBy: cancel cannot cancel a completed exchange
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/exchange/domain/exchange.ts:146:63
   // once BOTH parties have confirmed. A lone confirmation does not transition status.
   confirmCompletion(by: MemberId, now: Date): Result<void, ExchangeError> {
     if (this.status !== "accepted") {
-      return err(ExchangeError.illegalTransition(this.status, "completed"));
+      return err(ExchangeError.illegalTransition(this.status, ""));
     }
     const party = this.partyOf(by);
killedBy: confirmCompletion (dual confirmation) cannot confirm completion from a proposed exchange (illegal transition)
statusReason: expected 'Cannot transition from proposed to ' to be 'Cannot transition from proposed to co…' // Object.is equality

[Killed] ConditionalExpression
src/exchange/domain/exchange.ts:149:9
       return err(ExchangeError.illegalTransition(this.status, "completed"));
     }
     const party = this.partyOf(by);
-    if (!party) return err(ExchangeError.wrongParty("confirm completion"));
+    if (true) return err(ExchangeError.wrongParty("confirm completion"));
 
     this.state = {
killedBy: cancel cannot cancel a completed exchange
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/exchange/domain/exchange.ts:149:9
       return err(ExchangeError.illegalTransition(this.status, "completed"));
     }
     const party = this.partyOf(by);
-    if (!party) return err(ExchangeError.wrongParty("confirm completion"));
+    if (false) return err(ExchangeError.wrongParty("confirm completion"));
 
     this.state = {
killedBy: confirmCompletion (dual confirmation) rejects confirmation by an unrelated member
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/exchange/domain/exchange.ts:153:11
 
     this.state = {
       ...this.state,
-      ...(party === "initiator"
+      ...(party !== "initiator"
         ? { initiatorConfirmationTimestamp: now }
         : { recipientConfirmationTimestamp: now }),
killedBy: confirmCompletion (dual confirmation) a single confirmation does NOT complete the exchange
statusReason: expected undefined to be 2026-06-08T10:00:00.000Z // Object.is equality

[Killed] ConditionalExpression
src/exchange/domain/exchange.ts:153:11
 
     this.state = {
       ...this.state,
-      ...(party === "initiator"
+      ...(false
         ? { initiatorConfirmationTimestamp: now }
         : { recipientConfirmationTimestamp: now }),
killedBy: cancel cannot cancel a completed exchange
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/exchange/domain/exchange.ts:155:11
       ...this.state,
       ...(party === "initiator"
         ? { initiatorConfirmationTimestamp: now }
-        : { recipientConfirmationTimestamp: now }),
+        : {}),
       updatedAt: now,
     };
killedBy: cancel cannot cancel a completed exchange
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/exchange/domain/exchange.ts:159:9
       updatedAt: now,
     };
 
-    if (!this.bothConfirmed()) return ok(undefined);
+    if (false) return ok(undefined);
     return this.settle(now);
   }
killedBy: confirmCompletion (dual confirmation) a single confirmation does NOT complete the exchange
statusReason: expected 'completed' to be 'accepted' // Object.is equality

[Killed] BooleanLiteral
src/exchange/domain/exchange.ts:159:9
       updatedAt: now,
     };
 
-    if (!this.bothConfirmed()) return ok(undefined);
+    if (this.bothConfirmed()) return ok(undefined);
     return this.settle(now);
   }
killedBy: confirmCompletion (dual confirmation) a single confirmation does NOT complete the exchange
statusReason: expected 'completed' to be 'accepted' // Object.is equality

[Killed] BlockStatement
src/exchange/domain/exchange.ts:164:70
   }
 
   // Either party flags a problem (from accepted or after completion).
-  raiseDispute(by: MemberId, now: Date): Result<void, ExchangeError> {
-    if (!this.partyOf(by))
-      return err(ExchangeError.wrongParty("raise a dispute"));
-    return this.guarded(
-      "disputed",
-      () => ok(undefined),
-      now,
-      () => {
-        this.record(new DisputeRaised(this.id, by, now));
-      },
-    );
-  }
+  raiseDispute(by: MemberId, now: Date): Result<void, ExchangeError> {}
 
   // Drain recorded events for the publisher; clears the buffer so a save can't double-emit.
killedBy: raiseDispute either party can dispute an accepted exchange
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] BooleanLiteral
src/exchange/domain/exchange.ts:165:9
 
   // Either party flags a problem (from accepted or after completion).
   raiseDispute(by: MemberId, now: Date): Result<void, ExchangeError> {
-    if (!this.partyOf(by))
+    if (this.partyOf(by))
       return err(ExchangeError.wrongParty("raise a dispute"));
     return this.guarded(
killedBy: raiseDispute either party can dispute an accepted exchange
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/exchange/domain/exchange.ts:165:9
 
   // Either party flags a problem (from accepted or after completion).
   raiseDispute(by: MemberId, now: Date): Result<void, ExchangeError> {
-    if (!this.partyOf(by))
+    if (false)
       return err(ExchangeError.wrongParty("raise a dispute"));
     return this.guarded(
killedBy: raiseDispute rejects a dispute from an unrelated member
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/exchange/domain/exchange.ts:168:7
     if (!this.partyOf(by))
       return err(ExchangeError.wrongParty("raise a dispute"));
     return this.guarded(
-      "disputed",
+      "",
       () => ok(undefined),
       now,
killedBy: raiseDispute either party can dispute an accepted exchange
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/exchange/domain/exchange.ts:169:7
       return err(ExchangeError.wrongParty("raise a dispute"));
     return this.guarded(
       "disputed",
-      () => ok(undefined),
+      () => undefined,
       now,
       () => {
killedBy: raiseDispute either party can dispute an accepted exchange
statusReason: Cannot read properties of undefined (reading 'isErr')

[Killed] BlockStatement
src/exchange/domain/exchange.ts:171:13
       "disputed",
       () => ok(undefined),
       now,
-      () => {
-        this.record(new DisputeRaised(this.id, by, now));
-      },
+      () => {},
     );
   }
killedBy: raiseDispute either party can dispute an accepted exchange
statusReason: expected [] to deeply equal [ 'DisputeRaised' ]

[Killed] BlockStatement
src/exchange/domain/exchange.ts:185:52
   }
 
   // Map to/from persistence without the aggregate knowing about any storage technology.
-  static rehydrate(state: ExchangeState): Exchange {
-    return new Exchange(state);
-  }
+  static rehydrate(state: ExchangeState): Exchange {}
 
   toState(): ExchangeState {
killedBy: settlement events does NOT transfer an offered copy when the kind is not swap, even if one is present
statusReason: Cannot read properties of undefined (reading 'confirmCompletion')

[Killed] BlockStatement
src/exchange/domain/exchange.ts:189:28
     return new Exchange(state);
   }
 
-  toState(): ExchangeState {
-    return this.state;
-  }
+  toState(): ExchangeState {}
 
   // --- internals ---
killedBy: Exchange.propose captures kind-specific terms into state, tagged with the matching kind
statusReason: Cannot read properties of undefined (reading 'kind')

[Killed] BlockStatement
src/exchange/domain/exchange.ts:202:34
     authorise: () => Result<void, ExchangeError>,
     now: Date,
     onTransition: () => void,
-  ): Result<void, ExchangeError> {
-    const auth = authorise();
-    if (auth.isErr) return auth;
-    const moved = this.transition(to, now);
-    if (moved.isErr) return moved;
-    onTransition();
-    return ok(undefined);
-  }
+  ): Result<void, ExchangeError> {}
 
   // The ONLY place status changes. Rejects any move not in ALLOWED_TRANSITIONS.
killedBy: accept lets the recipient accept a proposed exchange
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] ConditionalExpression
src/exchange/domain/exchange.ts:204:9
     onTransition: () => void,
   ): Result<void, ExchangeError> {
     const auth = authorise();
-    if (auth.isErr) return auth;
+    if (true) return auth;
     const moved = this.transition(to, now);
     if (moved.isErr) return moved;
killedBy: accept lets the recipient accept a proposed exchange
statusReason: expected 'proposed' to be 'accepted' // Object.is equality

[Killed] ConditionalExpression
src/exchange/domain/exchange.ts:204:9
     onTransition: () => void,
   ): Result<void, ExchangeError> {
     const auth = authorise();
-    if (auth.isErr) return auth;
+    if (false) return auth;
     const moved = this.transition(to, now);
     if (moved.isErr) return moved;
killedBy: accept rejects acceptance by the initiator (wrong party)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/exchange/domain/exchange.ts:206:9
     const auth = authorise();
     if (auth.isErr) return auth;
     const moved = this.transition(to, now);
-    if (moved.isErr) return moved;
+    if (true) return moved;
     onTransition();
     return ok(undefined);
killedBy: accept lets the recipient accept a proposed exchange
statusReason: expected [] to deeply equal [ 'ExchangeAccepted' ]

[Killed] ConditionalExpression
src/exchange/domain/exchange.ts:206:9
     const auth = authorise();
     if (auth.isErr) return auth;
     const moved = this.transition(to, now);
-    if (moved.isErr) return moved;
+    if (false) return moved;
     onTransition();
     return ok(undefined);
killedBy: accept rejects accept from a non-proposed status (illegal transition)
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/exchange/domain/exchange.ts:215:34
   private transition(
     to: ExchangeStatus,
     now: Date,
-  ): Result<void, ExchangeError> {
-    if (!ALLOWED_TRANSITIONS[this.state.status].includes(to)) {
-      return err(ExchangeError.illegalTransition(this.state.status, to));
-    }
-    this.state = { ...this.state, status: to, updatedAt: now };
-    return ok(undefined);
-  }
+  ): Result<void, ExchangeError> {}
 
   // Settlement: complete, then hand over the requested copy. A swap/sale moves OWNERSHIP; a lend
killedBy: accept lets the recipient accept a proposed exchange
statusReason: Cannot read properties of undefined (reading 'isErr')

[Killed] BooleanLiteral
src/exchange/domain/exchange.ts:216:9
     to: ExchangeStatus,
     now: Date,
   ): Result<void, ExchangeError> {
-    if (!ALLOWED_TRANSITIONS[this.state.status].includes(to)) {
+    if (ALLOWED_TRANSITIONS[this.state.status].includes(to)) {
       return err(ExchangeError.illegalTransition(this.state.status, to));
     }
killedBy: accept lets the recipient accept a proposed exchange
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/exchange/domain/exchange.ts:216:9
     to: ExchangeStatus,
     now: Date,
   ): Result<void, ExchangeError> {
-    if (!ALLOWED_TRANSITIONS[this.state.status].includes(to)) {
+    if (false) {
       return err(ExchangeError.illegalTransition(this.state.status, to));
     }
killedBy: accept rejects accept from a non-proposed status (illegal transition)
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/exchange/domain/exchange.ts:219:18
     if (!ALLOWED_TRANSITIONS[this.state.status].includes(to)) {
       return err(ExchangeError.illegalTransition(this.state.status, to));
     }
-    this.state = { ...this.state, status: to, updatedAt: now };
+    this.state = {};
     return ok(undefined);
   }
killedBy: accept lets the recipient accept a proposed exchange
statusReason: expected undefined to be 'accepted' // Object.is equality

[Killed] ConditionalExpression
src/exchange/domain/exchange.ts:229:9
   // reserved by at most one active exchange" is an APPLICATION-layer rule, not enforced here.)
   private settle(now: Date): Result<void, ExchangeError> {
     const moved = this.transition("completed", now);
-    if (moved.isErr) return moved;
+    if (true) return moved;
     this.record(new ExchangeCompleted(this.id, now));
     if (this.state.kind === "lend") {
killedBy: settlement events a swap transfers BOTH copies: requested→initiator, offered→recipient
statusReason: expected [] to deeply equal [ 'ExchangeCompleted', …(2) ]

[Survived] ConditionalExpression
src/exchange/domain/exchange.ts:229:9
   // reserved by at most one active exchange" is an APPLICATION-layer rule, not enforced here.)
   private settle(now: Date): Result<void, ExchangeError> {
     const moved = this.transition("completed", now);
-    if (moved.isErr) return moved;
+    if (false) return moved;
     this.record(new ExchangeCompleted(this.id, now));
     if (this.state.kind === "lend") {

[Killed] ConditionalExpression
src/exchange/domain/exchange.ts:231:9
     const moved = this.transition("completed", now);
     if (moved.isErr) return moved;
     this.record(new ExchangeCompleted(this.id, now));
-    if (this.state.kind === "lend") {
+    if (false) {
       this.record(
         new PossessionTransferred(
killedBy: settlement events a lend hands POSSESSION (not ownership) of the requested copy to the initiator
statusReason: expected [ OwnershipTransferred{ …(5) } ] to have a length of +0 but got 1

[Killed] ConditionalExpression
src/exchange/domain/exchange.ts:231:9
     const moved = this.transition("completed", now);
     if (moved.isErr) return moved;
     this.record(new ExchangeCompleted(this.id, now));
-    if (this.state.kind === "lend") {
+    if (true) {
       this.record(
         new PossessionTransferred(
killedBy: settlement events a swap transfers BOTH copies: requested→initiator, offered→recipient
statusReason: expected [ 'ExchangeCompleted', …(2) ] to deeply equal [ 'ExchangeCompleted', …(2) ]

[Killed] BlockStatement
src/exchange/domain/exchange.ts:241:12
           now,
         ),
       );
-    } else {
-      this.record(
-        new OwnershipTransferred(
-          this.id,
-          this.state.requestedCopyId,
-          this.state.initiatorId,
-          now,
-        ),
-      );
-    }
+    } else {}
     if (this.state.kind === "swap" && this.state.offeredCopyId) {
       this.record(
killedBy: settlement events a swap transfers BOTH copies: requested→initiator, offered→recipient
statusReason: expected [ 'ExchangeCompleted', …(1) ] to deeply equal [ 'ExchangeCompleted', …(2) ]
