[Killed] ConditionalExpression
src/exchange/domain/exchange.ts:251:9
         ),
       );
     }
-    if (this.state.kind === "swap" && this.state.offeredCopyId) {
+    if (true) {
       this.record(
         new OwnershipTransferred(
killedBy: settlement events a sale transfers ONLY the requested copy to the initiator
statusReason: expected [ OwnershipTransferred{ …(5) }, …(1) ] to have a length of 1 but got 2

[Killed] ConditionalExpression
src/exchange/domain/exchange.ts:251:9
         ),
       );
     }
-    if (this.state.kind === "swap" && this.state.offeredCopyId) {
+    if (true && this.state.offeredCopyId) {
       this.record(
         new OwnershipTransferred(
killedBy: settlement events does NOT transfer an offered copy when the kind is not swap, even if one is present
statusReason: expected [ OwnershipTransferred{ …(5) }, …(1) ] to have a length of 1 but got 2

[Killed] BlockStatement
src/exchange/domain/exchange.ts:264:36
     return ok(undefined);
   }
 
-  private bothConfirmed(): boolean {
-    return (
-      this.state.initiatorConfirmationTimestamp !== undefined &&
-      this.state.recipientConfirmationTimestamp !== undefined
-    );
-  }
+  private bothConfirmed(): boolean {}
 
   private partyOf(member: MemberId): "initiator" | "recipient" | null {
killedBy: cancel cannot cancel a completed exchange
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/exchange/domain/exchange.ts:266:7
 
   private bothConfirmed(): boolean {
     return (
-      this.state.initiatorConfirmationTimestamp !== undefined &&
-      this.state.recipientConfirmationTimestamp !== undefined
+      false
     );
   }
killedBy: cancel cannot cancel a completed exchange
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/exchange/domain/exchange.ts:266:7
 
   private bothConfirmed(): boolean {
     return (
-      this.state.initiatorConfirmationTimestamp !== undefined &&
-      this.state.recipientConfirmationTimestamp !== undefined
+      this.state.initiatorConfirmationTimestamp !== undefined || this.state.recipientConfirmationTimestamp !== undefined
     );
   }
killedBy: confirmCompletion (dual confirmation) a single confirmation does NOT complete the exchange
statusReason: expected 'completed' to be 'accepted' // Object.is equality

[Killed] ConditionalExpression
src/exchange/domain/exchange.ts:267:7
   private bothConfirmed(): boolean {
     return (
       this.state.initiatorConfirmationTimestamp !== undefined &&
-      this.state.recipientConfirmationTimestamp !== undefined
+      true
     );
   }
killedBy: confirmCompletion (dual confirmation) a single confirmation does NOT complete the exchange
statusReason: expected 'completed' to be 'accepted' // Object.is equality

[Killed] EqualityOperator
src/exchange/domain/exchange.ts:267:7
   private bothConfirmed(): boolean {
     return (
       this.state.initiatorConfirmationTimestamp !== undefined &&
-      this.state.recipientConfirmationTimestamp !== undefined
+      this.state.recipientConfirmationTimestamp === undefined
     );
   }
killedBy: confirmCompletion (dual confirmation) a single confirmation does NOT complete the exchange
statusReason: expected 'completed' to be 'accepted' // Object.is equality

[Killed] BlockStatement
src/exchange/domain/exchange.ts:271:71
     );
   }
 
-  private partyOf(member: MemberId): "initiator" | "recipient" | null {
-    if (member === this.state.initiatorId) return "initiator";
-    if (member === this.state.recipientId) return "recipient";
-    return null;
-  }
+  private partyOf(member: MemberId): "initiator" | "recipient" | null {}
 
   private requireParty(
killedBy: cancel cannot cancel a completed exchange
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/exchange/domain/exchange.ts:272:9
   }
 
   private partyOf(member: MemberId): "initiator" | "recipient" | null {
-    if (member === this.state.initiatorId) return "initiator";
+    if (true) return "initiator";
     if (member === this.state.recipientId) return "recipient";
     return null;
killedBy: cancel cannot cancel a completed exchange
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/exchange/domain/exchange.ts:272:9
   }
 
   private partyOf(member: MemberId): "initiator" | "recipient" | null {
-    if (member === this.state.initiatorId) return "initiator";
+    if (false) return "initiator";
     if (member === this.state.recipientId) return "recipient";
     return null;
killedBy: cancel cannot cancel a completed exchange
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/exchange/domain/exchange.ts:273:9
 
   private partyOf(member: MemberId): "initiator" | "recipient" | null {
     if (member === this.state.initiatorId) return "initiator";
-    if (member === this.state.recipientId) return "recipient";
+    if (false) return "recipient";
     return null;
   }
killedBy: cancel cannot cancel a completed exchange
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/exchange/domain/exchange.ts:273:9
 
   private partyOf(member: MemberId): "initiator" | "recipient" | null {
     if (member === this.state.initiatorId) return "initiator";
-    if (member === this.state.recipientId) return "recipient";
+    if (member !== this.state.recipientId) return "recipient";
     return null;
   }
killedBy: cancel cannot cancel a completed exchange
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/exchange/domain/exchange.ts:281:34
     member: MemberId,
     expected: "initiator" | "recipient",
     action: string,
-  ): Result<void, ExchangeError> {
-    const required =
-      expected === "initiator"
-        ? this.state.initiatorId
-        : this.state.recipientId;
-    return member === required
-      ? ok(undefined)
-      : err(ExchangeError.wrongParty(action));
-  }
+  ): Result<void, ExchangeError> {}
 
   private record(event: DomainEvent): void {
killedBy: accept lets the recipient accept a proposed exchange
statusReason: Cannot read properties of undefined (reading 'isErr')

[Killed] EqualityOperator
src/exchange/domain/exchange.ts:283:7
     action: string,
   ): Result<void, ExchangeError> {
     const required =
-      expected === "initiator"
+      expected !== "initiator"
         ? this.state.initiatorId
         : this.state.recipientId;
killedBy: accept lets the recipient accept a proposed exchange
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/exchange/domain/exchange.ts:283:7
     action: string,
   ): Result<void, ExchangeError> {
     const required =
-      expected === "initiator"
+      false
         ? this.state.initiatorId
         : this.state.recipientId;
killedBy: cancel lets the initiator cancel a proposed exchange
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/exchange/domain/exchange.ts:286:12
       expected === "initiator"
         ? this.state.initiatorId
         : this.state.recipientId;
-    return member === required
+    return true
       ? ok(undefined)
       : err(ExchangeError.wrongParty(action));
killedBy: accept rejects acceptance by the initiator (wrong party)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/exchange/domain/exchange.ts:286:12
       expected === "initiator"
         ? this.state.initiatorId
         : this.state.recipientId;
-    return member === required
+    return false
       ? ok(undefined)
       : err(ExchangeError.wrongParty(action));
killedBy: accept lets the recipient accept a proposed exchange
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/exchange/domain/exchange.ts:298:20
   private static stateFromTerms(
     props: ProposeProps,
     terms: ExchangeTerms,
-  ): ExchangeState {
-    const base: Omit<
-      ExchangeState,
-      "kind" | "offeredCopyId" | "price" | "returnDate"
-    > = {
-      id: props.id,
-      initiatorId: props.initiator,
-      recipientId: props.recipient,
-      requestedCopyId: props.requestedCopyId,
-      status: "proposed",
-      createdAt: props.now,
-      updatedAt: props.now,
-    };
-    switch (terms.kind) {
-      case "swap":
-        return { ...base, kind: "swap", offeredCopyId: terms.offeredCopyId };
-      case "sale":
-        return { ...base, kind: "sale", price: terms.price };
-      case "lend":
-        return { ...base, kind: "lend", returnDate: terms.returnDate };
-    }
-  }
+  ): ExchangeState {}
 }
 
killedBy: Exchange.propose starts proposed and records ExchangeProposed carrying parties and kind
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
src/exchange/domain/exchange.ts:312:7
       updatedAt: props.now,
     };
     switch (terms.kind) {
-      case "swap":
-        return { ...base, kind: "swap", offeredCopyId: terms.offeredCopyId };
+      case "swap":
       case "sale":
         return { ...base, kind: "sale", price: terms.price };
killedBy: Exchange.propose starts proposed and records ExchangeProposed carrying parties and kind
statusReason: expected 'sale' to be 'swap' // Object.is equality

[Killed] ConditionalExpression
src/exchange/domain/exchange.ts:314:7
     switch (terms.kind) {
       case "swap":
         return { ...base, kind: "swap", offeredCopyId: terms.offeredCopyId };
-      case "sale":
-        return { ...base, kind: "sale", price: terms.price };
+      case "sale":
       case "lend":
         return { ...base, kind: "lend", returnDate: terms.returnDate };
killedBy: Exchange.propose captures kind-specific terms into state, tagged with the matching kind
statusReason: expected 'lend' to be 'sale' // Object.is equality

[Killed] StringLiteral
src/exchange/domain/exchange.ts:314:12
     switch (terms.kind) {
       case "swap":
         return { ...base, kind: "swap", offeredCopyId: terms.offeredCopyId };
-      case "sale":
+      case "":
         return { ...base, kind: "sale", price: terms.price };
       case "lend":
killedBy: Exchange.propose captures kind-specific terms into state, tagged with the matching kind
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
src/exchange/domain/exchange.ts:316:7
         return { ...base, kind: "swap", offeredCopyId: terms.offeredCopyId };
       case "sale":
         return { ...base, kind: "sale", price: terms.price };
-      case "lend":
-        return { ...base, kind: "lend", returnDate: terms.returnDate };
+      case "lend":
     }
   }
killedBy: Exchange.propose captures kind-specific terms into state, tagged with the matching kind
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] StringLiteral
src/exchange/domain/exchange.ts:316:12
         return { ...base, kind: "swap", offeredCopyId: terms.offeredCopyId };
       case "sale":
         return { ...base, kind: "sale", price: terms.price };
-      case "lend":
+      case "":
         return { ...base, kind: "lend", returnDate: terms.returnDate };
     }
killedBy: Exchange.propose captures kind-specific terms into state, tagged with the matching kind
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ObjectLiteral
src/exchange/domain/exchange.ts:317:16
       case "sale":
         return { ...base, kind: "sale", price: terms.price };
       case "lend":
-        return { ...base, kind: "lend", returnDate: terms.returnDate };
+        return {};
     }
   }
killedBy: Exchange.propose captures kind-specific terms into state, tagged with the matching kind
statusReason: expected undefined to be 'lend' // Object.is equality
