[Killed] BlockStatement
identity/application/use-cases/register-member.ts:31:50
   (deps: RegisterMemberDeps): RegisterMember =>
   async (
     cmd: RegisterMemberCommand,
-  ): Promise<Result<MemberId, IdentityError>> => {
-    const existing = await deps.members.findByClerkId(cmd.clerkId);
-    if (existing) return ok(existing.id);
-
-    const member = Member.register({
-      id: deps.memberIds.next(),
-      clerkId: cmd.clerkId,
-      email: cmd.email,
-      name: cmd.name,
-      username: cmd.username,
-      avatar: cmd.avatar,
-      bio: cmd.bio,
-      location: cmd.location,
-      preferredLanguage: cmd.preferredLanguage,
-      now: deps.clock.now(),
-    });
-    if (member.isErr) return err(member.error);
-
-    await deps.members.save(member.value);
-    await deps.events.publish(member.value.pullEvents());
-
-    return ok(member.value.id);
-  };
+  ): Promise<Result<MemberId, IdentityError>> => {};
 
killedBy: makeRegisterMember registers a new member, persists it, and publishes MemberRegistered
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] ConditionalExpression
identity/application/use-cases/register-member.ts:33:9
     cmd: RegisterMemberCommand,
   ): Promise<Result<MemberId, IdentityError>> => {
     const existing = await deps.members.findByClerkId(cmd.clerkId);
-    if (existing) return ok(existing.id);
+    if (true) return ok(existing.id);
 
     const member = Member.register({
killedBy: makeRegisterMember registers a new member, persists it, and publishes MemberRegistered
statusReason: Cannot read properties of null (reading 'id')

[Killed] ConditionalExpression
identity/application/use-cases/register-member.ts:33:9
     cmd: RegisterMemberCommand,
   ): Promise<Result<MemberId, IdentityError>> => {
     const existing = await deps.members.findByClerkId(cmd.clerkId);
-    if (existing) return ok(existing.id);
+    if (false) return ok(existing.id);
 
     const member = Member.register({
killedBy: makeRegisterMember is idempotent per clerkId: returns the existing id and writes nothing new
statusReason: expected 'member-2' to be 'member-1' // Object.is equality

[Killed] ObjectLiteral
identity/application/use-cases/register-member.ts:35:36
     const existing = await deps.members.findByClerkId(cmd.clerkId);
     if (existing) return ok(existing.id);
 
-    const member = Member.register({
-      id: deps.memberIds.next(),
-      clerkId: cmd.clerkId,
-      email: cmd.email,
-      name: cmd.name,
-      username: cmd.username,
-      avatar: cmd.avatar,
-      bio: cmd.bio,
-      location: cmd.location,
-      preferredLanguage: cmd.preferredLanguage,
-      now: deps.clock.now(),
-    });
+    const member = Member.register({});
     if (member.isErr) return err(member.error);
 
killedBy: makeRegisterMember registers a new member, persists it, and publishes MemberRegistered
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] ConditionalExpression
identity/application/use-cases/register-member.ts:47:9
       preferredLanguage: cmd.preferredLanguage,
       now: deps.clock.now(),
     });
-    if (member.isErr) return err(member.error);
+    if (true) return err(member.error);
 
     await deps.members.save(member.value);
killedBy: makeRegisterMember registers a new member, persists it, and publishes MemberRegistered
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
identity/application/use-cases/register-member.ts:47:9
       preferredLanguage: cmd.preferredLanguage,
       now: deps.clock.now(),
     });
-    if (member.isErr) return err(member.error);
+    if (false) return err(member.error);
 
     await deps.members.save(member.value);
killedBy: makeRegisterMember rejects an invalid email without writing
statusReason: Cannot read properties of undefined (reading 'id')
