[Killed] ArrowFunction
identity/application/use-cases/revoke-role.ts:23:3
 // (MemberNotFound if absent), then withdraw. The aggregate audits the withdrawal via RoleRevoked
 // only when the role was actually held, so revoking an unheld role publishes nothing.
 export const makeRevokeRole =
-  (deps: RevokeRoleDeps): RevokeRole =>
-  async (
-    cmd: RevokeRoleCommand,
-  ): Promise<Result<void, IdentityError | IdentityApplicationError>> => {
-    const role = createRole(cmd.role);
-    if (role.isErr) return err(role.error);
-
-    const member = await deps.members.findById(cmd.memberId);
-    if (!member)
-      return err(IdentityApplicationError.memberNotFound(cmd.memberId));
-
-    member.revokeRole(role.value, deps.clock.now());
-
-    await deps.members.save(member);
-    await deps.events.publish(member.pullEvents());
-
-    return ok(undefined);
-  };
+  () => undefined;
 
killedBy: makeRevokeRole withdraws a held role and publishes RoleRevoked
statusReason: revoke is not a function

[Killed] BlockStatement
identity/application/use-cases/revoke-role.ts:26:73
   (deps: RevokeRoleDeps): RevokeRole =>
   async (
     cmd: RevokeRoleCommand,
-  ): Promise<Result<void, IdentityError | IdentityApplicationError>> => {
-    const role = createRole(cmd.role);
-    if (role.isErr) return err(role.error);
-
-    const member = await deps.members.findById(cmd.memberId);
-    if (!member)
-      return err(IdentityApplicationError.memberNotFound(cmd.memberId));
-
-    member.revokeRole(role.value, deps.clock.now());
-
-    await deps.members.save(member);
-    await deps.events.publish(member.pullEvents());
-
-    return ok(undefined);
-  };
+  ): Promise<Result<void, IdentityError | IdentityApplicationError>> => {};
 
killedBy: makeRevokeRole withdraws a held role and publishes RoleRevoked
statusReason: Cannot read properties of undefined (reading 'isOk')
