[Killed] ArrowFunction
identity/application/use-cases/update-profile.ts:19:3
 // edit, delegating username validation to the aggregate. Profile edits are not audited, so there
 // is nothing to publish.
 export const makeUpdateProfile =
-  (deps: UpdateProfileDeps): UpdateProfile =>
-  async (
-    cmd: UpdateProfileCommand,
-  ): Promise<Result<void, IdentityError | IdentityApplicationError>> => {
-    const member = await deps.members.findById(cmd.memberId);
-    if (!member)
-      return err(IdentityApplicationError.memberNotFound(cmd.memberId));
-
-    const updated = member.updateProfile(
-      {
-        name: cmd.name,
-        username: cmd.username,
-        avatar: cmd.avatar,
-        bio: cmd.bio,
-        location: cmd.location,
-        preferredLanguage: cmd.preferredLanguage,
-      },
-      deps.clock.now(),
-    );
-    if (updated.isErr) return err(updated.error);
-
-    await deps.members.save(member);
-    return ok(undefined);
-  };
+  () => undefined;
 
killedBy: makeUpdateProfile applies the edit and persists it
statusReason: update is not a function

[Killed] BlockStatement
identity/application/use-cases/update-profile.ts:22:73
   (deps: UpdateProfileDeps): UpdateProfile =>
   async (
     cmd: UpdateProfileCommand,
-  ): Promise<Result<void, IdentityError | IdentityApplicationError>> => {
-    const member = await deps.members.findById(cmd.memberId);
-    if (!member)
-      return err(IdentityApplicationError.memberNotFound(cmd.memberId));
-
-    const updated = member.updateProfile(
-      {
-        name: cmd.name,
-        username: cmd.username,
-        avatar: cmd.avatar,
-        bio: cmd.bio,
-        location: cmd.location,
-        preferredLanguage: cmd.preferredLanguage,
-      },
-      deps.clock.now(),
-    );
-    if (updated.isErr) return err(updated.error);
-
-    await deps.members.save(member);
-    return ok(undefined);
-  };
+  ): Promise<Result<void, IdentityError | IdentityApplicationError>> => {};
 
killedBy: makeUpdateProfile applies the edit and persists it
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] ConditionalExpression
identity/application/use-cases/update-profile.ts:38:9
       },
       deps.clock.now(),
     );
-    if (updated.isErr) return err(updated.error);
+    if (true) return err(updated.error);
 
     await deps.members.save(member);
killedBy: makeUpdateProfile applies the edit and persists it
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
identity/application/use-cases/update-profile.ts:38:9
       },
       deps.clock.now(),
     );
-    if (updated.isErr) return err(updated.error);
+    if (false) return err(updated.error);
 
     await deps.members.save(member);
killedBy: makeUpdateProfile fails with InvalidUsername for a malformed handle
statusReason: expected false to be true // Object.is equality
