[Killed] Regex
src/identity/domain/email-address.ts:7:23
 // A pragmatic single-line email pattern: a non-empty local part, an "@", and a domain with at
 // least one dot. We deliberately do not chase RFC 5322 completeness — Clerk is the source of
 // truth for verification; this VO only rejects obviously malformed values at our boundary.
-const EMAIL_PATTERN = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+const EMAIL_PATTERN = /^[^\s@]+@[\s@]+\.[^\s@]+$/;
 
 // An email address as an immutable value object validated at construction. Stored normalised
killedBy: makeRevokeRole withdraws a held role and publishes RoleRevoked
statusReason: setup

[Killed] Regex
src/identity/domain/email-address.ts:7:23
 // A pragmatic single-line email pattern: a non-empty local part, an "@", and a domain with at
 // least one dot. We deliberately do not chase RFC 5322 completeness — Clerk is the source of
 // truth for verification; this VO only rejects obviously malformed values at our boundary.
-const EMAIL_PATTERN = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+const EMAIL_PATTERN = /^[^\s@]+@[^\s@]+\.[^\s@]+/;
 
 // An email address as an immutable value object validated at construction. Stored normalised
killedBy: EmailAddress rejects the malformed address alice@example.com
evil@b.co
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/identity/domain/email-address.ts:14:69
 export class EmailAddress {
   private constructor(readonly value: string) {}
 
-  static create(value: string): Result<EmailAddress, IdentityError> {
-    const normalised = value.trim().toLowerCase();
-    if (!EMAIL_PATTERN.test(normalised)) {
-      return err(IdentityError.invalidEmail(value));
-    }
-    return ok(new EmailAddress(normalised));
-  }
+  static create(value: string): Result<EmailAddress, IdentityError> {}
 }
 
killedBy: Member.register mints an active, role-less member and records MemberRegistered
statusReason: Cannot read properties of undefined (reading 'isErr')

[Killed] MethodExpression
src/identity/domain/email-address.ts:15:24
   private constructor(readonly value: string) {}
 
   static create(value: string): Result<EmailAddress, IdentityError> {
-    const normalised = value.trim().toLowerCase();
+    const normalised = value.trim().toUpperCase();
     if (!EMAIL_PATTERN.test(normalised)) {
       return err(IdentityError.invalidEmail(value));
killedBy: Member.register mints an active, role-less member and records MemberRegistered
statusReason: expected 'ALICE@EXAMPLE.COM' to be 'alice@example.com' // Object.is equality

[Killed] MethodExpression
src/identity/domain/email-address.ts:15:24
   private constructor(readonly value: string) {}
 
   static create(value: string): Result<EmailAddress, IdentityError> {
-    const normalised = value.trim().toLowerCase();
+    const normalised = value.toLowerCase();
     if (!EMAIL_PATTERN.test(normalised)) {
       return err(IdentityError.invalidEmail(value));
killedBy: EmailAddress normalises by trimming and lower-casing
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/identity/domain/email-address.ts:16:9
 
   static create(value: string): Result<EmailAddress, IdentityError> {
     const normalised = value.trim().toLowerCase();
-    if (!EMAIL_PATTERN.test(normalised)) {
+    if (false) {
       return err(IdentityError.invalidEmail(value));
     }
killedBy: Member.register validates the email through the EmailAddress VO
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/identity/domain/email-address.ts:16:42
 
   static create(value: string): Result<EmailAddress, IdentityError> {
     const normalised = value.trim().toLowerCase();
-    if (!EMAIL_PATTERN.test(normalised)) {
-      return err(IdentityError.invalidEmail(value));
-    }
+    if (!EMAIL_PATTERN.test(normalised)) {}
     return ok(new EmailAddress(normalised));
   }
killedBy: makeRegisterMember rejects an invalid email without writing
statusReason: expected false to be true // Object.is equality
