[Killed] BlockStatement
src/identity/domain/member.ts:68:22
 
   private constructor(private state: MemberState) {}
 
-  get id(): MemberId {
-    return this.state.id;
-  }
+  get id(): MemberId {}
 
   get clerkId(): string {
killedBy: Member persistence round-trips through toState/rehydrate without re-emitting events
statusReason: expected undefined to be 'member-1' // Object.is equality

[Killed] BlockStatement
src/identity/domain/member.ts:72:25
     return this.state.id;
   }
 
-  get clerkId(): string {
-    return this.state.clerkId;
-  }
+  get clerkId(): string {}
 
   get isActive(): boolean {
killedBy: Member persistence round-trips through toState/rehydrate without re-emitting events
statusReason: expected undefined to be 'clerk_abc' // Object.is equality

[Killed] BlockStatement
src/identity/domain/member.ts:80:34
     return this.state.isActive;
   }
 
-  get roles(): ReadonlySet<Role> {
-    return this.state.roles;
-  }
+  get roles(): ReadonlySet<Role> {}
 
   hasRole(role: Role): boolean {
killedBy: Member.register mints an active, role-less member and records MemberRegistered
statusReason: Cannot read properties of undefined (reading 'size')

[Killed] BlockStatement
src/identity/domain/member.ts:84:32
     return this.state.roles;
   }
 
-  hasRole(role: Role): boolean {
-    return this.state.roles.has(role);
-  }
+  hasRole(role: Role): boolean {}
 
   // Mint a brand-new Member for a Clerk subject. Validates the email (and username if given)
killedBy: Member roles assigns a role and audits it with RoleAssigned
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/identity/domain/member.ts:92:9
   // into VOs and records MemberRegistered. The member starts active with no elevated roles.
   static register(props: RegisterProps): Result<Member, IdentityError> {
     const email = EmailAddress.create(props.email);
-    if (email.isErr) return err(email.error);
+    if (false) return err(email.error);
 
     const username = Member.parseUsername(props.username);
killedBy: Member.register validates the email through the EmailAddress VO
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] ConditionalExpression
src/identity/domain/member.ts:92:9
   // into VOs and records MemberRegistered. The member starts active with no elevated roles.
   static register(props: RegisterProps): Result<Member, IdentityError> {
     const email = EmailAddress.create(props.email);
-    if (email.isErr) return err(email.error);
+    if (true) return err(email.error);
 
     const username = Member.parseUsername(props.username);
killedBy: makeUpdateProfile applies the edit and persists it
statusReason: setup

[Killed] ConditionalExpression
src/identity/domain/member.ts:95:9
     if (email.isErr) return err(email.error);
 
     const username = Member.parseUsername(props.username);
-    if (username.isErr) return err(username.error);
+    if (true) return err(username.error);
 
     const member = new Member({
killedBy: Member.register mints an active, role-less member and records MemberRegistered
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/identity/domain/member.ts:95:9
     if (email.isErr) return err(email.error);
 
     const username = Member.parseUsername(props.username);
-    if (username.isErr) return err(username.error);
+    if (false) return err(username.error);
 
     const member = new Member({
killedBy: makeRegisterMember rejects an invalid username without writing
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/identity/domain/member.ts:108:17
       location: props.location,
       preferredLanguage: props.preferredLanguage,
       roles: new Set<Role>(),
-      isActive: true,
+      isActive: false,
       createdAt: props.now,
       updatedAt: props.now,
killedBy: Member.register mints an active, role-less member and records MemberRegistered
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/identity/domain/member.ts:126:80
   // Edit the mutable profile fields. clerkId/email are intentionally not editable here; only the
   // supplied fields change. Validates a new username into a VO. No event: profile edits are not
   // audited (unlike role/lifecycle changes).
-  updateProfile(update: ProfileUpdate, now: Date): Result<void, IdentityError> {
-    const username =
-      update.username === undefined
-        ? ok(this.state.username)
-        : Member.parseUsername(update.username);
-    if (username.isErr) return err(username.error);
-
-    this.state = {
-      ...this.state,
-      name: update.name ?? this.state.name,
-      username: username.value,
-      avatar: update.avatar ?? this.state.avatar,
-      bio: update.bio ?? this.state.bio,
-      location: update.location ?? this.state.location,
-      preferredLanguage:
-        update.preferredLanguage ?? this.state.preferredLanguage,
-      updatedAt: now,
-    };
-    return ok(undefined);
-  }
+  updateProfile(update: ProfileUpdate, now: Date): Result<void, IdentityError> {}
 
   // Guard the immutability of clerkId. A Clerk-webhook sync re-asserts the subject it owns; a
killedBy: Member.updateProfile edits only the supplied fields and validates a new username
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] ConditionalExpression
src/identity/domain/member.ts:128:7
   // audited (unlike role/lifecycle changes).
   updateProfile(update: ProfileUpdate, now: Date): Result<void, IdentityError> {
     const username =
-      update.username === undefined
+      false
         ? ok(this.state.username)
         : Member.parseUsername(update.username);
killedBy: Member.updateProfile edits only the supplied fields and validates a new username
statusReason: expected undefined to be 'alice' // Object.is equality

[Killed] ConditionalExpression
src/identity/domain/member.ts:128:7
   // audited (unlike role/lifecycle changes).
   updateProfile(update: ProfileUpdate, now: Date): Result<void, IdentityError> {
     const username =
-      update.username === undefined
+      true
         ? ok(this.state.username)
         : Member.parseUsername(update.username);
killedBy: Member.updateProfile clears the username when edited to an empty string
statusReason: expected Username{ value: 'alice' } to be undefined

[Killed] ConditionalExpression
src/identity/domain/member.ts:131:9
       update.username === undefined
         ? ok(this.state.username)
         : Member.parseUsername(update.username);
-    if (username.isErr) return err(username.error);
+    if (true) return err(username.error);
 
     this.state = {
killedBy: Member.updateProfile edits only the supplied fields and validates a new username
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/identity/domain/member.ts:131:9
       update.username === undefined
         ? ok(this.state.username)
         : Member.parseUsername(update.username);
-    if (username.isErr) return err(username.error);
+    if (false) return err(username.error);
 
     this.state = {
killedBy: Member.updateProfile rejects an invalid new username
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/identity/domain/member.ts:135:13
 
     this.state = {
       ...this.state,
-      name: update.name ?? this.state.name,
+      name: update.name && this.state.name,
       username: username.value,
       avatar: update.avatar ?? this.state.avatar,
killedBy: Member.updateProfile edits only the supplied fields and validates a new username
statusReason: expected undefined to be 'Alice' // Object.is equality

[Killed] LogicalOperator
src/identity/domain/member.ts:137:15
       ...this.state,
       name: update.name ?? this.state.name,
       username: username.value,
-      avatar: update.avatar ?? this.state.avatar,
+      avatar: update.avatar && this.state.avatar,
       bio: update.bio ?? this.state.bio,
       location: update.location ?? this.state.location,
killedBy: Member.updateProfile sets avatar and preferred language when supplied
statusReason: expected undefined to be 'https://img/x.png' // Object.is equality

[Killed] LogicalOperator
src/identity/domain/member.ts:138:12
       name: update.name ?? this.state.name,
       username: username.value,
       avatar: update.avatar ?? this.state.avatar,
-      bio: update.bio ?? this.state.bio,
+      bio: update.bio && this.state.bio,
       location: update.location ?? this.state.location,
       preferredLanguage:
killedBy: Member.updateProfile edits only the supplied fields and validates a new username
statusReason: expected undefined to be 'Puzzler' // Object.is equality

[Killed] LogicalOperator
src/identity/domain/member.ts:139:17
       username: username.value,
       avatar: update.avatar ?? this.state.avatar,
       bio: update.bio ?? this.state.bio,
-      location: update.location ?? this.state.location,
+      location: update.location && this.state.location,
       preferredLanguage:
         update.preferredLanguage ?? this.state.preferredLanguage,
killedBy: Member.updateProfile edits only the supplied fields and validates a new username
statusReason: expected undefined to be 'NL' // Object.is equality

[Killed] LogicalOperator
src/identity/domain/member.ts:141:9
       bio: update.bio ?? this.state.bio,
       location: update.location ?? this.state.location,
       preferredLanguage:
-        update.preferredLanguage ?? this.state.preferredLanguage,
+        update.preferredLanguage && this.state.preferredLanguage,
       updatedAt: now,
     };
killedBy: Member.updateProfile sets avatar and preferred language when supplied
statusReason: expected undefined to be 'nl' // Object.is equality

[Killed] BlockStatement
src/identity/domain/member.ts:150:63
   // Guard the immutability of clerkId. A Clerk-webhook sync re-asserts the subject it owns; a
   // matching value is a no-op, but a mismatch means the wrong Member was loaded for that subject
   // and is rejected with ClerkIdImmutable rather than silently rebinding the identity.
-  ensureClerkId(clerkId: string): Result<void, IdentityError> {
-    if (clerkId !== this.state.clerkId) {
-      return err(IdentityError.clerkIdImmutable());
-    }
-    return ok(undefined);
-  }
+  ensureClerkId(clerkId: string): Result<void, IdentityError> {}
 
   // Deactivate the account. Idempotent: MemberDeactivated is emitted only on the active →
killedBy: Member clerkId immutability accepts a re-asserted matching clerkId
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] EqualityOperator
src/identity/domain/member.ts:151:9
   // matching value is a no-op, but a mismatch means the wrong Member was loaded for that subject
   // and is rejected with ClerkIdImmutable rather than silently rebinding the identity.
   ensureClerkId(clerkId: string): Result<void, IdentityError> {
-    if (clerkId !== this.state.clerkId) {
+    if (clerkId === this.state.clerkId) {
       return err(IdentityError.clerkIdImmutable());
     }
killedBy: Member clerkId immutability accepts a re-asserted matching clerkId
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/identity/domain/member.ts:151:9
   // matching value is a no-op, but a mismatch means the wrong Member was loaded for that subject
   // and is rejected with ClerkIdImmutable rather than silently rebinding the identity.
   ensureClerkId(clerkId: string): Result<void, IdentityError> {
-    if (clerkId !== this.state.clerkId) {
+    if (false) {
       return err(IdentityError.clerkIdImmutable());
     }
killedBy: Member clerkId immutability rejects a mismatched clerkId with ClerkIdImmutable
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/identity/domain/member.ts:159:31
 
   // Deactivate the account. Idempotent: MemberDeactivated is emitted only on the active →
   // inactive transition, so re-deactivating an already-inactive member is a silent no-op.
-  deactivate(now: Date): void {
-    if (!this.state.isActive) return;
-    this.state = { ...this.state, isActive: false, updatedAt: now };
-    this.record(new MemberDeactivated(this.id, now));
-  }
+  deactivate(now: Date): void {}
 
   // Grant an elevated role. Audited via RoleAssigned, emitted only when the role is newly added
killedBy: Member.deactivate emits MemberDeactivated once on the active -> inactive transition
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/identity/domain/member.ts:160:9
   // Deactivate the account. Idempotent: MemberDeactivated is emitted only on the active →
   // inactive transition, so re-deactivating an already-inactive member is a silent no-op.
   deactivate(now: Date): void {
-    if (!this.state.isActive) return;
+    if (true) return;
     this.state = { ...this.state, isActive: false, updatedAt: now };
     this.record(new MemberDeactivated(this.id, now));
killedBy: Member.deactivate emits MemberDeactivated once on the active -> inactive transition
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/identity/domain/member.ts:160:9
   // Deactivate the account. Idempotent: MemberDeactivated is emitted only on the active →
   // inactive transition, so re-deactivating an already-inactive member is a silent no-op.
   deactivate(now: Date): void {
-    if (!this.state.isActive) return;
+    if (this.state.isActive) return;
     this.state = { ...this.state, isActive: false, updatedAt: now };
     this.record(new MemberDeactivated(this.id, now));
killedBy: Member.deactivate emits MemberDeactivated once on the active -> inactive transition
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/identity/domain/member.ts:161:45
   // inactive transition, so re-deactivating an already-inactive member is a silent no-op.
   deactivate(now: Date): void {
     if (!this.state.isActive) return;
-    this.state = { ...this.state, isActive: false, updatedAt: now };
+    this.state = { ...this.state, isActive: true, updatedAt: now };
     this.record(new MemberDeactivated(this.id, now));
   }
killedBy: Member.deactivate emits MemberDeactivated once on the active -> inactive transition
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/identity/domain/member.ts:167:43
 
   // Grant an elevated role. Audited via RoleAssigned, emitted only when the role is newly added
   // (assigning a role the member already holds is a silent no-op).
-  assignRole(role: Role, now: Date): void {
-    if (this.state.roles.has(role)) return;
-    const roles = new Set(this.state.roles);
-    roles.add(role);
-    this.state = { ...this.state, roles, updatedAt: now };
-    this.record(new RoleAssigned(this.id, role, now));
-  }
+  assignRole(role: Role, now: Date): void {}
 
   // Withdraw an elevated role. Audited via RoleRevoked, emitted only when the role was actually
killedBy: Member roles assigns a role and audits it with RoleAssigned
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/identity/domain/member.ts:168:9
   // Grant an elevated role. Audited via RoleAssigned, emitted only when the role is newly added
   // (assigning a role the member already holds is a silent no-op).
   assignRole(role: Role, now: Date): void {
-    if (this.state.roles.has(role)) return;
+    if (true) return;
     const roles = new Set(this.state.roles);
     roles.add(role);
killedBy: Member roles assigns a role and audits it with RoleAssigned
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/identity/domain/member.ts:168:9
   // Grant an elevated role. Audited via RoleAssigned, emitted only when the role is newly added
   // (assigning a role the member already holds is a silent no-op).
   assignRole(role: Role, now: Date): void {
-    if (this.state.roles.has(role)) return;
+    if (false) return;
     const roles = new Set(this.state.roles);
     roles.add(role);
killedBy: Member roles is idempotent on re-assigning a held role
statusReason: expected [ RoleAssigned{ …(4) } ] to have a length of +0 but got 1

[Killed] ObjectLiteral
src/identity/domain/member.ts:171:18
     if (this.state.roles.has(role)) return;
     const roles = new Set(this.state.roles);
     roles.add(role);
-    this.state = { ...this.state, roles, updatedAt: now };
+    this.state = {};
     this.record(new RoleAssigned(this.id, role, now));
   }
killedBy: Member roles assigns a role and audits it with RoleAssigned
statusReason: Cannot read properties of undefined (reading 'has')

[Killed] BlockStatement
src/identity/domain/member.ts:177:43
 
   // Withdraw an elevated role. Audited via RoleRevoked, emitted only when the role was actually
   // held (revoking a role the member lacks is a silent no-op).
-  revokeRole(role: Role, now: Date): void {
-    if (!this.state.roles.has(role)) return;
-    const roles = new Set(this.state.roles);
-    roles.delete(role);
-    this.state = { ...this.state, roles, updatedAt: now };
-    this.record(new RoleRevoked(this.id, role, now));
-  }
+  revokeRole(role: Role, now: Date): void {}
 
   // Drain recorded events for the publisher; clears the buffer so a save can't double-emit.
killedBy: Member roles revokes a held role and audits it with RoleRevoked
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/identity/domain/member.ts:178:9
   // Withdraw an elevated role. Audited via RoleRevoked, emitted only when the role was actually
   // held (revoking a role the member lacks is a silent no-op).
   revokeRole(role: Role, now: Date): void {
-    if (!this.state.roles.has(role)) return;
+    if (this.state.roles.has(role)) return;
     const roles = new Set(this.state.roles);
     roles.delete(role);
killedBy: Member roles revokes a held role and audits it with RoleRevoked
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/identity/domain/member.ts:178:9
   // Withdraw an elevated role. Audited via RoleRevoked, emitted only when the role was actually
   // held (revoking a role the member lacks is a silent no-op).
   revokeRole(role: Role, now: Date): void {
-    if (!this.state.roles.has(role)) return;
+    if (false) return;
     const roles = new Set(this.state.roles);
     roles.delete(role);
killedBy: Member roles is a no-op when revoking a role the member never held
statusReason: expected [ RoleRevoked{ …(4) } ] to have a length of +0 but got 1

[Killed] BlockStatement
src/identity/domain/member.ts:193:48
   }
 
   // Map to/from persistence without the aggregate knowing about any storage technology.
-  static rehydrate(state: MemberState): Member {
-    return new Member(state);
-  }
+  static rehydrate(state: MemberState): Member {}
 
   toState(): MemberState {
killedBy: Member persistence round-trips through toState/rehydrate without re-emitting events
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] BlockStatement
src/identity/domain/member.ts:197:26
     return new Member(state);
   }
 
-  toState(): MemberState {
-    return this.state;
-  }
+  toState(): MemberState {}
 
   private record(event: DomainEvent): void {
killedBy: Member.register validates a supplied username and treats an empty one as absent
statusReason: Cannot read properties of undefined (reading 'username')

[Killed] BlockStatement
src/identity/domain/member.ts:208:50
   // Optional handles collapse "" / undefined to "no username"; any present value is validated.
   private static parseUsername(
     value: string | undefined,
-  ): Result<Username | undefined, IdentityError> {
-    if (value === undefined || value === "") return ok(undefined);
-    return Username.create(value);
-  }
+  ): Result<Username | undefined, IdentityError> {}
 }
 
killedBy: makeRegisterMember registers a new member, persists it, and publishes MemberRegistered
statusReason: Cannot read properties of undefined (reading 'isErr')

[Killed] EqualityOperator
src/identity/domain/member.ts:209:32
   private static parseUsername(
     value: string | undefined,
   ): Result<Username | undefined, IdentityError> {
-    if (value === undefined || value === "") return ok(undefined);
+    if (value === undefined || value !== "") return ok(undefined);
     return Username.create(value);
   }
killedBy: makeRegisterMember rejects an invalid username without writing
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/identity/domain/member.ts:209:32
   private static parseUsername(
     value: string | undefined,
   ): Result<Username | undefined, IdentityError> {
-    if (value === undefined || value === "") return ok(undefined);
+    if (value === undefined || false) return ok(undefined);
     return Username.create(value);
   }
killedBy: Member.register validates a supplied username and treats an empty one as absent
statusReason: expected false to be true // Object.is equality
