[Killed] BlockStatement
src/identity/domain/role.ts:12:75
 export type Role = (typeof ROLES)[number];
 
 // Validate an untrusted string (e.g. from a Clerk claim or an admin command) into a Role.
-export const createRole = (value: string): Result<Role, IdentityError> => {
-  if ((ROLES as readonly string[]).includes(value)) {
-    return ok(value as Role);
-  }
-  return err(IdentityError.invalidRole(value));
-};
+export const createRole = (value: string): Result<Role, IdentityError> => {};
 
 export const isRole = (value: string): value is Role =>
killedBy: makeRevokeRole withdraws a held role and publishes RoleRevoked
statusReason: Cannot read properties of undefined (reading 'isErr')

[Killed] ConditionalExpression
src/identity/domain/role.ts:13:7
 
 // Validate an untrusted string (e.g. from a Clerk claim or an admin command) into a Role.
 export const createRole = (value: string): Result<Role, IdentityError> => {
-  if ((ROLES as readonly string[]).includes(value)) {
+  if (false) {
     return ok(value as Role);
   }
killedBy: makeRevokeRole withdraws a held role and publishes RoleRevoked
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/identity/domain/role.ts:13:7
 
 // Validate an untrusted string (e.g. from a Clerk claim or an admin command) into a Role.
 export const createRole = (value: string): Result<Role, IdentityError> => {
-  if ((ROLES as readonly string[]).includes(value)) {
+  if (true) {
     return ok(value as Role);
   }
killedBy: makeRevokeRole fails with InvalidRole for an unknown role
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/identity/domain/role.ts:19:23
   return err(IdentityError.invalidRole(value));
 };
 
-export const isRole = (value: string): value is Role =>
-  (ROLES as readonly string[]).includes(value);
+export const isRole = () => undefined;
 
killedBy: Role narrows a string with the isRole guard
statusReason: expected undefined to be true // Object.is equality
