[Killed] BlockStatement
src/identity/domain/username.ts:13:65
 export class Username {
   private constructor(readonly value: string) {}
 
-  static create(value: string): Result<Username, IdentityError> {
-    if (!USERNAME_PATTERN.test(value)) {
-      return err(IdentityError.invalidUsername(value));
-    }
-    return ok(new Username(value));
-  }
+  static create(value: string): Result<Username, IdentityError> {}
 }
 
killedBy: makeRegisterMember registers a new member, persists it, and publishes MemberRegistered
statusReason: Cannot read properties of undefined (reading 'isErr')

[Killed] BooleanLiteral
src/identity/domain/username.ts:14:9
   private constructor(readonly value: string) {}
 
   static create(value: string): Result<Username, IdentityError> {
-    if (!USERNAME_PATTERN.test(value)) {
+    if (USERNAME_PATTERN.test(value)) {
       return err(IdentityError.invalidUsername(value));
     }
killedBy: Member.register mints an active, role-less member and records MemberRegistered
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/identity/domain/username.ts:14:40
   private constructor(readonly value: string) {}
 
   static create(value: string): Result<Username, IdentityError> {
-    if (!USERNAME_PATTERN.test(value)) {
-      return err(IdentityError.invalidUsername(value));
-    }
+    if (!USERNAME_PATTERN.test(value)) {}
     return ok(new Username(value));
   }
killedBy: Member.register validates a supplied username and treats an empty one as absent
statusReason: expected false to be true // Object.is equality
