[Killed] StringLiteral
src/insights/collection-breakdown.ts:28:12
 // in the first bucket it falls below, so the lower edge is implied by the previous bucket and every
 // boundary is single-sourced (e.g. 300 appears once). The final Infinity bound catches 2000+.
 const PIECE_BUCKETS: ReadonlyArray<{ label: string; below: number }> = [
-  { label: "< 100", below: 100 },
+  { label: "", below: 100 },
   { label: "100-299", below: 300 },
   { label: "300-499", below: 500 },
killedBy: computeCollectionBreakdown piece-count bucketing places counts at the inclusive-lower / exclusive-upper bucket edges
statusReason: expected [ { label: '', value: 1 }, …(5) ] to deeply equal [ { label: '< 100', value: 1 }, …(5) ]

[Killed] ObjectLiteral
src/insights/collection-breakdown.ts:32:3
   { label: "100-299", below: 300 },
   { label: "300-499", below: 500 },
   { label: "500-999", below: 1000 },
-  { label: "1000-1999", below: 2000 },
+  {},
   { label: "2000+", below: Number.POSITIVE_INFINITY },
 ];
killedBy: computeCollectionBreakdown piece-count bucketing places counts at the inclusive-lower / exclusive-upper bucket edges
statusReason: expected [ { label: '< 100', value: 1 }, …(4) ] to deeply equal [ { label: '< 100', value: 1 }, …(5) ]

[Killed] StringLiteral
src/insights/collection-breakdown.ts:32:12
   { label: "100-299", below: 300 },
   { label: "300-499", below: 500 },
   { label: "500-999", below: 1000 },
-  { label: "1000-1999", below: 2000 },
+  { label: "", below: 2000 },
   { label: "2000+", below: Number.POSITIVE_INFINITY },
 ];
killedBy: computeCollectionBreakdown piece-count bucketing places counts at the inclusive-lower / exclusive-upper bucket edges
statusReason: expected [ { label: '< 100', value: 1 }, …(5) ] to deeply equal [ { label: '< 100', value: 1 }, …(5) ]

[Killed] BlockStatement
src/insights/collection-breakdown.ts:43:27
 // "Unknown". Only non-empty buckets are returned, preserving the natural ascending order.
 const pieceCountDistribution = (
   copies: readonly CopyBreakdownInput[],
-): DistributionEntry[] => {
-  const counts = new Map<string, number>();
-  for (const copy of copies) {
-    const n = copy.pieceCount;
-    const label =
-      typeof n === "number" && Number.isFinite(n)
-        ? (PIECE_BUCKETS.find((b) => n < b.below)?.label ?? UNKNOWN_LABEL)
-        : UNKNOWN_LABEL;
-    counts.set(label, (counts.get(label) ?? 0) + 1);
-  }
-  // Emit buckets in their declared order, then a trailing Unknown if present.
-  const ordered: DistributionEntry[] = [];
-  for (const b of PIECE_BUCKETS) {
-    const value = counts.get(b.label);
-    if (value) ordered.push({ label: b.label, value });
-  }
-  const unknown = counts.get(UNKNOWN_LABEL);
-  if (unknown) ordered.push({ label: UNKNOWN_LABEL, value: unknown });
-  return ordered;
-};
+): DistributionEntry[] => {};
 
 // Count a string-valued facet, mapping missing/blank values to "Unknown". Sorted by value desc,
killedBy: computeCollectionBreakdown returns empty distributions for no copies
statusReason: expected { byPieceCount: undefined, …(3) } to deeply equal { byPieceCount: [], byBrand: [], …(2) }

[Killed] BlockStatement
src/insights/collection-breakdown.ts:45:30
   copies: readonly CopyBreakdownInput[],
 ): DistributionEntry[] => {
   const counts = new Map<string, number>();
-  for (const copy of copies) {
-    const n = copy.pieceCount;
-    const label =
-      typeof n === "number" && Number.isFinite(n)
-        ? (PIECE_BUCKETS.find((b) => n < b.below)?.label ?? UNKNOWN_LABEL)
-        : UNKNOWN_LABEL;
-    counts.set(label, (counts.get(label) ?? 0) + 1);
-  }
+  for (const copy of copies) {}
   // Emit buckets in their declared order, then a trailing Unknown if present.
   const ordered: DistributionEntry[] = [];
killedBy: computeCollectionBreakdown piece-count bucketing places counts at the inclusive-lower / exclusive-upper bucket edges
statusReason: expected [] to deeply equal [ { label: '< 100', value: 1 }, …(5) ]

[Killed] EqualityOperator
src/insights/collection-breakdown.ts:48:7
   for (const copy of copies) {
     const n = copy.pieceCount;
     const label =
-      typeof n === "number" && Number.isFinite(n)
+      typeof n !== "number" && Number.isFinite(n)
         ? (PIECE_BUCKETS.find((b) => n < b.below)?.label ?? UNKNOWN_LABEL)
         : UNKNOWN_LABEL;
killedBy: computeCollectionBreakdown piece-count bucketing places counts at the inclusive-lower / exclusive-upper bucket edges
statusReason: expected [ { label: 'Unknown', value: 8 } ] to deeply equal [ { label: '< 100', value: 1 }, …(5) ]

[Killed] ConditionalExpression
src/insights/collection-breakdown.ts:48:7
   for (const copy of copies) {
     const n = copy.pieceCount;
     const label =
-      typeof n === "number" && Number.isFinite(n)
+      false
         ? (PIECE_BUCKETS.find((b) => n < b.below)?.label ?? UNKNOWN_LABEL)
         : UNKNOWN_LABEL;
killedBy: computeCollectionBreakdown piece-count bucketing places counts at the inclusive-lower / exclusive-upper bucket edges
statusReason: expected [ { label: 'Unknown', value: 8 } ] to deeply equal [ { label: '< 100', value: 1 }, …(5) ]

[Killed] ConditionalExpression
src/insights/collection-breakdown.ts:49:38
     const n = copy.pieceCount;
     const label =
       typeof n === "number" && Number.isFinite(n)
-        ? (PIECE_BUCKETS.find((b) => n < b.below)?.label ?? UNKNOWN_LABEL)
+        ? (PIECE_BUCKETS.find((b) => true)?.label ?? UNKNOWN_LABEL)
         : UNKNOWN_LABEL;
     counts.set(label, (counts.get(label) ?? 0) + 1);
killedBy: computeCollectionBreakdown piece-count bucketing places counts at the inclusive-lower / exclusive-upper bucket edges
statusReason: expected [ { label: '< 100', value: 8 } ] to deeply equal [ { label: '< 100', value: 1 }, …(5) ]

[Killed] ArrowFunction
src/insights/collection-breakdown.ts:49:31
     const n = copy.pieceCount;
     const label =
       typeof n === "number" && Number.isFinite(n)
-        ? (PIECE_BUCKETS.find((b) => n < b.below)?.label ?? UNKNOWN_LABEL)
+        ? (PIECE_BUCKETS.find(() => undefined)?.label ?? UNKNOWN_LABEL)
         : UNKNOWN_LABEL;
     counts.set(label, (counts.get(label) ?? 0) + 1);
killedBy: computeCollectionBreakdown piece-count bucketing places counts at the inclusive-lower / exclusive-upper bucket edges
statusReason: expected [ { label: 'Unknown', value: 8 } ] to deeply equal [ { label: '< 100', value: 1 }, …(5) ]

[Killed] ArithmeticOperator
src/insights/collection-breakdown.ts:51:23
       typeof n === "number" && Number.isFinite(n)
         ? (PIECE_BUCKETS.find((b) => n < b.below)?.label ?? UNKNOWN_LABEL)
         : UNKNOWN_LABEL;
-    counts.set(label, (counts.get(label) ?? 0) + 1);
+    counts.set(label, (counts.get(label) ?? 0) - 1);
   }
   // Emit buckets in their declared order, then a trailing Unknown if present.
killedBy: computeCollectionBreakdown piece-count bucketing places counts at the inclusive-lower / exclusive-upper bucket edges
statusReason: expected [ { label: '< 100', value: -1 }, …(5) ] to deeply equal [ { label: '< 100', value: 1 }, …(5) ]

[Killed] LogicalOperator
src/insights/collection-breakdown.ts:51:24
       typeof n === "number" && Number.isFinite(n)
         ? (PIECE_BUCKETS.find((b) => n < b.below)?.label ?? UNKNOWN_LABEL)
         : UNKNOWN_LABEL;
-    counts.set(label, (counts.get(label) ?? 0) + 1);
+    counts.set(label, (counts.get(label) && 0) + 1);
   }
   // Emit buckets in their declared order, then a trailing Unknown if present.
killedBy: computeCollectionBreakdown piece-count bucketing places counts at the inclusive-lower / exclusive-upper bucket edges
statusReason: expected [] to deeply equal [ { label: '< 100', value: 1 }, …(5) ]

[Killed] ArrayDeclaration
src/insights/collection-breakdown.ts:54:40
     counts.set(label, (counts.get(label) ?? 0) + 1);
   }
   // Emit buckets in their declared order, then a trailing Unknown if present.
-  const ordered: DistributionEntry[] = [];
+  const ordered: DistributionEntry[] = ["Stryker was here"];
   for (const b of PIECE_BUCKETS) {
     const value = counts.get(b.label);
killedBy: computeCollectionBreakdown returns empty distributions for no copies
statusReason: expected { …(4) } to deeply equal { byPieceCount: [], byBrand: [], …(2) }

[Killed] BlockStatement
src/insights/collection-breakdown.ts:55:34
   }
   // Emit buckets in their declared order, then a trailing Unknown if present.
   const ordered: DistributionEntry[] = [];
-  for (const b of PIECE_BUCKETS) {
-    const value = counts.get(b.label);
-    if (value) ordered.push({ label: b.label, value });
-  }
+  for (const b of PIECE_BUCKETS) {}
   const unknown = counts.get(UNKNOWN_LABEL);
   if (unknown) ordered.push({ label: UNKNOWN_LABEL, value: unknown });
killedBy: computeCollectionBreakdown piece-count bucketing places counts at the inclusive-lower / exclusive-upper bucket edges
statusReason: expected [] to deeply equal [ { label: '< 100', value: 1 }, …(5) ]

[Killed] ConditionalExpression
src/insights/collection-breakdown.ts:57:9
   const ordered: DistributionEntry[] = [];
   for (const b of PIECE_BUCKETS) {
     const value = counts.get(b.label);
-    if (value) ordered.push({ label: b.label, value });
+    if (false) ordered.push({ label: b.label, value });
   }
   const unknown = counts.get(UNKNOWN_LABEL);
killedBy: computeCollectionBreakdown piece-count bucketing places counts at the inclusive-lower / exclusive-upper bucket edges
statusReason: expected [] to deeply equal [ { label: '< 100', value: 1 }, …(5) ]

[Killed] ConditionalExpression
src/insights/collection-breakdown.ts:57:9
   const ordered: DistributionEntry[] = [];
   for (const b of PIECE_BUCKETS) {
     const value = counts.get(b.label);
-    if (value) ordered.push({ label: b.label, value });
+    if (true) ordered.push({ label: b.label, value });
   }
   const unknown = counts.get(UNKNOWN_LABEL);
killedBy: computeCollectionBreakdown returns empty distributions for no copies
statusReason: expected { …(4) } to deeply equal { byPieceCount: [], byBrand: [], …(2) }

[Killed] ConditionalExpression
src/insights/collection-breakdown.ts:60:7
     if (value) ordered.push({ label: b.label, value });
   }
   const unknown = counts.get(UNKNOWN_LABEL);
-  if (unknown) ordered.push({ label: UNKNOWN_LABEL, value: unknown });
+  if (false) ordered.push({ label: UNKNOWN_LABEL, value: unknown });
   return ordered;
 };
killedBy: computeCollectionBreakdown piece-count bucketing buckets missing or non-finite piece counts as Unknown, listed last
statusReason: expected [ { label: '500-999', value: 1 } ] to deeply equal [ Array(2) ]

[Killed] ConditionalExpression
src/insights/collection-breakdown.ts:60:7
     if (value) ordered.push({ label: b.label, value });
   }
   const unknown = counts.get(UNKNOWN_LABEL);
-  if (unknown) ordered.push({ label: UNKNOWN_LABEL, value: unknown });
+  if (true) ordered.push({ label: UNKNOWN_LABEL, value: unknown });
   return ordered;
 };
killedBy: computeCollectionBreakdown returns empty distributions for no copies
statusReason: expected { byPieceCount: [ { …(2) } ], …(3) } to deeply equal { byPieceCount: [], byBrand: [], …(2) }

[Killed] BlockStatement
src/insights/collection-breakdown.ts:69:27
 const facetDistribution = (
   copies: readonly CopyBreakdownInput[],
   pick: (copy: CopyBreakdownInput) => string | undefined,
-): DistributionEntry[] => {
-  const counts = new Map<string, number>();
-  for (const copy of copies) {
-    const raw = pick(copy);
-    const label = raw && raw.trim().length > 0 ? raw : UNKNOWN_LABEL;
-    counts.set(label, (counts.get(label) ?? 0) + 1);
-  }
-  return sortEntries(
-    [...counts.entries()].map(([label, value]) => ({ label, value })),
-  );
-};
+): DistributionEntry[] => {};
 
 const sortEntries = (entries: DistributionEntry[]): DistributionEntry[] =>
killedBy: computeCollectionBreakdown returns empty distributions for no copies
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/insights/collection-breakdown.ts:71:30
   pick: (copy: CopyBreakdownInput) => string | undefined,
 ): DistributionEntry[] => {
   const counts = new Map<string, number>();
-  for (const copy of copies) {
-    const raw = pick(copy);
-    const label = raw && raw.trim().length > 0 ? raw : UNKNOWN_LABEL;
-    counts.set(label, (counts.get(label) ?? 0) + 1);
-  }
+  for (const copy of copies) {}
   return sortEntries(
     [...counts.entries()].map(([label, value]) => ({ label, value })),
killedBy: computeCollectionBreakdown facet distributions (difficulty / condition) counts values, sorting by value desc then label asc
statusReason: expected [] to deeply equal [ { label: 'easy', value: 2 }, …(2) ]

[Killed] ConditionalExpression
src/insights/collection-breakdown.ts:73:19
   const counts = new Map<string, number>();
   for (const copy of copies) {
     const raw = pick(copy);
-    const label = raw && raw.trim().length > 0 ? raw : UNKNOWN_LABEL;
+    const label = false ? raw : UNKNOWN_LABEL;
     counts.set(label, (counts.get(label) ?? 0) + 1);
   }
killedBy: computeCollectionBreakdown facet distributions (difficulty / condition) counts values, sorting by value desc then label asc
statusReason: expected [ { label: 'Unknown', value: 4 } ] to deeply equal [ { label: 'easy', value: 2 }, …(2) ]

[Killed] ConditionalExpression
src/insights/collection-breakdown.ts:73:26
   const counts = new Map<string, number>();
   for (const copy of copies) {
     const raw = pick(copy);
-    const label = raw && raw.trim().length > 0 ? raw : UNKNOWN_LABEL;
+    const label = raw && true ? raw : UNKNOWN_LABEL;
     counts.set(label, (counts.get(label) ?? 0) + 1);
   }
killedBy: computeCollectionBreakdown facet distributions (difficulty / condition) maps missing or blank values to Unknown
statusReason: expected [ { label: '   ', value: 1 }, …(2) ] to deeply equal [ Array(2) ]

[Killed] LogicalOperator
src/insights/collection-breakdown.ts:74:24
   for (const copy of copies) {
     const raw = pick(copy);
     const label = raw && raw.trim().length > 0 ? raw : UNKNOWN_LABEL;
-    counts.set(label, (counts.get(label) ?? 0) + 1);
+    counts.set(label, (counts.get(label) && 0) + 1);
   }
   return sortEntries(
killedBy: computeCollectionBreakdown facet distributions (difficulty / condition) counts values, sorting by value desc then label asc
statusReason: expected [ { label: 'easy', value: NaN }, …(2) ] to deeply equal [ { label: 'easy', value: 2 }, …(2) ]

[Killed] ArithmeticOperator
src/insights/collection-breakdown.ts:74:23
   for (const copy of copies) {
     const raw = pick(copy);
     const label = raw && raw.trim().length > 0 ? raw : UNKNOWN_LABEL;
-    counts.set(label, (counts.get(label) ?? 0) + 1);
+    counts.set(label, (counts.get(label) ?? 0) - 1);
   }
   return sortEntries(
killedBy: computeCollectionBreakdown facet distributions (difficulty / condition) counts values, sorting by value desc then label asc
statusReason: expected [ { label: 'hard', value: -1 }, …(2) ] to deeply equal [ { label: 'easy', value: 2 }, …(2) ]

[Killed] ArrowFunction
src/insights/collection-breakdown.ts:77:31
     counts.set(label, (counts.get(label) ?? 0) + 1);
   }
   return sortEntries(
-    [...counts.entries()].map(([label, value]) => ({ label, value })),
+    [...counts.entries()].map(() => undefined),
   );
 };
killedBy: computeCollectionBreakdown facet distributions (difficulty / condition) counts values, sorting by value desc then label asc
statusReason: expected [ undefined, undefined, undefined ] to deeply equal [ { label: 'easy', value: 2 }, …(2) ]

[Killed] ObjectLiteral
src/insights/collection-breakdown.ts:77:52
     counts.set(label, (counts.get(label) ?? 0) + 1);
   }
   return sortEntries(
-    [...counts.entries()].map(([label, value]) => ({ label, value })),
+    [...counts.entries()].map(([label, value]) => ({})),
   );
 };
killedBy: computeCollectionBreakdown facet distributions (difficulty / condition) counts values, sorting by value desc then label asc
statusReason: Cannot read properties of undefined (reading 'localeCompare')

[Killed] ArrowFunction
src/insights/collection-breakdown.ts:81:21
   );
 };
 
-const sortEntries = (entries: DistributionEntry[]): DistributionEntry[] =>
-  [...entries].sort(
-    (a, b) => b.value - a.value || a.label.localeCompare(b.label),
-  );
+const sortEntries = () => undefined;
 
 // Like a facet distribution but collapse the long tail: keep the top `topN` brands, sum the rest
killedBy: computeCollectionBreakdown returns empty distributions for no copies
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] MethodExpression
src/insights/collection-breakdown.ts:82:3
 };
 
 const sortEntries = (entries: DistributionEntry[]): DistributionEntry[] =>
-  [...entries].sort(
-    (a, b) => b.value - a.value || a.label.localeCompare(b.label),
-  );
+  [...entries];
 
 // Like a facet distribution but collapse the long tail: keep the top `topN` brands, sum the rest
killedBy: computeCollectionBreakdown facet distributions (difficulty / condition) counts values, sorting by value desc then label asc
statusReason: expected [ { label: 'hard', value: 1 }, …(2) ] to deeply equal [ { label: 'easy', value: 2 }, …(2) ]

[Killed] ArrayDeclaration
src/insights/collection-breakdown.ts:82:3
 };
 
 const sortEntries = (entries: DistributionEntry[]): DistributionEntry[] =>
-  [...entries].sort(
+  [].sort(
     (a, b) => b.value - a.value || a.label.localeCompare(b.label),
   );
killedBy: computeCollectionBreakdown facet distributions (difficulty / condition) counts values, sorting by value desc then label asc
statusReason: expected [] to deeply equal [ { label: 'easy', value: 2 }, …(2) ]

[Killed] LogicalOperator
src/insights/collection-breakdown.ts:83:15
 
 const sortEntries = (entries: DistributionEntry[]): DistributionEntry[] =>
   [...entries].sort(
-    (a, b) => b.value - a.value || a.label.localeCompare(b.label),
+    (a, b) => b.value - a.value && a.label.localeCompare(b.label),
   );
 
killedBy: computeCollectionBreakdown facet distributions (difficulty / condition) maps missing or blank values to Unknown
statusReason: expected [ { label: 'good', value: 1 }, …(1) ] to deeply equal [ Array(2) ]

[Killed] ArrowFunction
src/insights/collection-breakdown.ts:83:5
 
 const sortEntries = (entries: DistributionEntry[]): DistributionEntry[] =>
   [...entries].sort(
-    (a, b) => b.value - a.value || a.label.localeCompare(b.label),
+    () => undefined,
   );
 
killedBy: computeCollectionBreakdown facet distributions (difficulty / condition) counts values, sorting by value desc then label asc
statusReason: expected [ { label: 'hard', value: 1 }, …(2) ] to deeply equal [ { label: 'easy', value: 2 }, …(2) ]

[Killed] BlockStatement
src/insights/collection-breakdown.ts:91:27
 const brandDistribution = (
   copies: readonly CopyBreakdownInput[],
   topN: number,
-): DistributionEntry[] => {
-  const all = facetDistribution(copies, (c) => c.brand);
-  if (all.length <= topN) return all;
-  const top = all.slice(0, topN);
-  const otherValue = all
-    .slice(topN)
-    .reduce((acc, entry) => acc + entry.value, 0);
-  return [...top, { label: OTHER_LABEL, value: otherValue }];
-};
+): DistributionEntry[] => {};
 
 const DEFAULT_BRAND_TOP_N = 8;
killedBy: computeCollectionBreakdown returns empty distributions for no copies
statusReason: expected { byPieceCount: [], …(3) } to deeply equal { byPieceCount: [], byBrand: [], …(2) }

[Killed] ArrowFunction
src/insights/collection-breakdown.ts:92:41
   copies: readonly CopyBreakdownInput[],
   topN: number,
 ): DistributionEntry[] => {
-  const all = facetDistribution(copies, (c) => c.brand);
+  const all = facetDistribution(copies, () => undefined);
   if (all.length <= topN) return all;
   const top = all.slice(0, topN);
killedBy: computeCollectionBreakdown brand top-N with Other collapse keeps every brand when distinct brands <= topN (no Other)
statusReason: expected [ { label: 'Unknown', value: 4 } ] to deeply equal [ { label: 'A', value: 3 }, …(1) ]

[Killed] EqualityOperator
src/insights/collection-breakdown.ts:93:7
   topN: number,
 ): DistributionEntry[] => {
   const all = facetDistribution(copies, (c) => c.brand);
-  if (all.length <= topN) return all;
+  if (all.length < topN) return all;
   const top = all.slice(0, topN);
   const otherValue = all
killedBy: computeCollectionBreakdown brand top-N with Other collapse keeps every brand when distinct brands <= topN (no Other)
statusReason: expected [ { label: 'A', value: 3 }, …(2) ] to deeply equal [ { label: 'A', value: 3 }, …(1) ]

[Killed] ConditionalExpression
src/insights/collection-breakdown.ts:93:7
   topN: number,
 ): DistributionEntry[] => {
   const all = facetDistribution(copies, (c) => c.brand);
-  if (all.length <= topN) return all;
+  if (false) return all;
   const top = all.slice(0, topN);
   const otherValue = all
killedBy: computeCollectionBreakdown returns empty distributions for no copies
statusReason: expected { byPieceCount: [], …(3) } to deeply equal { byPieceCount: [], byBrand: [], …(2) }

[Killed] MethodExpression
src/insights/collection-breakdown.ts:94:15
 ): DistributionEntry[] => {
   const all = facetDistribution(copies, (c) => c.brand);
   if (all.length <= topN) return all;
-  const top = all.slice(0, topN);
+  const top = all;
   const otherValue = all
     .slice(topN)
killedBy: computeCollectionBreakdown brand top-N with Other collapse collapses the tail beyond topN into a single Other appended last
statusReason: expected [ { label: 'A', value: 5 }, …(5) ] to deeply equal [ { label: 'A', value: 5 }, …(2) ]

[Killed] MethodExpression
src/insights/collection-breakdown.ts:95:22
   const all = facetDistribution(copies, (c) => c.brand);
   if (all.length <= topN) return all;
   const top = all.slice(0, topN);
-  const otherValue = all
-    .slice(topN)
+  const otherValue = all
     .reduce((acc, entry) => acc + entry.value, 0);
   return [...top, { label: OTHER_LABEL, value: otherValue }];
killedBy: computeCollectionBreakdown brand top-N with Other collapse collapses the tail beyond topN into a single Other appended last
statusReason: expected [ { label: 'A', value: 5 }, …(2) ] to deeply equal [ { label: 'A', value: 5 }, …(2) ]

[Killed] ArithmeticOperator
src/insights/collection-breakdown.ts:97:29
   const top = all.slice(0, topN);
   const otherValue = all
     .slice(topN)
-    .reduce((acc, entry) => acc + entry.value, 0);
+    .reduce((acc, entry) => acc - entry.value, 0);
   return [...top, { label: OTHER_LABEL, value: otherValue }];
 };
killedBy: computeCollectionBreakdown brand top-N with Other collapse collapses the tail beyond topN into a single Other appended last
statusReason: expected [ { label: 'A', value: 5 }, …(2) ] to deeply equal [ { label: 'A', value: 5 }, …(2) ]

[Killed] ArrowFunction
src/insights/collection-breakdown.ts:97:13
   const top = all.slice(0, topN);
   const otherValue = all
     .slice(topN)
-    .reduce((acc, entry) => acc + entry.value, 0);
+    .reduce(() => undefined, 0);
   return [...top, { label: OTHER_LABEL, value: otherValue }];
 };
killedBy: computeCollectionBreakdown brand top-N with Other collapse collapses the tail beyond topN into a single Other appended last
statusReason: expected [ { label: 'A', value: 5 }, …(2) ] to deeply equal [ { label: 'A', value: 5 }, …(2) ]

[Killed] ArrowFunction
src/insights/collection-breakdown.ts:104:43
 const DEFAULT_BRAND_TOP_N = 8;
 
 // Compute all four distributions for the collection charts. `topN` caps the brand chart's series.
-export const computeCollectionBreakdown = (
-  copies: readonly CopyBreakdownInput[],
-  topN: number = DEFAULT_BRAND_TOP_N,
-): CollectionBreakdown => ({
-  byPieceCount: pieceCountDistribution(copies),
-  byBrand: brandDistribution(copies, topN),
-  byDifficulty: facetDistribution(copies, (c) => c.difficulty),
-  byCondition: facetDistribution(copies, (c) => c.condition),
-});
+export const computeCollectionBreakdown = () => undefined;
 
killedBy: computeCollectionBreakdown returns empty distributions for no copies
statusReason: expected undefined to deeply equal { byPieceCount: [], byBrand: [], …(2) }

[Killed] ObjectLiteral
src/insights/collection-breakdown.ts:107:28
 export const computeCollectionBreakdown = (
   copies: readonly CopyBreakdownInput[],
   topN: number = DEFAULT_BRAND_TOP_N,
-): CollectionBreakdown => ({
-  byPieceCount: pieceCountDistribution(copies),
-  byBrand: brandDistribution(copies, topN),
-  byDifficulty: facetDistribution(copies, (c) => c.difficulty),
-  byCondition: facetDistribution(copies, (c) => c.condition),
-});
+): CollectionBreakdown => ({});
 
killedBy: computeCollectionBreakdown returns empty distributions for no copies
statusReason: expected {} to deeply equal { byPieceCount: [], byBrand: [], …(2) }

[Killed] ArrowFunction
src/insights/collection-breakdown.ts:110:43
 ): CollectionBreakdown => ({
   byPieceCount: pieceCountDistribution(copies),
   byBrand: brandDistribution(copies, topN),
-  byDifficulty: facetDistribution(copies, (c) => c.difficulty),
+  byDifficulty: facetDistribution(copies, () => undefined),
   byCondition: facetDistribution(copies, (c) => c.condition),
 });
killedBy: computeCollectionBreakdown facet distributions (difficulty / condition) counts values, sorting by value desc then label asc
statusReason: expected [ { label: 'Unknown', value: 4 } ] to deeply equal [ { label: 'easy', value: 2 }, …(2) ]

[Killed] ArrowFunction
src/insights/collection-breakdown.ts:111:42
   byPieceCount: pieceCountDistribution(copies),
   byBrand: brandDistribution(copies, topN),
   byDifficulty: facetDistribution(copies, (c) => c.difficulty),
-  byCondition: facetDistribution(copies, (c) => c.condition),
+  byCondition: facetDistribution(copies, () => undefined),
 });
 
killedBy: computeCollectionBreakdown facet distributions (difficulty / condition) maps missing or blank values to Unknown
statusReason: expected [ { label: 'Unknown', value: 3 } ] to deeply equal [ Array(2) ]
