[Killed] BlockStatement
src/insights/completion-trends.ts:19:47
 }
 
 // "YYYY-MM" for an epoch-ms instant, in UTC so grouping is timezone-stable and deterministic.
-const monthKey = (epochMs: number): string => {
-  const d = new Date(epochMs);
-  const year = d.getUTCFullYear();
-  const month = `${d.getUTCMonth() + 1}`.padStart(2, "0");
-  return `${year}-${month}`;
-};
+const monthKey = (epochMs: number): string => {};
 
 // Step a {year, month} cursor back one month, normalising the January→December wrap.
killedBy: computeCompletionTrends groups completions into their UTC month and sums count + minutes
statusReason: expected { month: '2026-06', count: +0, …(1) } to deeply equal { month: '2026-06', count: 2, …(1) }

[Killed] ArithmeticOperator
src/insights/completion-trends.ts:22:20
 const monthKey = (epochMs: number): string => {
   const d = new Date(epochMs);
   const year = d.getUTCFullYear();
-  const month = `${d.getUTCMonth() + 1}`.padStart(2, "0");
+  const month = `${d.getUTCMonth() - 1}`.padStart(2, "0");
   return `${year}-${month}`;
 };
killedBy: computeCompletionTrends groups completions into their UTC month and sums count + minutes
statusReason: expected { month: '2026-06', count: +0, …(1) } to deeply equal { month: '2026-06', count: 2, …(1) }

[Killed] StringLiteral
src/insights/completion-trends.ts:23:10
   const d = new Date(epochMs);
   const year = d.getUTCFullYear();
   const month = `${d.getUTCMonth() + 1}`.padStart(2, "0");
-  return `${year}-${month}`;
+  return ``;
 };
 
killedBy: computeCompletionTrends groups completions into their UTC month and sums count + minutes
statusReason: expected { month: '2026-06', count: +0, …(1) } to deeply equal { month: '2026-06', count: 2, …(1) }

[Killed] BlockStatement
src/insights/completion-trends.ts:30:39
 const previousMonth = (
   year: number,
   month: number,
-): { year: number; month: number } => {
-  if (month === 1) return { year: year - 1, month: 12 };
-  return { year, month: month - 1 };
-};
+): { year: number; month: number } => {};
 
 const DEFAULT_WINDOW_MONTHS = 12;
killedBy: computeCompletionTrends returns a zero-filled 12-month window for empty input, sorted oldest->newest
statusReason: Cannot read properties of undefined (reading 'year')

[Killed] ArithmeticOperator
src/insights/completion-trends.ts:31:35
   year: number,
   month: number,
 ): { year: number; month: number } => {
-  if (month === 1) return { year: year - 1, month: 12 };
+  if (month === 1) return { year: year + 1, month: 12 };
   return { year, month: month - 1 };
 };
killedBy: computeCompletionTrends returns a zero-filled 12-month window for empty input, sorted oldest->newest
statusReason: expected '2026-01' to be '2025-07' // Object.is equality

[Killed] ConditionalExpression
src/insights/completion-trends.ts:31:7
   year: number,
   month: number,
 ): { year: number; month: number } => {
-  if (month === 1) return { year: year - 1, month: 12 };
+  if (true) return { year: year - 1, month: 12 };
   return { year, month: month - 1 };
 };
killedBy: computeCompletionTrends returns a zero-filled 12-month window for empty input, sorted oldest->newest
statusReason: expected '2015-12' to be '2025-07' // Object.is equality

[Killed] ArithmeticOperator
src/insights/completion-trends.ts:32:25
   month: number,
 ): { year: number; month: number } => {
   if (month === 1) return { year: year - 1, month: 12 };
-  return { year, month: month - 1 };
+  return { year, month: month + 1 };
 };
 
killedBy: computeCompletionTrends returns a zero-filled 12-month window for empty input, sorted oldest->newest
statusReason: expected '2026-06' to be '2025-07' // Object.is equality

[Killed] ArithmeticOperator
src/insights/completion-trends.ts:52:12
   const nowDate = new Date(now);
   let cursor = {
     year: nowDate.getUTCFullYear(),
-    month: nowDate.getUTCMonth() + 1,
+    month: nowDate.getUTCMonth() - 1,
   };
   for (let i = 0; i < windowMonths; i++) {
killedBy: computeCompletionTrends returns a zero-filled 12-month window for empty input, sorted oldest->newest
statusReason: expected '2025-05' to be '2025-07' // Object.is equality

[Killed] BlockStatement
src/insights/completion-trends.ts:54:42
     year: nowDate.getUTCFullYear(),
     month: nowDate.getUTCMonth() + 1,
   };
-  for (let i = 0; i < windowMonths; i++) {
-    const key = `${cursor.year}-${`${cursor.month}`.padStart(2, "0")}`;
-    buckets.set(key, { count: 0, totalMinutes: 0 });
-    cursor = previousMonth(cursor.year, cursor.month);
-  }
+  for (let i = 0; i < windowMonths; i++) {}
 
   for (const c of completions) {
killedBy: computeCompletionTrends returns a zero-filled 12-month window for empty input, sorted oldest->newest
statusReason: expected [] to have a length of 12 but got +0

[Killed] EqualityOperator
src/insights/completion-trends.ts:54:19
     year: nowDate.getUTCFullYear(),
     month: nowDate.getUTCMonth() + 1,
   };
-  for (let i = 0; i < windowMonths; i++) {
+  for (let i = 0; i >= windowMonths; i++) {
     const key = `${cursor.year}-${`${cursor.month}`.padStart(2, "0")}`;
     buckets.set(key, { count: 0, totalMinutes: 0 });
killedBy: computeCompletionTrends returns a zero-filled 12-month window for empty input, sorted oldest->newest
statusReason: expected [] to have a length of 12 but got +0

[Killed] StringLiteral
src/insights/completion-trends.ts:55:65
     month: nowDate.getUTCMonth() + 1,
   };
   for (let i = 0; i < windowMonths; i++) {
-    const key = `${cursor.year}-${`${cursor.month}`.padStart(2, "0")}`;
+    const key = `${cursor.year}-${`${cursor.month}`.padStart(2, "")}`;
     buckets.set(key, { count: 0, totalMinutes: 0 });
     cursor = previousMonth(cursor.year, cursor.month);
killedBy: computeCompletionTrends returns a zero-filled 12-month window for empty input, sorted oldest->newest
statusReason: expected '2025-10' to be '2025-07' // Object.is equality

[Killed] BlockStatement
src/insights/completion-trends.ts:60:32
     cursor = previousMonth(cursor.year, cursor.month);
   }
 
-  for (const c of completions) {
-    const key = monthKey(c.completedAt);
-    const bucket = buckets.get(key);
-    if (!bucket) continue; // outside the window
-    bucket.count += 1;
-    bucket.totalMinutes +=
-      typeof c.completionTimeMinutes === "number" ? c.completionTimeMinutes : 0;
-  }
+  for (const c of completions) {}
 
   return [...buckets.entries()]
killedBy: computeCompletionTrends groups completions into their UTC month and sums count + minutes
statusReason: expected { month: '2026-06', count: +0, …(1) } to deeply equal { month: '2026-06', count: 2, …(1) }

[Killed] BooleanLiteral
src/insights/completion-trends.ts:63:9
   for (const c of completions) {
     const key = monthKey(c.completedAt);
     const bucket = buckets.get(key);
-    if (!bucket) continue; // outside the window
+    if (bucket) continue; // outside the window
     bucket.count += 1;
     bucket.totalMinutes +=
killedBy: computeCompletionTrends groups completions into their UTC month and sums count + minutes
statusReason: expected { month: '2026-06', count: +0, …(1) } to deeply equal { month: '2026-06', count: 2, …(1) }

[Killed] ConditionalExpression
src/insights/completion-trends.ts:63:9
   for (const c of completions) {
     const key = monthKey(c.completedAt);
     const bucket = buckets.get(key);
-    if (!bucket) continue; // outside the window
+    if (false) continue; // outside the window
     bucket.count += 1;
     bucket.totalMinutes +=
killedBy: computeCompletionTrends ignores completions older than the window
statusReason: Cannot read properties of undefined (reading 'count')

[Killed] AssignmentOperator
src/insights/completion-trends.ts:64:5
     const key = monthKey(c.completedAt);
     const bucket = buckets.get(key);
     if (!bucket) continue; // outside the window
-    bucket.count += 1;
+    bucket.count -= 1;
     bucket.totalMinutes +=
       typeof c.completionTimeMinutes === "number" ? c.completionTimeMinutes : 0;
killedBy: computeCompletionTrends groups completions into their UTC month and sums count + minutes
statusReason: expected { month: '2026-06', count: -2, …(1) } to deeply equal { month: '2026-06', count: 2, …(1) }

[Killed] AssignmentOperator
src/insights/completion-trends.ts:65:5
     const bucket = buckets.get(key);
     if (!bucket) continue; // outside the window
     bucket.count += 1;
-    bucket.totalMinutes +=
-      typeof c.completionTimeMinutes === "number" ? c.completionTimeMinutes : 0;
+    bucket.totalMinutes -= typeof c.completionTimeMinutes === "number" ? c.completionTimeMinutes : 0;
   }
 
killedBy: computeCompletionTrends groups completions into their UTC month and sums count + minutes
statusReason: expected { month: '2026-06', count: 2, …(1) } to deeply equal { month: '2026-06', count: 2, …(1) }

[Killed] ConditionalExpression
src/insights/completion-trends.ts:66:7
     if (!bucket) continue; // outside the window
     bucket.count += 1;
     bucket.totalMinutes +=
-      typeof c.completionTimeMinutes === "number" ? c.completionTimeMinutes : 0;
+      false ? c.completionTimeMinutes : 0;
   }
 
killedBy: computeCompletionTrends groups completions into their UTC month and sums count + minutes
statusReason: expected { month: '2026-06', count: 2, …(1) } to deeply equal { month: '2026-06', count: 2, …(1) }

[Killed] ConditionalExpression
src/insights/completion-trends.ts:66:7
     if (!bucket) continue; // outside the window
     bucket.count += 1;
     bucket.totalMinutes +=
-      typeof c.completionTimeMinutes === "number" ? c.completionTimeMinutes : 0;
+      true ? c.completionTimeMinutes : 0;
   }
 
killedBy: computeCompletionTrends treats a missing completion time as zero minutes but still counts it
statusReason: expected { month: '2026-06', count: 1, …(1) } to deeply equal { month: '2026-06', count: 1, …(1) }

[Killed] MethodExpression
src/insights/completion-trends.ts:69:10
       typeof c.completionTimeMinutes === "number" ? c.completionTimeMinutes : 0;
   }
 
-  return [...buckets.entries()]
-    .map(([month, { count, totalMinutes }]) => ({ month, count, totalMinutes }))
-    .sort((a, b) => a.month.localeCompare(b.month));
+  return [...buckets.entries()].map(([month, {
+  count,
+  totalMinutes
+}]) => ({
+  month,
+  count,
+  totalMinutes
+}));
 };
 
killedBy: computeCompletionTrends returns a zero-filled 12-month window for empty input, sorted oldest->newest
statusReason: expected '2026-06' to be '2025-07' // Object.is equality

[Killed] ArrayDeclaration
src/insights/completion-trends.ts:69:10
       typeof c.completionTimeMinutes === "number" ? c.completionTimeMinutes : 0;
   }
 
-  return [...buckets.entries()]
+  return []
     .map(([month, { count, totalMinutes }]) => ({ month, count, totalMinutes }))
     .sort((a, b) => a.month.localeCompare(b.month));
killedBy: computeCompletionTrends returns a zero-filled 12-month window for empty input, sorted oldest->newest
statusReason: expected [] to have a length of 12 but got +0

[Killed] ArrowFunction
src/insights/completion-trends.ts:70:10
   }
 
   return [...buckets.entries()]
-    .map(([month, { count, totalMinutes }]) => ({ month, count, totalMinutes }))
+    .map(() => undefined)
     .sort((a, b) => a.month.localeCompare(b.month));
 };
killedBy: computeCompletionTrends returns a zero-filled 12-month window for empty input, sorted oldest->newest
statusReason: Cannot read properties of undefined (reading 'count')

[Killed] ObjectLiteral
src/insights/completion-trends.ts:70:49
   }
 
   return [...buckets.entries()]
-    .map(([month, { count, totalMinutes }]) => ({ month, count, totalMinutes }))
+    .map(([month, { count, totalMinutes }]) => ({}))
     .sort((a, b) => a.month.localeCompare(b.month));
 };
killedBy: computeCompletionTrends returns a zero-filled 12-month window for empty input, sorted oldest->newest
statusReason: Cannot read properties of undefined (reading 'localeCompare')

[Killed] ArrowFunction
src/insights/completion-trends.ts:71:11
 
   return [...buckets.entries()]
     .map(([month, { count, totalMinutes }]) => ({ month, count, totalMinutes }))
-    .sort((a, b) => a.month.localeCompare(b.month));
+    .sort(() => undefined);
 };
 
killedBy: computeCompletionTrends returns a zero-filled 12-month window for empty input, sorted oldest->newest
statusReason: expected '2026-06' to be '2025-07' // Object.is equality
