[Killed] BlockStatement
src/insights/recommendations.ts:62:66
 
 // Same ascending bands as the collection breakdown chart; "near in size" = same band. Boundaries are
 // inclusive-lower / exclusive-upper so exactly 500 lands in the 500-999 band.
-const pieceBand = (n: number | undefined): number | undefined => {
-  if (typeof n !== "number" || !Number.isFinite(n)) return undefined;
-  if (n < 100) return 0;
-  if (n < 300) return 1;
-  if (n < 500) return 2;
-  if (n < 1000) return 3;
-  if (n < 2000) return 4;
-  return 5;
-};
+const pieceBand = (n: number | undefined): number | undefined => {};
 
 const normaliseBrand = (brand: string | undefined): string | undefined => {
killedBy: recommendPuzzles facet affinity scores same-brand candidates highest and reports sameBrand
statusReason: expected { key: 'same-band', score: +0, …(1) } to deeply equal { key: 'same-band', score: 1, …(1) }

[Killed] ConditionalExpression
src/insights/recommendations.ts:63:7
 // Same ascending bands as the collection breakdown chart; "near in size" = same band. Boundaries are
 // inclusive-lower / exclusive-upper so exactly 500 lands in the 500-999 band.
 const pieceBand = (n: number | undefined): number | undefined => {
-  if (typeof n !== "number" || !Number.isFinite(n)) return undefined;
+  if (false) return undefined;
   if (n < 100) return 0;
   if (n < 300) return 1;
killedBy: recommendPuzzles facet affinity scores shared category/tag overlap and reports sharedCategory
statusReason: expected { key: 'overlap', score: 3, …(1) } to deeply equal { key: 'overlap', score: 2, …(1) }

[Killed] ConditionalExpression
src/insights/recommendations.ts:63:7
 // Same ascending bands as the collection breakdown chart; "near in size" = same band. Boundaries are
 // inclusive-lower / exclusive-upper so exactly 500 lands in the 500-999 band.
 const pieceBand = (n: number | undefined): number | undefined => {
-  if (typeof n !== "number" || !Number.isFinite(n)) return undefined;
+  if (true) return undefined;
   if (n < 100) return 0;
   if (n < 300) return 1;
killedBy: recommendPuzzles facet affinity scores same-brand candidates highest and reports sameBrand
statusReason: expected { key: 'same-band', score: +0, …(1) } to deeply equal { key: 'same-band', score: 1, …(1) }

[Killed] EqualityOperator
src/insights/recommendations.ts:64:7
 // inclusive-lower / exclusive-upper so exactly 500 lands in the 500-999 band.
 const pieceBand = (n: number | undefined): number | undefined => {
   if (typeof n !== "number" || !Number.isFinite(n)) return undefined;
-  if (n < 100) return 0;
+  if (n <= 100) return 0;
   if (n < 300) return 1;
   if (n < 500) return 2;
killedBy: recommendPuzzles piece-count band boundaries (inclusive-lower / exclusive-upper) partitions piece counts into the right band at every boundary
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/insights/recommendations.ts:64:7
 // inclusive-lower / exclusive-upper so exactly 500 lands in the 500-999 band.
 const pieceBand = (n: number | undefined): number | undefined => {
   if (typeof n !== "number" || !Number.isFinite(n)) return undefined;
-  if (n < 100) return 0;
+  if (false) return 0;
   if (n < 300) return 1;
   if (n < 500) return 2;
killedBy: recommendPuzzles piece-count band boundaries (inclusive-lower / exclusive-upper) partitions piece counts into the right band at every boundary
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/insights/recommendations.ts:65:7
 const pieceBand = (n: number | undefined): number | undefined => {
   if (typeof n !== "number" || !Number.isFinite(n)) return undefined;
   if (n < 100) return 0;
-  if (n < 300) return 1;
+  if (n >= 300) return 1;
   if (n < 500) return 2;
   if (n < 1000) return 3;
killedBy: recommendPuzzles facet affinity scores similar piece-count band and reports similarPieceCount
statusReason: expected { key: 'far', score: 1, …(1) } to deeply equal { key: 'near', score: 1, …(1) }

[Killed] EqualityOperator
src/insights/recommendations.ts:65:7
 const pieceBand = (n: number | undefined): number | undefined => {
   if (typeof n !== "number" || !Number.isFinite(n)) return undefined;
   if (n < 100) return 0;
-  if (n < 300) return 1;
+  if (n <= 300) return 1;
   if (n < 500) return 2;
   if (n < 1000) return 3;
killedBy: recommendPuzzles piece-count band boundaries (inclusive-lower / exclusive-upper) partitions piece counts into the right band at every boundary
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/insights/recommendations.ts:66:7
   if (typeof n !== "number" || !Number.isFinite(n)) return undefined;
   if (n < 100) return 0;
   if (n < 300) return 1;
-  if (n < 500) return 2;
+  if (true) return 2;
   if (n < 1000) return 3;
   if (n < 2000) return 4;
killedBy: recommendPuzzles facet affinity scores similar piece-count band and reports similarPieceCount
statusReason: expected { key: 'far', score: 1, …(1) } to deeply equal { key: 'near', score: 1, …(1) }

[Killed] EqualityOperator
src/insights/recommendations.ts:66:7
   if (typeof n !== "number" || !Number.isFinite(n)) return undefined;
   if (n < 100) return 0;
   if (n < 300) return 1;
-  if (n < 500) return 2;
+  if (n >= 500) return 2;
   if (n < 1000) return 3;
   if (n < 2000) return 4;
killedBy: recommendPuzzles facet affinity scores similar piece-count band and reports similarPieceCount
statusReason: expected { key: 'far', score: 1, …(1) } to deeply equal { key: 'near', score: 1, …(1) }

[Killed] ConditionalExpression
src/insights/recommendations.ts:67:7
   if (n < 100) return 0;
   if (n < 300) return 1;
   if (n < 500) return 2;
-  if (n < 1000) return 3;
+  if (false) return 3;
   if (n < 2000) return 4;
   return 5;
killedBy: recommendPuzzles facet affinity scores similar piece-count band and reports similarPieceCount
statusReason: expected { key: 'far', score: 1, …(1) } to deeply equal { key: 'near', score: 1, …(1) }

[Killed] ConditionalExpression
src/insights/recommendations.ts:67:7
   if (n < 100) return 0;
   if (n < 300) return 1;
   if (n < 500) return 2;
-  if (n < 1000) return 3;
+  if (true) return 3;
   if (n < 2000) return 4;
   return 5;
killedBy: recommendPuzzles facet affinity scores similar piece-count band and reports similarPieceCount
statusReason: expected { key: 'far', score: 1, …(1) } to deeply equal { key: 'near', score: 1, …(1) }

[Killed] ConditionalExpression
src/insights/recommendations.ts:68:7
   if (n < 300) return 1;
   if (n < 500) return 2;
   if (n < 1000) return 3;
-  if (n < 2000) return 4;
+  if (true) return 4;
   return 5;
 };
killedBy: recommendPuzzles piece-count band boundaries (inclusive-lower / exclusive-upper) partitions piece counts into the right band at every boundary
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/insights/recommendations.ts:68:7
   if (n < 300) return 1;
   if (n < 500) return 2;
   if (n < 1000) return 3;
-  if (n < 2000) return 4;
+  if (n <= 2000) return 4;
   return 5;
 };
killedBy: recommendPuzzles piece-count band boundaries (inclusive-lower / exclusive-upper) partitions piece counts into the right band at every boundary
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/insights/recommendations.ts:72:75
   return 5;
 };
 
-const normaliseBrand = (brand: string | undefined): string | undefined => {
-  const trimmed = brand?.trim().toLowerCase();
-  return trimmed && trimmed.length > 0 ? trimmed : undefined;
-};
+const normaliseBrand = (brand: string | undefined): string | undefined => {};
 
 const normaliseKeys = (keys: readonly string[] | undefined): string[] =>
killedBy: recommendPuzzles facet affinity scores same-brand candidates highest and reports sameBrand
statusReason: expected { key: 'same-band', score: 1, …(1) } to deeply equal { key: 'same-brand', score: 3, …(1) }

[Killed] OptionalChaining
src/insights/recommendations.ts:73:19
 };
 
 const normaliseBrand = (brand: string | undefined): string | undefined => {
-  const trimmed = brand?.trim().toLowerCase();
+  const trimmed = brand.trim().toLowerCase();
   return trimmed && trimmed.length > 0 ? trimmed : undefined;
 };
killedBy: recommendPuzzles facet affinity scores similar piece-count band and reports similarPieceCount
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] MethodExpression
src/insights/recommendations.ts:73:19
 };
 
 const normaliseBrand = (brand: string | undefined): string | undefined => {
-  const trimmed = brand?.trim().toLowerCase();
+  const trimmed = brand.toLowerCase();
   return trimmed && trimmed.length > 0 ? trimmed : undefined;
 };
killedBy: recommendPuzzles facet affinity scores similar piece-count band and reports similarPieceCount
statusReason: Cannot read properties of undefined (reading 'toLowerCase')

[Killed] EqualityOperator
src/insights/recommendations.ts:74:21
 
 const normaliseBrand = (brand: string | undefined): string | undefined => {
   const trimmed = brand?.trim().toLowerCase();
-  return trimmed && trimmed.length > 0 ? trimmed : undefined;
+  return trimmed && trimmed.length <= 0 ? trimmed : undefined;
 };
 
killedBy: recommendPuzzles facet affinity scores same-brand candidates highest and reports sameBrand
statusReason: expected { key: 'same-band', score: 1, …(1) } to deeply equal { key: 'same-brand', score: 3, …(1) }

[Killed] LogicalOperator
src/insights/recommendations.ts:74:10
 
 const normaliseBrand = (brand: string | undefined): string | undefined => {
   const trimmed = brand?.trim().toLowerCase();
-  return trimmed && trimmed.length > 0 ? trimmed : undefined;
+  return trimmed || trimmed.length > 0 ? trimmed : undefined;
 };
 
killedBy: recommendPuzzles facet affinity scores similar piece-count band and reports similarPieceCount
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ArrowFunction
src/insights/recommendations.ts:77:23
   return trimmed && trimmed.length > 0 ? trimmed : undefined;
 };
 
-const normaliseKeys = (keys: readonly string[] | undefined): string[] =>
-  (keys ?? []).map((k) => k.trim().toLowerCase()).filter((k) => k.length > 0);
+const normaliseKeys = () => undefined;
 
 // The member's taste reduced to affinity sets/counts across the facets of all their puzzles. With
killedBy: recommendPuzzles facet affinity scores same-brand candidates highest and reports sameBrand
statusReason: normaliseKeys is not a function or its return value is not iterable

[Killed] ArrowFunction
src/insights/recommendations.ts:78:20
 };
 
 const normaliseKeys = (keys: readonly string[] | undefined): string[] =>
-  (keys ?? []).map((k) => k.trim().toLowerCase()).filter((k) => k.length > 0);
+  (keys ?? []).map(() => undefined).filter((k) => k.length > 0);
 
 // The member's taste reduced to affinity sets/counts across the facets of all their puzzles. With
killedBy: recommendPuzzles facet affinity scores shared category/tag overlap and reports sharedCategory
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/insights/recommendations.ts:78:65
 };
 
 const normaliseKeys = (keys: readonly string[] | undefined): string[] =>
-  (keys ?? []).map((k) => k.trim().toLowerCase()).filter((k) => k.length > 0);
+  (keys ?? []).map((k) => k.trim().toLowerCase()).filter((k) => true);
 
 // The member's taste reduced to affinity sets/counts across the facets of all their puzzles. With
killedBy: recommendPuzzles category key normalisation drops blank category keys (an empty key is not a shared category)
statusReason: expected 2 to be +0 // Object.is equality

[Killed] BlockStatement
src/insights/recommendations.ts:88:61
   readonly categories: ReadonlySet<string>;
 }
 
-const buildAffinity = (signals: MemberSignals): Affinity => {
-  const brands = new Set<string>();
-  const bands = new Set<number>();
-  const categories = new Set<string>();
-  for (const facet of signals.facets) {
-    const brand = normaliseBrand(facet.brand);
-    if (brand) brands.add(brand);
-    const band = pieceBand(facet.pieceCount);
-    if (band !== undefined) bands.add(band);
-    for (const key of normaliseKeys(facet.categoryKeys)) categories.add(key);
-  }
-  return { brands, bands, categories };
-};
+const buildAffinity = (signals: MemberSignals): Affinity => {};
 
 // A candidate's facet score plus the reason for its single strongest contribution. Reasons are
killedBy: recommendPuzzles facet affinity scores same-brand candidates highest and reports sameBrand
statusReason: Cannot read properties of undefined (reading 'brands')

[Killed] BlockStatement
src/insights/recommendations.ts:92:39
   const brands = new Set<string>();
   const bands = new Set<number>();
   const categories = new Set<string>();
-  for (const facet of signals.facets) {
-    const brand = normaliseBrand(facet.brand);
-    if (brand) brands.add(brand);
-    const band = pieceBand(facet.pieceCount);
-    if (band !== undefined) bands.add(band);
-    for (const key of normaliseKeys(facet.categoryKeys)) categories.add(key);
-  }
+  for (const facet of signals.facets) {}
   return { brands, bands, categories };
 };
killedBy: recommendPuzzles facet affinity scores same-brand candidates highest and reports sameBrand
statusReason: expected { key: 'same-band', score: +0, …(1) } to deeply equal { key: 'same-brand', score: 3, …(1) }

[Killed] ConditionalExpression
src/insights/recommendations.ts:94:9
   const categories = new Set<string>();
   for (const facet of signals.facets) {
     const brand = normaliseBrand(facet.brand);
-    if (brand) brands.add(brand);
+    if (false) brands.add(brand);
     const band = pieceBand(facet.pieceCount);
     if (band !== undefined) bands.add(band);
killedBy: recommendPuzzles facet affinity scores same-brand candidates highest and reports sameBrand
statusReason: expected { key: 'same-band', score: 1, …(1) } to deeply equal { key: 'same-brand', score: 3, …(1) }

[Survived] ConditionalExpression
src/insights/recommendations.ts:94:9
   const categories = new Set<string>();
   for (const facet of signals.facets) {
     const brand = normaliseBrand(facet.brand);
-    if (brand) brands.add(brand);
+    if (true) brands.add(brand);
     const band = pieceBand(facet.pieceCount);
     if (band !== undefined) bands.add(band);

[Killed] EqualityOperator
src/insights/recommendations.ts:96:9
     const brand = normaliseBrand(facet.brand);
     if (brand) brands.add(brand);
     const band = pieceBand(facet.pieceCount);
-    if (band !== undefined) bands.add(band);
+    if (band === undefined) bands.add(band);
     for (const key of normaliseKeys(facet.categoryKeys)) categories.add(key);
   }
killedBy: recommendPuzzles facet affinity scores same-brand candidates highest and reports sameBrand
statusReason: expected { key: 'same-band', score: +0, …(1) } to deeply equal { key: 'same-band', score: 1, …(1) }

[Killed] ConditionalExpression
src/insights/recommendations.ts:96:9
     const brand = normaliseBrand(facet.brand);
     if (brand) brands.add(brand);
     const band = pieceBand(facet.pieceCount);
-    if (band !== undefined) bands.add(band);
+    if (false) bands.add(band);
     for (const key of normaliseKeys(facet.categoryKeys)) categories.add(key);
   }
killedBy: recommendPuzzles facet affinity scores same-brand candidates highest and reports sameBrand
statusReason: expected { key: 'same-band', score: +0, …(1) } to deeply equal { key: 'same-band', score: 1, …(1) }

[Killed] ConditionalExpression
src/insights/recommendations.ts:119:7
   let reason: RecommendationReason = "popular";
 
   const brand = normaliseBrand(candidate.brand);
-  if (brand && affinity.brands.has(brand)) {
+  if (false) {
     facetScore += WEIGHT_BRAND;
     reason = "sameBrand";
killedBy: recommendPuzzles facet affinity scores same-brand candidates highest and reports sameBrand
statusReason: expected { key: 'same-band', score: 1, …(1) } to deeply equal { key: 'same-brand', score: 3, …(1) }

[Killed] LogicalOperator
src/insights/recommendations.ts:119:7
   let reason: RecommendationReason = "popular";
 
   const brand = normaliseBrand(candidate.brand);
-  if (brand && affinity.brands.has(brand)) {
+  if (brand || affinity.brands.has(brand)) {
     facetScore += WEIGHT_BRAND;
     reason = "sameBrand";
killedBy: recommendPuzzles facet affinity scores same-brand candidates highest and reports sameBrand
statusReason: expected { key: 'same-band', score: 4, …(1) } to deeply equal { key: 'same-brand', score: 3, …(1) }

[Killed] AssignmentOperator
src/insights/recommendations.ts:120:5
 
   const brand = normaliseBrand(candidate.brand);
   if (brand && affinity.brands.has(brand)) {
-    facetScore += WEIGHT_BRAND;
+    facetScore -= WEIGHT_BRAND;
     reason = "sameBrand";
   }
killedBy: recommendPuzzles facet affinity scores same-brand candidates highest and reports sameBrand
statusReason: expected { key: 'same-band', score: 1, …(1) } to deeply equal { key: 'same-brand', score: 3, …(1) }

[Killed] StringLiteral
src/insights/recommendations.ts:121:14
   const brand = normaliseBrand(candidate.brand);
   if (brand && affinity.brands.has(brand)) {
     facetScore += WEIGHT_BRAND;
-    reason = "sameBrand";
+    reason = "";
   }
 
killedBy: recommendPuzzles facet affinity scores same-brand candidates highest and reports sameBrand
statusReason: expected { key: 'same-brand', score: 3, …(1) } to deeply equal { key: 'same-brand', score: 3, …(1) }

[Killed] MethodExpression
src/insights/recommendations.ts:124:26
     reason = "sameBrand";
   }
 
-  const sharesCategory = normaliseKeys(candidate.categoryKeys).some((k) =>
-    affinity.categories.has(k),
-  );
+  const sharesCategory = normaliseKeys(candidate.categoryKeys).every(k => affinity.categories.has(k));
   if (sharesCategory) {
     facetScore += WEIGHT_CATEGORY;
killedBy: recommendPuzzles facet affinity scores same-brand candidates highest and reports sameBrand
statusReason: expected { key: 'same-brand', score: 5, …(1) } to deeply equal { key: 'same-brand', score: 3, …(1) }

[Killed] ArrowFunction
src/insights/recommendations.ts:124:69
     reason = "sameBrand";
   }
 
-  const sharesCategory = normaliseKeys(candidate.categoryKeys).some((k) =>
-    affinity.categories.has(k),
+  const sharesCategory = normaliseKeys(candidate.categoryKeys).some(() => undefined,
   );
   if (sharesCategory) {
killedBy: recommendPuzzles facet affinity scores shared category/tag overlap and reports sharedCategory
statusReason: expected { key: 'disjoint', score: +0, …(1) } to deeply equal { key: 'overlap', score: 2, …(1) }

[Killed] BlockStatement
src/insights/recommendations.ts:127:23
   const sharesCategory = normaliseKeys(candidate.categoryKeys).some((k) =>
     affinity.categories.has(k),
   );
-  if (sharesCategory) {
-    facetScore += WEIGHT_CATEGORY;
-    if (reason === "popular") reason = "sharedCategory";
-  }
+  if (sharesCategory) {}
 
   const band = pieceBand(candidate.pieceCount);
killedBy: recommendPuzzles facet affinity scores shared category/tag overlap and reports sharedCategory
statusReason: expected { key: 'disjoint', score: +0, …(1) } to deeply equal { key: 'overlap', score: 2, …(1) }

[Killed] ConditionalExpression
src/insights/recommendations.ts:127:7
   const sharesCategory = normaliseKeys(candidate.categoryKeys).some((k) =>
     affinity.categories.has(k),
   );
-  if (sharesCategory) {
+  if (true) {
     facetScore += WEIGHT_CATEGORY;
     if (reason === "popular") reason = "sharedCategory";
killedBy: recommendPuzzles facet affinity scores same-brand candidates highest and reports sameBrand
statusReason: expected { key: 'same-brand', score: 5, …(1) } to deeply equal { key: 'same-brand', score: 3, …(1) }

[Killed] AssignmentOperator
src/insights/recommendations.ts:128:5
     affinity.categories.has(k),
   );
   if (sharesCategory) {
-    facetScore += WEIGHT_CATEGORY;
+    facetScore -= WEIGHT_CATEGORY;
     if (reason === "popular") reason = "sharedCategory";
   }
killedBy: recommendPuzzles facet affinity scores shared category/tag overlap and reports sharedCategory
statusReason: expected { key: 'disjoint', score: +0, …(1) } to deeply equal { key: 'overlap', score: 2, …(1) }

[Killed] ConditionalExpression
src/insights/recommendations.ts:129:9
   );
   if (sharesCategory) {
     facetScore += WEIGHT_CATEGORY;
-    if (reason === "popular") reason = "sharedCategory";
+    if (true) reason = "sharedCategory";
   }
 
killedBy: recommendPuzzles facet affinity sums overlapping facets and reports the strongest (brand > category > pieces)
statusReason: expected { key: 'triple', score: 6, …(1) } to deeply equal { key: 'triple', score: 6, …(1) }

[Killed] EqualityOperator
src/insights/recommendations.ts:129:9
   );
   if (sharesCategory) {
     facetScore += WEIGHT_CATEGORY;
-    if (reason === "popular") reason = "sharedCategory";
+    if (reason !== "popular") reason = "sharedCategory";
   }
 
killedBy: recommendPuzzles facet affinity scores shared category/tag overlap and reports sharedCategory
statusReason: expected { key: 'overlap', score: 2, …(1) } to deeply equal { key: 'overlap', score: 2, …(1) }

[Killed] ConditionalExpression
src/insights/recommendations.ts:133:7
   }
 
   const band = pieceBand(candidate.pieceCount);
-  if (band !== undefined && affinity.bands.has(band)) {
+  if (true) {
     facetScore += WEIGHT_PIECE_BAND;
     if (reason === "popular") reason = "similarPieceCount";
killedBy: recommendPuzzles facet affinity scores same-brand candidates highest and reports sameBrand
statusReason: expected { key: 'same-brand', score: 4, …(1) } to deeply equal { key: 'same-brand', score: 3, …(1) }

[Killed] LogicalOperator
src/insights/recommendations.ts:133:7
   }
 
   const band = pieceBand(candidate.pieceCount);
-  if (band !== undefined && affinity.bands.has(band)) {
+  if (band !== undefined || affinity.bands.has(band)) {
     facetScore += WEIGHT_PIECE_BAND;
     if (reason === "popular") reason = "similarPieceCount";
killedBy: recommendPuzzles facet affinity scores same-brand candidates highest and reports sameBrand
statusReason: expected { key: 'same-brand', score: 4, …(1) } to deeply equal { key: 'same-brand', score: 3, …(1) }

[Killed] AssignmentOperator
src/insights/recommendations.ts:134:5
 
   const band = pieceBand(candidate.pieceCount);
   if (band !== undefined && affinity.bands.has(band)) {
-    facetScore += WEIGHT_PIECE_BAND;
+    facetScore -= WEIGHT_PIECE_BAND;
     if (reason === "popular") reason = "similarPieceCount";
   }
killedBy: recommendPuzzles facet affinity scores same-brand candidates highest and reports sameBrand
statusReason: expected { key: 'same-band', score: -1, …(1) } to deeply equal { key: 'same-band', score: 1, …(1) }

[Killed] EqualityOperator
src/insights/recommendations.ts:135:9
   const band = pieceBand(candidate.pieceCount);
   if (band !== undefined && affinity.bands.has(band)) {
     facetScore += WEIGHT_PIECE_BAND;
-    if (reason === "popular") reason = "similarPieceCount";
+    if (reason !== "popular") reason = "similarPieceCount";
   }
 
killedBy: recommendPuzzles facet affinity scores same-brand candidates highest and reports sameBrand
statusReason: expected { key: 'same-band', score: 1, …(1) } to deeply equal { key: 'same-band', score: 1, …(1) }

[Killed] ConditionalExpression
src/insights/recommendations.ts:135:9
   const band = pieceBand(candidate.pieceCount);
   if (band !== undefined && affinity.bands.has(band)) {
     facetScore += WEIGHT_PIECE_BAND;
-    if (reason === "popular") reason = "similarPieceCount";
+    if (false) reason = "similarPieceCount";
   }
 
killedBy: recommendPuzzles facet affinity scores same-brand candidates highest and reports sameBrand
statusReason: expected { key: 'same-band', score: 1, …(1) } to deeply equal { key: 'same-band', score: 1, …(1) }

[Killed] ObjectLiteral
src/insights/recommendations.ts:138:10
     if (reason === "popular") reason = "similarPieceCount";
   }
 
-  return { facetScore, reason };
+  return {};
 };
 
killedBy: recommendPuzzles facet affinity scores same-brand candidates highest and reports sameBrand
statusReason: expected { key: 'same-band', score: NaN, …(1) } to deeply equal { key: 'same-brand', score: 3, …(1) }

[Killed] BlockStatement
src/insights/recommendations.ts:146:14
 const popularityTiebreak = (
   popularity: number | undefined,
   maxPopularity: number,
-): number => {
-  if (maxPopularity <= 0) return 0;
-  const p = typeof popularity === "number" && popularity > 0 ? popularity : 0;
-  return (p / maxPopularity) * POPULARITY_TIEBREAK_MAX;
-};
+): number => {};
 
 // Rank catalog candidates by how well they fit the member's revealed taste. Owned candidates are
killedBy: recommendPuzzles facet affinity scores same-brand candidates highest and reports sameBrand
statusReason: expected { key: 'same-band', score: NaN, …(1) } to deeply equal { key: 'same-brand', score: 3, …(1) }

[Killed] EqualityOperator
src/insights/recommendations.ts:147:7
   popularity: number | undefined,
   maxPopularity: number,
 ): number => {
-  if (maxPopularity <= 0) return 0;
+  if (maxPopularity > 0) return 0;
   const p = typeof popularity === "number" && popularity > 0 ? popularity : 0;
   return (p / maxPopularity) * POPULARITY_TIEBREAK_MAX;
killedBy: recommendPuzzles facet affinity scores same-brand candidates highest and reports sameBrand
statusReason: expected { key: 'same-band', score: NaN, …(1) } to deeply equal { key: 'same-brand', score: 3, …(1) }

[Killed] EqualityOperator
src/insights/recommendations.ts:147:7
   popularity: number | undefined,
   maxPopularity: number,
 ): number => {
-  if (maxPopularity <= 0) return 0;
+  if (maxPopularity < 0) return 0;
   const p = typeof popularity === "number" && popularity > 0 ? popularity : 0;
   return (p / maxPopularity) * POPULARITY_TIEBREAK_MAX;
killedBy: recommendPuzzles facet affinity scores same-brand candidates highest and reports sameBrand
statusReason: expected { key: 'same-band', score: NaN, …(1) } to deeply equal { key: 'same-brand', score: 3, …(1) }

[Killed] LogicalOperator
src/insights/recommendations.ts:148:13
   maxPopularity: number,
 ): number => {
   if (maxPopularity <= 0) return 0;
-  const p = typeof popularity === "number" && popularity > 0 ? popularity : 0;
+  const p = typeof popularity === "number" || popularity > 0 ? popularity : 0;
   return (p / maxPopularity) * POPULARITY_TIEBREAK_MAX;
 };
killedBy: recommendPuzzles popularity tiebreak scoring ignores non-positive popularity (a negative count adds no tiebreak)
statusReason: expected -0.4995 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/insights/recommendations.ts:148:13
   maxPopularity: number,
 ): number => {
   if (maxPopularity <= 0) return 0;
-  const p = typeof popularity === "number" && popularity > 0 ? popularity : 0;
+  const p = true ? popularity : 0;
   return (p / maxPopularity) * POPULARITY_TIEBREAK_MAX;
 };
killedBy: recommendPuzzles popularity uses popularity only as a sub-point tiebreak, never overtaking a facet tier
statusReason: expected 'popular-nomatch' to be 'weak-facet' // Object.is equality

[Killed] ArithmeticOperator
src/insights/recommendations.ts:149:11
 ): number => {
   if (maxPopularity <= 0) return 0;
   const p = typeof popularity === "number" && popularity > 0 ? popularity : 0;
-  return (p / maxPopularity) * POPULARITY_TIEBREAK_MAX;
+  return (p * maxPopularity) * POPULARITY_TIEBREAK_MAX;
 };
 
killedBy: recommendPuzzles popularity uses popularity only as a sub-point tiebreak, never overtaking a facet tier
statusReason: expected 'popular-nomatch' to be 'weak-facet' // Object.is equality

[Killed] ArithmeticOperator
src/insights/recommendations.ts:149:10
 ): number => {
   if (maxPopularity <= 0) return 0;
   const p = typeof popularity === "number" && popularity > 0 ? popularity : 0;
-  return (p / maxPopularity) * POPULARITY_TIEBREAK_MAX;
+  return p / maxPopularity / POPULARITY_TIEBREAK_MAX;
 };
 
killedBy: recommendPuzzles popularity uses popularity only as a sub-point tiebreak, never overtaking a facet tier
statusReason: expected 1.001001001001001 to be less than 1

[Killed] MethodExpression
src/insights/recommendations.ts:162:20
   const affinity = buildAffinity(input.signals);
   const owned = new Set(normaliseKeys(input.ownedKeys));
 
-  const eligible = input.candidates.filter(
-    (c) => c.key.length > 0 && !owned.has(c.key.trim().toLowerCase()),
-  );
+  const eligible = input.candidates;
 
   const maxPopularity = eligible.reduce(
killedBy: recommendPuzzles owned exclusion excludes candidates whose key is in ownedKeys
statusReason: expected [ 'new', 'owned' ] to deeply equal [ 'new' ]

[Killed] MethodExpression
src/insights/recommendations.ts:163:43
   const owned = new Set(normaliseKeys(input.ownedKeys));
 
   const eligible = input.candidates.filter(
-    (c) => c.key.length > 0 && !owned.has(c.key.trim().toLowerCase()),
+    (c) => c.key.length > 0 && !owned.has(c.key.toLowerCase()),
   );
 
killedBy: recommendPuzzles excludes an owned candidate even when its key has surrounding whitespace
statusReason: expected [ { key: '  abc  ', …(2) } ] to deeply equal []

[Killed] ConditionalExpression
src/insights/recommendations.ts:163:12
   const owned = new Set(normaliseKeys(input.ownedKeys));
 
   const eligible = input.candidates.filter(
-    (c) => c.key.length > 0 && !owned.has(c.key.trim().toLowerCase()),
+    (c) => false,
   );
 
killedBy: recommendPuzzles facet affinity scores same-brand candidates highest and reports sameBrand
statusReason: expected undefined to deeply equal { key: 'same-brand', score: 3, …(1) }
