[Killed] StringLiteral
src/insights/trade-activity.ts:33:3
 // set (zeros included) and never reorders between renders.
 const STATUS_ORDER: readonly ExchangeStatStatus[] = [
   "proposed",
-  "accepted",
+  "",
   "completed",
   "rejected",
killedBy: computeTradeActivity returns zero-filled statuses (fixed order) and no months for empty input
statusReason: expected [ …(6) ] to deeply equal [ …(6) ]

[Killed] StringLiteral
src/insights/trade-activity.ts:35:3
   "proposed",
   "accepted",
   "completed",
-  "rejected",
+  "",
   "cancelled",
   "disputed",
killedBy: computeTradeActivity returns zero-filled statuses (fixed order) and no months for empty input
statusReason: expected [ …(6) ] to deeply equal [ …(6) ]

[Killed] BlockStatement
src/insights/trade-activity.ts:40:47
   "disputed",
 ];
 
-const monthKey = (epochMs: number): string => {
-  const d = new Date(epochMs);
-  return `${d.getUTCFullYear()}-${`${d.getUTCMonth() + 1}`.padStart(2, "0")}`;
-};
+const monthKey = (epochMs: number): string => {};
 
 // Summarise exchanges by status (all statuses present, zero-filled, fixed order) and by month
killedBy: computeTradeActivity groups by UTC month, only emitting active months, sorted oldest->newest
statusReason: expected [ { month: undefined, count: 4 } ] to deeply equal [ Array(3) ]

[Killed] ArithmeticOperator
src/insights/trade-activity.ts:42:38
 
 const monthKey = (epochMs: number): string => {
   const d = new Date(epochMs);
-  return `${d.getUTCFullYear()}-${`${d.getUTCMonth() + 1}`.padStart(2, "0")}`;
+  return `${d.getUTCFullYear()}-${`${d.getUTCMonth() - 1}`.padStart(2, "0")}`;
 };
 
killedBy: computeTradeActivity groups by UTC month, only emitting active months, sorted oldest->newest
statusReason: expected [ Array(3) ] to deeply equal [ Array(3) ]

[Killed] StringLiteral
src/insights/trade-activity.ts:42:10
 
 const monthKey = (epochMs: number): string => {
   const d = new Date(epochMs);
-  return `${d.getUTCFullYear()}-${`${d.getUTCMonth() + 1}`.padStart(2, "0")}`;
+  return ``;
 };
 
killedBy: computeTradeActivity groups by UTC month, only emitting active months, sorted oldest->newest
statusReason: expected [ { month: '', count: 4 } ] to deeply equal [ Array(3) ]

[Killed] BlockStatement
src/insights/trade-activity.ts:49:21
 // (only months with activity, sorted oldest→newest).
 export const computeTradeActivity = (
   exchanges: readonly ExchangeActivityInput[],
-): TradeActivity => {
-  const statusCounts = new Map<ExchangeStatStatus, number>(
-    STATUS_ORDER.map((s) => [s, 0]),
-  );
-  const monthCounts = new Map<string, number>();
-
-  for (const ex of exchanges) {
-    statusCounts.set(ex.status, (statusCounts.get(ex.status) ?? 0) + 1);
-    const key = monthKey(ex.createdAt);
-    monthCounts.set(key, (monthCounts.get(key) ?? 0) + 1);
-  }
-
-  return {
-    total: exchanges.length,
-    byStatus: STATUS_ORDER.map((status) => ({
-      status,
-      count: statusCounts.get(status) ?? 0,
-    })),
-    byMonth: [...monthCounts.entries()]
-      .map(([month, count]) => ({ month, count }))
-      .sort((a, b) => a.month.localeCompare(b.month)),
-  };
-};
+): TradeActivity => {};
 
killedBy: computeTradeActivity returns zero-filled statuses (fixed order) and no months for empty input
statusReason: Cannot read properties of undefined (reading 'total')

[Killed] ArrowFunction
src/insights/trade-activity.ts:51:22
   exchanges: readonly ExchangeActivityInput[],
 ): TradeActivity => {
   const statusCounts = new Map<ExchangeStatStatus, number>(
-    STATUS_ORDER.map((s) => [s, 0]),
+    STATUS_ORDER.map(() => undefined),
   );
   const monthCounts = new Map<string, number>();
killedBy: computeTradeActivity returns zero-filled statuses (fixed order) and no months for empty input
statusReason: Iterator value undefined is not an entry object

[Survived] ArrayDeclaration
src/insights/trade-activity.ts:51:29
   exchanges: readonly ExchangeActivityInput[],
 ): TradeActivity => {
   const statusCounts = new Map<ExchangeStatStatus, number>(
-    STATUS_ORDER.map((s) => [s, 0]),
+    STATUS_ORDER.map((s) => []),
   );
   const monthCounts = new Map<string, number>();

[Killed] BlockStatement
src/insights/trade-activity.ts:55:31
   );
   const monthCounts = new Map<string, number>();
 
-  for (const ex of exchanges) {
-    statusCounts.set(ex.status, (statusCounts.get(ex.status) ?? 0) + 1);
-    const key = monthKey(ex.createdAt);
-    monthCounts.set(key, (monthCounts.get(key) ?? 0) + 1);
-  }
+  for (const ex of exchanges) {}
 
   return {
killedBy: computeTradeActivity counts by status while keeping the full fixed status order
statusReason: expected [ …(6) ] to deeply equal [ …(6) ]

[Killed] LogicalOperator
src/insights/trade-activity.ts:56:34
   const monthCounts = new Map<string, number>();
 
   for (const ex of exchanges) {
-    statusCounts.set(ex.status, (statusCounts.get(ex.status) ?? 0) + 1);
+    statusCounts.set(ex.status, (statusCounts.get(ex.status) && 0) + 1);
     const key = monthKey(ex.createdAt);
     monthCounts.set(key, (monthCounts.get(key) ?? 0) + 1);
killedBy: computeTradeActivity counts by status while keeping the full fixed status order
statusReason: expected [ …(6) ] to deeply equal [ …(6) ]

[Killed] ArithmeticOperator
src/insights/trade-activity.ts:56:33
   const monthCounts = new Map<string, number>();
 
   for (const ex of exchanges) {
-    statusCounts.set(ex.status, (statusCounts.get(ex.status) ?? 0) + 1);
+    statusCounts.set(ex.status, (statusCounts.get(ex.status) ?? 0) - 1);
     const key = monthKey(ex.createdAt);
     monthCounts.set(key, (monthCounts.get(key) ?? 0) + 1);
killedBy: computeTradeActivity counts by status while keeping the full fixed status order
statusReason: expected [ …(6) ] to deeply equal [ …(6) ]

[Killed] ArithmeticOperator
src/insights/trade-activity.ts:58:26
   for (const ex of exchanges) {
     statusCounts.set(ex.status, (statusCounts.get(ex.status) ?? 0) + 1);
     const key = monthKey(ex.createdAt);
-    monthCounts.set(key, (monthCounts.get(key) ?? 0) + 1);
+    monthCounts.set(key, (monthCounts.get(key) ?? 0) - 1);
   }
 
killedBy: computeTradeActivity groups by UTC month, only emitting active months, sorted oldest->newest
statusReason: expected [ …(3) ] to deeply equal [ Array(3) ]

[Killed] LogicalOperator
src/insights/trade-activity.ts:58:27
   for (const ex of exchanges) {
     statusCounts.set(ex.status, (statusCounts.get(ex.status) ?? 0) + 1);
     const key = monthKey(ex.createdAt);
-    monthCounts.set(key, (monthCounts.get(key) ?? 0) + 1);
+    monthCounts.set(key, (monthCounts.get(key) && 0) + 1);
   }
 
killedBy: computeTradeActivity groups by UTC month, only emitting active months, sorted oldest->newest
statusReason: expected [ …(3) ] to deeply equal [ Array(3) ]

[Killed] ArrowFunction
src/insights/trade-activity.ts:63:32
 
   return {
     total: exchanges.length,
-    byStatus: STATUS_ORDER.map((status) => ({
-      status,
-      count: statusCounts.get(status) ?? 0,
-    })),
+    byStatus: STATUS_ORDER.map(() => undefined),
     byMonth: [...monthCounts.entries()]
       .map(([month, count]) => ({ month, count }))
killedBy: computeTradeActivity returns zero-filled statuses (fixed order) and no months for empty input
statusReason: expected [ undefined, undefined, …(4) ] to deeply equal [ …(6) ]

[Killed] LogicalOperator
src/insights/trade-activity.ts:65:14
     total: exchanges.length,
     byStatus: STATUS_ORDER.map((status) => ({
       status,
-      count: statusCounts.get(status) ?? 0,
+      count: statusCounts.get(status) && 0,
     })),
     byMonth: [...monthCounts.entries()]
killedBy: computeTradeActivity counts by status while keeping the full fixed status order
statusReason: expected [ …(6) ] to deeply equal [ …(6) ]

[Killed] MethodExpression
src/insights/trade-activity.ts:67:14
       status,
       count: statusCounts.get(status) ?? 0,
     })),
-    byMonth: [...monthCounts.entries()]
-      .map(([month, count]) => ({ month, count }))
-      .sort((a, b) => a.month.localeCompare(b.month)),
+    byMonth: [...monthCounts.entries()].map(([month, count]) => ({
+  month,
+  count
+})),
   };
 };
killedBy: computeTradeActivity groups by UTC month, only emitting active months, sorted oldest->newest
statusReason: expected [ Array(3) ] to deeply equal [ Array(3) ]

[Killed] ArrowFunction
src/insights/trade-activity.ts:68:12
       count: statusCounts.get(status) ?? 0,
     })),
     byMonth: [...monthCounts.entries()]
-      .map(([month, count]) => ({ month, count }))
+      .map(() => undefined)
       .sort((a, b) => a.month.localeCompare(b.month)),
   };
killedBy: computeTradeActivity groups by UTC month, only emitting active months, sorted oldest->newest
statusReason: expected [ undefined, undefined, undefined ] to deeply equal [ Array(3) ]

[Killed] ObjectLiteral
src/insights/trade-activity.ts:68:33
       count: statusCounts.get(status) ?? 0,
     })),
     byMonth: [...monthCounts.entries()]
-      .map(([month, count]) => ({ month, count }))
+      .map(([month, count]) => ({}))
       .sort((a, b) => a.month.localeCompare(b.month)),
   };
killedBy: computeTradeActivity groups by UTC month, only emitting active months, sorted oldest->newest
statusReason: Cannot read properties of undefined (reading 'localeCompare')

[Killed] ArrowFunction
src/insights/trade-activity.ts:69:13
     })),
     byMonth: [...monthCounts.entries()]
       .map(([month, count]) => ({ month, count }))
-      .sort((a, b) => a.month.localeCompare(b.month)),
+      .sort(() => undefined),
   };
 };
killedBy: computeTradeActivity groups by UTC month, only emitting active months, sorted oldest->newest
statusReason: expected [ Array(3) ] to deeply equal [ Array(3) ]
