[Killed] ArrowFunction
library/application/use-cases/add-copy-to-collection.ts:23:3
 // member to own the collection and the copy to belong to the same owner; then delegate the
 // structural rule (no copies in a wishlist) + de-dup to the aggregate.
 export const makeAddCopyToCollection =
-  (deps: AddCopyToCollectionDeps): AddCopyToCollection =>
-  async (cmd: CollectionMembershipCommand) => {
-    const collection = await deps.collections.findById(cmd.collectionId);
-    if (!collection)
-      return err(LibraryApplicationError.collectionNotFound(cmd.collectionId));
-    if (collection.ownerId !== cmd.actingMemberId) {
-      return err(LibraryError.notOwner("modify this collection"));
-    }
-
-    const copy = await deps.copies.findById(cmd.copyId);
-    if (!copy) return err(LibraryApplicationError.copyNotFound(cmd.copyId));
-    if (copy.ownerId !== collection.ownerId) {
-      return err(LibraryApplicationError.notCopyOwner(cmd.copyId));
-    }
-
-    const outcome = collection.addCopy(cmd.copyId, deps.clock.now());
-    if (outcome.isErr) return err(outcome.error);
-
-    await deps.collections.save(collection);
-    await deps.events.publish(collection.pullEvents());
-    return ok(undefined);
-  };
+  () => undefined;
 
killedBy: collection membership use cases makeAddCopyToCollection adds the owner's own copy and publishes CopyAddedToCollection
statusReason: run(...) is not a function

[Killed] BlockStatement
library/application/use-cases/add-copy-to-collection.ts:24:47
 // structural rule (no copies in a wishlist) + de-dup to the aggregate.
 export const makeAddCopyToCollection =
   (deps: AddCopyToCollectionDeps): AddCopyToCollection =>
-  async (cmd: CollectionMembershipCommand) => {
-    const collection = await deps.collections.findById(cmd.collectionId);
-    if (!collection)
-      return err(LibraryApplicationError.collectionNotFound(cmd.collectionId));
-    if (collection.ownerId !== cmd.actingMemberId) {
-      return err(LibraryError.notOwner("modify this collection"));
-    }
-
-    const copy = await deps.copies.findById(cmd.copyId);
-    if (!copy) return err(LibraryApplicationError.copyNotFound(cmd.copyId));
-    if (copy.ownerId !== collection.ownerId) {
-      return err(LibraryApplicationError.notCopyOwner(cmd.copyId));
-    }
-
-    const outcome = collection.addCopy(cmd.copyId, deps.clock.now());
-    if (outcome.isErr) return err(outcome.error);
-
-    await deps.collections.save(collection);
-    await deps.events.publish(collection.pullEvents());
-    return ok(undefined);
-  };
+  async (cmd: CollectionMembershipCommand) => {};
 
killedBy: collection membership use cases makeAddCopyToCollection adds the owner's own copy and publishes CopyAddedToCollection
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] ConditionalExpression
library/application/use-cases/add-copy-to-collection.ts:26:9
   (deps: AddCopyToCollectionDeps): AddCopyToCollection =>
   async (cmd: CollectionMembershipCommand) => {
     const collection = await deps.collections.findById(cmd.collectionId);
-    if (!collection)
+    if (false)
       return err(LibraryApplicationError.collectionNotFound(cmd.collectionId));
     if (collection.ownerId !== cmd.actingMemberId) {
killedBy: collection membership use cases makeAddCopyToCollection rejects an unknown collection
statusReason: Cannot read properties of null (reading 'ownerId')

[Killed] BooleanLiteral
library/application/use-cases/add-copy-to-collection.ts:26:9
   (deps: AddCopyToCollectionDeps): AddCopyToCollection =>
   async (cmd: CollectionMembershipCommand) => {
     const collection = await deps.collections.findById(cmd.collectionId);
-    if (!collection)
+    if (collection)
       return err(LibraryApplicationError.collectionNotFound(cmd.collectionId));
     if (collection.ownerId !== cmd.actingMemberId) {
killedBy: collection membership use cases makeAddCopyToCollection adds the owner's own copy and publishes CopyAddedToCollection
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
library/application/use-cases/add-copy-to-collection.ts:28:9
     const collection = await deps.collections.findById(cmd.collectionId);
     if (!collection)
       return err(LibraryApplicationError.collectionNotFound(cmd.collectionId));
-    if (collection.ownerId !== cmd.actingMemberId) {
+    if (collection.ownerId === cmd.actingMemberId) {
       return err(LibraryError.notOwner("modify this collection"));
     }
killedBy: collection membership use cases makeAddCopyToCollection adds the owner's own copy and publishes CopyAddedToCollection
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
library/application/use-cases/add-copy-to-collection.ts:28:52
     const collection = await deps.collections.findById(cmd.collectionId);
     if (!collection)
       return err(LibraryApplicationError.collectionNotFound(cmd.collectionId));
-    if (collection.ownerId !== cmd.actingMemberId) {
-      return err(LibraryError.notOwner("modify this collection"));
-    }
+    if (collection.ownerId !== cmd.actingMemberId) {}
 
     const copy = await deps.copies.findById(cmd.copyId);
killedBy: collection membership use cases makeAddCopyToCollection rejects when the acting member does not own the collection
statusReason: expected 'NotCopyOwner' to be 'NotOwner' // Object.is equality

[Killed] ConditionalExpression
library/application/use-cases/add-copy-to-collection.ts:33:9
     }
 
     const copy = await deps.copies.findById(cmd.copyId);
-    if (!copy) return err(LibraryApplicationError.copyNotFound(cmd.copyId));
+    if (false) return err(LibraryApplicationError.copyNotFound(cmd.copyId));
     if (copy.ownerId !== collection.ownerId) {
       return err(LibraryApplicationError.notCopyOwner(cmd.copyId));
killedBy: collection membership use cases makeAddCopyToCollection rejects an unknown copy
statusReason: Cannot read properties of null (reading 'ownerId')

[Killed] ConditionalExpression
library/application/use-cases/add-copy-to-collection.ts:34:9
 
     const copy = await deps.copies.findById(cmd.copyId);
     if (!copy) return err(LibraryApplicationError.copyNotFound(cmd.copyId));
-    if (copy.ownerId !== collection.ownerId) {
+    if (false) {
       return err(LibraryApplicationError.notCopyOwner(cmd.copyId));
     }
killedBy: collection membership use cases makeAddCopyToCollection rejects adding a copy owned by someone else (ownership enforcement)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
library/application/use-cases/add-copy-to-collection.ts:34:9
 
     const copy = await deps.copies.findById(cmd.copyId);
     if (!copy) return err(LibraryApplicationError.copyNotFound(cmd.copyId));
-    if (copy.ownerId !== collection.ownerId) {
+    if (true) {
       return err(LibraryApplicationError.notCopyOwner(cmd.copyId));
     }
killedBy: collection membership use cases makeAddCopyToCollection adds the owner's own copy and publishes CopyAddedToCollection
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
library/application/use-cases/add-copy-to-collection.ts:39:9
     }
 
     const outcome = collection.addCopy(cmd.copyId, deps.clock.now());
-    if (outcome.isErr) return err(outcome.error);
+    if (false) return err(outcome.error);
 
     await deps.collections.save(collection);
killedBy: collection membership use cases makeAddCopyToCollection surfaces the aggregate's WrongMemberType when adding a copy to a wishlist
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
library/application/use-cases/add-copy-to-collection.ts:39:9
     }
 
     const outcome = collection.addCopy(cmd.copyId, deps.clock.now());
-    if (outcome.isErr) return err(outcome.error);
+    if (true) return err(outcome.error);
 
     await deps.collections.save(collection);
killedBy: collection membership use cases makeAddCopyToCollection adds the owner's own copy and publishes CopyAddedToCollection
statusReason: expected false to be true // Object.is equality
