[Killed] ArrowFunction
library/application/use-cases/create-personal-category.ts:20:3
 
 // Transaction script: enforce (owner, name) uniqueness, create the aggregate, persist, publish.
 export const makeCreatePersonalCategory =
-  (deps: CreatePersonalCategoryDeps): CreatePersonalCategory =>
-  async (cmd: CreatePersonalCategoryCommand) => {
-    const existing = await deps.categories.findByOwnerAndName(
-      cmd.ownerId,
-      cmd.name,
-    );
-    if (existing)
-      return err(LibraryApplicationError.duplicateCollectionName(cmd.name));
-
-    const category = PersonalCategory.create({
-      id: deps.ids.next(),
-      ownerId: cmd.ownerId,
-      name: cmd.name,
-      color: cmd.color,
-      description: cmd.description,
-      now: deps.clock.now(),
-    });
-    if (category.isErr) return err(category.error);
-
-    await deps.categories.save(category.value);
-    await deps.events.publish(category.value.pullEvents());
-    return ok(category.value.id);
-  };
+  () => undefined;
 
killedBy: makeCreatePersonalCategory creates a category and publishes PersonalCategoryCreated
statusReason: run(...) is not a function

[Killed] BlockStatement
library/application/use-cases/create-personal-category.ts:21:49
 // Transaction script: enforce (owner, name) uniqueness, create the aggregate, persist, publish.
 export const makeCreatePersonalCategory =
   (deps: CreatePersonalCategoryDeps): CreatePersonalCategory =>
-  async (cmd: CreatePersonalCategoryCommand) => {
-    const existing = await deps.categories.findByOwnerAndName(
-      cmd.ownerId,
-      cmd.name,
-    );
-    if (existing)
-      return err(LibraryApplicationError.duplicateCollectionName(cmd.name));
-
-    const category = PersonalCategory.create({
-      id: deps.ids.next(),
-      ownerId: cmd.ownerId,
-      name: cmd.name,
-      color: cmd.color,
-      description: cmd.description,
-      now: deps.clock.now(),
-    });
-    if (category.isErr) return err(category.error);
-
-    await deps.categories.save(category.value);
-    await deps.events.publish(category.value.pullEvents());
-    return ok(category.value.id);
-  };
+  async (cmd: CreatePersonalCategoryCommand) => {};
 
killedBy: makeCreatePersonalCategory creates a category and publishes PersonalCategoryCreated
statusReason: Cannot read properties of undefined (reading 'isOk')
