[Killed] ArrowFunction
library/application/use-cases/delete-collection.ts:19:3
 // Transaction script: load (→ CollectionNotFound), require ownership, let the aggregate guard
 // the default-collection invariant (→ CannotDeleteDefaultCollection), then remove + publish.
 export const makeDeleteCollection =
-  (deps: DeleteCollectionDeps): DeleteCollection =>
-  async (cmd: DeleteCollectionCommand) => {
-    const collection = await deps.collections.findById(cmd.collectionId);
-    if (!collection)
-      return err(LibraryApplicationError.collectionNotFound(cmd.collectionId));
-    if (collection.ownerId !== cmd.actingMemberId) {
-      return err(LibraryError.notOwner("delete this collection"));
-    }
-
-    const outcome = collection.delete(deps.clock.now());
-    if (outcome.isErr) return err(outcome.error);
-
-    await deps.collections.remove(collection.id);
-    await deps.events.publish(collection.pullEvents());
-    return ok(undefined);
-  };
+  () => undefined;
 
killedBy: collection membership use cases makeDeleteCollection deletes a non-default collection and publishes CollectionDeleted
statusReason: run(...) is not a function

[Killed] BlockStatement
library/application/use-cases/delete-collection.ts:20:43
 // the default-collection invariant (→ CannotDeleteDefaultCollection), then remove + publish.
 export const makeDeleteCollection =
   (deps: DeleteCollectionDeps): DeleteCollection =>
-  async (cmd: DeleteCollectionCommand) => {
-    const collection = await deps.collections.findById(cmd.collectionId);
-    if (!collection)
-      return err(LibraryApplicationError.collectionNotFound(cmd.collectionId));
-    if (collection.ownerId !== cmd.actingMemberId) {
-      return err(LibraryError.notOwner("delete this collection"));
-    }
-
-    const outcome = collection.delete(deps.clock.now());
-    if (outcome.isErr) return err(outcome.error);
-
-    await deps.collections.remove(collection.id);
-    await deps.events.publish(collection.pullEvents());
-    return ok(undefined);
-  };
+  async (cmd: DeleteCollectionCommand) => {};
 
killedBy: collection membership use cases makeDeleteCollection deletes a non-default collection and publishes CollectionDeleted
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] BlockStatement
library/application/use-cases/delete-collection.ts:24:52
     const collection = await deps.collections.findById(cmd.collectionId);
     if (!collection)
       return err(LibraryApplicationError.collectionNotFound(cmd.collectionId));
-    if (collection.ownerId !== cmd.actingMemberId) {
-      return err(LibraryError.notOwner("delete this collection"));
-    }
+    if (collection.ownerId !== cmd.actingMemberId) {}
 
     const outcome = collection.delete(deps.clock.now());
killedBy: collection membership use cases makeDeleteCollection rejects when the acting member does not own the collection
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
library/application/use-cases/delete-collection.ts:29:9
     }
 
     const outcome = collection.delete(deps.clock.now());
-    if (outcome.isErr) return err(outcome.error);
+    if (true) return err(outcome.error);
 
     await deps.collections.remove(collection.id);
killedBy: collection membership use cases makeDeleteCollection deletes a non-default collection and publishes CollectionDeleted
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
library/application/use-cases/delete-collection.ts:29:9
     }
 
     const outcome = collection.delete(deps.clock.now());
-    if (outcome.isErr) return err(outcome.error);
+    if (false) return err(outcome.error);
 
     await deps.collections.remove(collection.id);
killedBy: collection membership use cases makeDeleteCollection refuses to delete a default collection
statusReason: expected false to be true // Object.is equality
