[Killed] ArrowFunction
library/application/use-cases/delete-copy.ts:21:3
 // reserved by an active Exchange (→ CopyReserved, an APPLICATION-level rule that needs Exchange
 // state), then remove from the repository and publish the aggregate's CopyDeleted event.
 export const makeDeleteCopy =
-  (deps: DeleteCopyDeps): DeleteCopy =>
-  async (cmd: DeleteCopyCommand) => {
-    const copy = await deps.copies.findById(cmd.copyId);
-    if (!copy) return err(LibraryApplicationError.copyNotFound(cmd.copyId));
-    if (copy.ownerId !== cmd.actingMemberId) {
-      return err(LibraryError.notOwner("delete this copy"));
-    }
-
-    if (await deps.reservations.isReserved(cmd.copyId)) {
-      return err(LibraryApplicationError.copyReserved(cmd.copyId));
-    }
-
-    const outcome = copy.delete(deps.clock.now());
-    if (outcome.isErr) return err(outcome.error);
-
-    await deps.copies.remove(copy.id);
-    await deps.events.publish(copy.pullEvents());
-    return ok(undefined);
-  };
+  () => undefined;
 
killedBy: copy mutation use cases makeDeleteCopy removes the owner's copy and publishes CopyDeleted
statusReason: run(...) is not a function

[Killed] BlockStatement
library/application/use-cases/delete-copy.ts:22:37
 // state), then remove from the repository and publish the aggregate's CopyDeleted event.
 export const makeDeleteCopy =
   (deps: DeleteCopyDeps): DeleteCopy =>
-  async (cmd: DeleteCopyCommand) => {
-    const copy = await deps.copies.findById(cmd.copyId);
-    if (!copy) return err(LibraryApplicationError.copyNotFound(cmd.copyId));
-    if (copy.ownerId !== cmd.actingMemberId) {
-      return err(LibraryError.notOwner("delete this copy"));
-    }
-
-    if (await deps.reservations.isReserved(cmd.copyId)) {
-      return err(LibraryApplicationError.copyReserved(cmd.copyId));
-    }
-
-    const outcome = copy.delete(deps.clock.now());
-    if (outcome.isErr) return err(outcome.error);
-
-    await deps.copies.remove(copy.id);
-    await deps.events.publish(copy.pullEvents());
-    return ok(undefined);
-  };
+  async (cmd: DeleteCopyCommand) => {};
 
killedBy: copy mutation use cases makeDeleteCopy removes the owner's copy and publishes CopyDeleted
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] ConditionalExpression
library/application/use-cases/delete-copy.ts:29:9
       return err(LibraryError.notOwner("delete this copy"));
     }
 
-    if (await deps.reservations.isReserved(cmd.copyId)) {
+    if (true) {
       return err(LibraryApplicationError.copyReserved(cmd.copyId));
     }
killedBy: copy mutation use cases makeDeleteCopy removes the owner's copy and publishes CopyDeleted
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
library/application/use-cases/delete-copy.ts:29:57
       return err(LibraryError.notOwner("delete this copy"));
     }
 
-    if (await deps.reservations.isReserved(cmd.copyId)) {
-      return err(LibraryApplicationError.copyReserved(cmd.copyId));
-    }
+    if (await deps.reservations.isReserved(cmd.copyId)) {}
 
     const outcome = copy.delete(deps.clock.now());
killedBy: copy mutation use cases makeDeleteCopy refuses to delete a copy reserved by an active exchange (Exchange seam)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
library/application/use-cases/delete-copy.ts:34:9
     }
 
     const outcome = copy.delete(deps.clock.now());
-    if (outcome.isErr) return err(outcome.error);
+    if (true) return err(outcome.error);
 
     await deps.copies.remove(copy.id);
killedBy: copy mutation use cases makeDeleteCopy removes the owner's copy and publishes CopyDeleted
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
library/application/use-cases/delete-copy.ts:34:9
     }
 
     const outcome = copy.delete(deps.clock.now());
-    if (outcome.isErr) return err(outcome.error);
+    if (false) return err(outcome.error);
 
     await deps.copies.remove(copy.id);
