[Killed] ArrowFunction
library/application/use-cases/set-copy-cover.ts:20:3
 // aggregate, persist, publish. The "image belongs to this copy" check is a persistence-level
 // concern enforced in the Convex composition root (it needs the read model), not here.
 export const makeSetCopyCover =
-  (deps: SetCopyCoverDeps): SetCopyCover =>
-  async (cmd: SetCopyCoverCommand) => {
-    const copy = await deps.copies.findById(cmd.copyId);
-    if (!copy) return err(LibraryApplicationError.copyNotFound(cmd.copyId));
-    if (copy.ownerId !== cmd.actingMemberId) {
-      return err(LibraryError.notOwner("change this copy's cover"));
-    }
-
-    const outcome = copy.changeCover(cmd.coverImageId, deps.clock.now());
-    if (outcome.isErr) return err(outcome.error);
-
-    await deps.copies.save(copy);
-    await deps.events.publish(copy.pullEvents());
-    return ok(undefined);
-  };
+  () => undefined;
 
killedBy: copy mutation use cases makeSetCopyCover sets the owner's copy cover and publishes CopyCoverChanged
statusReason: run(...) is not a function

[Killed] BlockStatement
library/application/use-cases/set-copy-cover.ts:21:39
 // concern enforced in the Convex composition root (it needs the read model), not here.
 export const makeSetCopyCover =
   (deps: SetCopyCoverDeps): SetCopyCover =>
-  async (cmd: SetCopyCoverCommand) => {
-    const copy = await deps.copies.findById(cmd.copyId);
-    if (!copy) return err(LibraryApplicationError.copyNotFound(cmd.copyId));
-    if (copy.ownerId !== cmd.actingMemberId) {
-      return err(LibraryError.notOwner("change this copy's cover"));
-    }
-
-    const outcome = copy.changeCover(cmd.coverImageId, deps.clock.now());
-    if (outcome.isErr) return err(outcome.error);
-
-    await deps.copies.save(copy);
-    await deps.events.publish(copy.pullEvents());
-    return ok(undefined);
-  };
+  async (cmd: SetCopyCoverCommand) => {};
 
killedBy: copy mutation use cases makeSetCopyCover sets the owner's copy cover and publishes CopyCoverChanged
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] StringLiteral
library/application/use-cases/set-copy-cover.ts:25:40
     const copy = await deps.copies.findById(cmd.copyId);
     if (!copy) return err(LibraryApplicationError.copyNotFound(cmd.copyId));
     if (copy.ownerId !== cmd.actingMemberId) {
-      return err(LibraryError.notOwner("change this copy's cover"));
+      return err(LibraryError.notOwner(""));
     }
 
killedBy: copy mutation use cases makeSetCopyCover rejects a non-owner
statusReason: expected 'Acting member may not ' to be 'Acting member may not change this cop…' // Object.is equality

[Killed] ConditionalExpression
library/application/use-cases/set-copy-cover.ts:29:9
     }
 
     const outcome = copy.changeCover(cmd.coverImageId, deps.clock.now());
-    if (outcome.isErr) return err(outcome.error);
+    if (true) return err(outcome.error);
 
     await deps.copies.save(copy);
killedBy: copy mutation use cases makeSetCopyCover sets the owner's copy cover and publishes CopyCoverChanged
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
library/application/use-cases/set-copy-cover.ts:29:9
     }
 
     const outcome = copy.changeCover(cmd.coverImageId, deps.clock.now());
-    if (outcome.isErr) return err(outcome.error);
+    if (false) return err(outcome.error);
 
     await deps.copies.save(copy);
