[Killed] ArrowFunction
library/application/use-cases/transfer-copy-ownership.ts:18:3
 // Settlement-driven (no acting member): load the copy (→ CopyNotFound), hand the ownership move to
 // the aggregate (resets owner-scoped fields, keeps the physical record), persist, publish.
 export const makeTransferCopyOwnership =
-  (deps: TransferCopyOwnershipDeps): TransferCopyOwnership =>
-  async (cmd: TransferCopyOwnershipCommand) => {
-    const copy = await deps.copies.findById(cmd.copyId);
-    if (!copy) return err(LibraryApplicationError.copyNotFound(cmd.copyId));
-
-    const outcome = copy.transferTo(cmd.newOwner, deps.clock.now());
-    if (outcome.isErr) return err(outcome.error);
-
-    await deps.copies.save(copy);
-    await deps.events.publish(copy.pullEvents());
-    return ok(undefined);
-  };
+  () => undefined;
 
killedBy: copy mutation use cases makeTransferCopyOwnership reassigns the copy to the new owner and publishes CopyOwnershipTransferred
statusReason: run(...) is not a function

[Killed] BlockStatement
library/application/use-cases/transfer-copy-ownership.ts:19:48
 // the aggregate (resets owner-scoped fields, keeps the physical record), persist, publish.
 export const makeTransferCopyOwnership =
   (deps: TransferCopyOwnershipDeps): TransferCopyOwnership =>
-  async (cmd: TransferCopyOwnershipCommand) => {
-    const copy = await deps.copies.findById(cmd.copyId);
-    if (!copy) return err(LibraryApplicationError.copyNotFound(cmd.copyId));
-
-    const outcome = copy.transferTo(cmd.newOwner, deps.clock.now());
-    if (outcome.isErr) return err(outcome.error);
-
-    await deps.copies.save(copy);
-    await deps.events.publish(copy.pullEvents());
-    return ok(undefined);
-  };
+  async (cmd: TransferCopyOwnershipCommand) => {};
 
killedBy: copy mutation use cases makeTransferCopyOwnership reassigns the copy to the new owner and publishes CopyOwnershipTransferred
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] ConditionalExpression
library/application/use-cases/transfer-copy-ownership.ts:24:9
     if (!copy) return err(LibraryApplicationError.copyNotFound(cmd.copyId));
 
     const outcome = copy.transferTo(cmd.newOwner, deps.clock.now());
-    if (outcome.isErr) return err(outcome.error);
+    if (true) return err(outcome.error);
 
     await deps.copies.save(copy);
killedBy: copy mutation use cases makeTransferCopyOwnership reassigns the copy to the new owner and publishes CopyOwnershipTransferred
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
library/application/use-cases/transfer-copy-ownership.ts:24:9
     if (!copy) return err(LibraryApplicationError.copyNotFound(cmd.copyId));
 
     const outcome = copy.transferTo(cmd.newOwner, deps.clock.now());
-    if (outcome.isErr) return err(outcome.error);
+    if (false) return err(outcome.error);
 
     await deps.copies.save(copy);
