[Killed] ConditionalExpression
library/application/use-cases/update-collection.ts:24:9
   (deps: UpdateCollectionDeps): UpdateCollection =>
   async (cmd: UpdateCollectionCommand) => {
     const collection = await deps.collections.findById(cmd.collectionId);
-    if (!collection)
+    if (true)
       return err(LibraryApplicationError.collectionNotFound(cmd.collectionId));
     if (collection.ownerId !== cmd.actingMemberId) {
killedBy: collection membership use cases makeUpdateCollection patches the owner's collection and publishes CollectionUpdated
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
library/application/use-cases/update-collection.ts:26:9
     const collection = await deps.collections.findById(cmd.collectionId);
     if (!collection)
       return err(LibraryApplicationError.collectionNotFound(cmd.collectionId));
-    if (collection.ownerId !== cmd.actingMemberId) {
+    if (true) {
       return err(LibraryError.notOwner("update this collection"));
     }
killedBy: collection membership use cases makeUpdateCollection patches the owner's collection and publishes CollectionUpdated
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
library/application/use-cases/update-collection.ts:30:9
       return err(LibraryError.notOwner("update this collection"));
     }
 
-    if (cmd.name !== undefined && cmd.name !== collection.name) {
+    if (false) {
       const existing = await deps.collections.findByOwnerAndName(
         collection.ownerId,
killedBy: collection membership use cases makeUpdateCollection queries (owner, name) uniqueness when the name actually changes
statusReason: expected "findByOwnerAndName" to be called 1 times, but got 0 times

[Killed] EqualityOperator
library/application/use-cases/update-collection.ts:30:35
       return err(LibraryError.notOwner("update this collection"));
     }
 
-    if (cmd.name !== undefined && cmd.name !== collection.name) {
+    if (cmd.name !== undefined && cmd.name === collection.name) {
       const existing = await deps.collections.findByOwnerAndName(
         collection.ownerId,
killedBy: collection membership use cases makeUpdateCollection queries (owner, name) uniqueness when the name actually changes
statusReason: expected "findByOwnerAndName" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
library/application/use-cases/update-collection.ts:35:11
         collection.ownerId,
         cmd.name,
       );
-      if (existing && existing.id !== collection.id) {
+      if (true) {
         return err(LibraryApplicationError.duplicateCollectionName(cmd.name));
       }
killedBy: collection membership use cases makeUpdateCollection patches the owner's collection and publishes CollectionUpdated
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
library/application/use-cases/update-collection.ts:35:23
         collection.ownerId,
         cmd.name,
       );
-      if (existing && existing.id !== collection.id) {
+      if (existing && existing.id === collection.id) {
         return err(LibraryApplicationError.duplicateCollectionName(cmd.name));
       }
killedBy: collection membership use cases makeUpdateCollection does not flag a duplicate when the only match is the collection itself
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
library/application/use-cases/update-collection.ts:41:7
     }
 
     const outcome = collection.update(
-      {
-        name: cmd.name,
-        description: cmd.description,
-        visibility: cmd.visibility,
-        color: cmd.color,
-        icon: cmd.icon,
-        personalNotes: cmd.personalNotes,
-      },
+      {},
       deps.clock.now(),
     );
killedBy: collection membership use cases makeUpdateCollection patches the owner's collection and publishes CollectionUpdated
statusReason: expected 'My Shelf' to be 'Renamed Shelf' // Object.is equality
