[Killed] ArrowFunction
library/application/use-cases/update-copy-details.ts:19:3
 // Transaction script: load (→ CopyNotFound), check ownership, delegate the descriptive-field
 // patch (missing-piece count, notes) to the aggregate, persist, publish.
 export const makeUpdateCopyDetails =
-  (deps: UpdateCopyDetailsDeps): UpdateCopyDetails =>
-  async (cmd: UpdateCopyDetailsCommand) => {
-    const copy = await deps.copies.findById(cmd.copyId);
-    if (!copy) return err(LibraryApplicationError.copyNotFound(cmd.copyId));
-    if (copy.ownerId !== cmd.actingMemberId) {
-      return err(LibraryError.notOwner("update this copy's details"));
-    }
-
-    const outcome = copy.updateDetails(
-      {
-        missingPiecesCount: cmd.missingPiecesCount,
-        notes: cmd.notes,
-      },
-      deps.clock.now(),
-    );
-    if (outcome.isErr) return err(outcome.error);
-
-    await deps.copies.save(copy);
-    await deps.events.publish(copy.pullEvents());
-    return ok(undefined);
-  };
+  () => undefined;
 
killedBy: copy mutation use cases makeUpdateCopyDetails applies the fields to the owner's copy and publishes CopyDetailsUpdated
statusReason: run(...) is not a function

[Killed] BlockStatement
library/application/use-cases/update-copy-details.ts:20:44
 // patch (missing-piece count, notes) to the aggregate, persist, publish.
 export const makeUpdateCopyDetails =
   (deps: UpdateCopyDetailsDeps): UpdateCopyDetails =>
-  async (cmd: UpdateCopyDetailsCommand) => {
-    const copy = await deps.copies.findById(cmd.copyId);
-    if (!copy) return err(LibraryApplicationError.copyNotFound(cmd.copyId));
-    if (copy.ownerId !== cmd.actingMemberId) {
-      return err(LibraryError.notOwner("update this copy's details"));
-    }
-
-    const outcome = copy.updateDetails(
-      {
-        missingPiecesCount: cmd.missingPiecesCount,
-        notes: cmd.notes,
-      },
-      deps.clock.now(),
-    );
-    if (outcome.isErr) return err(outcome.error);
-
-    await deps.copies.save(copy);
-    await deps.events.publish(copy.pullEvents());
-    return ok(undefined);
-  };
+  async (cmd: UpdateCopyDetailsCommand) => {};
 
killedBy: copy mutation use cases makeUpdateCopyDetails applies the fields to the owner's copy and publishes CopyDetailsUpdated
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] BlockStatement
library/application/use-cases/update-copy-details.ts:23:46
   async (cmd: UpdateCopyDetailsCommand) => {
     const copy = await deps.copies.findById(cmd.copyId);
     if (!copy) return err(LibraryApplicationError.copyNotFound(cmd.copyId));
-    if (copy.ownerId !== cmd.actingMemberId) {
-      return err(LibraryError.notOwner("update this copy's details"));
-    }
+    if (copy.ownerId !== cmd.actingMemberId) {}
 
     const outcome = copy.updateDetails(
killedBy: copy mutation use cases makeUpdateCopyDetails rejects a non-owner
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
library/application/use-cases/update-copy-details.ts:24:40
     const copy = await deps.copies.findById(cmd.copyId);
     if (!copy) return err(LibraryApplicationError.copyNotFound(cmd.copyId));
     if (copy.ownerId !== cmd.actingMemberId) {
-      return err(LibraryError.notOwner("update this copy's details"));
+      return err(LibraryError.notOwner(""));
     }
 
killedBy: copy mutation use cases makeUpdateCopyDetails rejects a non-owner
statusReason: expected 'Acting member may not ' to be 'Acting member may not update this cop…' // Object.is equality
