[Killed] BlockStatement
library/application/use-cases/update-copy-sharing.ts:28:46
   async (cmd: UpdateCopySharingCommand) => {
     const copy = await deps.copies.findById(cmd.copyId);
     if (!copy) return err(LibraryApplicationError.copyNotFound(cmd.copyId));
-    if (copy.ownerId !== cmd.actingMemberId) {
-      return err(LibraryError.notOwner("update this copy's sharing"));
-    }
+    if (copy.ownerId !== cmd.actingMemberId) {}
 
     const setting = SharingSetting.create({
killedBy: copy mutation use cases makeUpdateCopySharing rejects a non-owner
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
library/application/use-cases/update-copy-sharing.ts:32:43
       return err(LibraryError.notOwner("update this copy's sharing"));
     }
 
-    const setting = SharingSetting.create({
-      visibility: cmd.visibility,
-      forTrade: cmd.forTrade,
-      forSale: cmd.forSale,
-      forLend: cmd.forLend,
-      salePrice: cmd.salePrice,
-    });
+    const setting = SharingSetting.create({});
 
     if (
killedBy: copy mutation use cases makeUpdateCopySharing updates sharing and publishes CopyMadeAvailable
statusReason: expected [ 'CopyMadeUnavailable' ] to deeply equal [ 'CopyMadeAvailable' ]

[Killed] ConditionalExpression
library/application/use-cases/update-copy-sharing.ts:41:7
     });
 
     if (
-      setting.isAvailableForAnyExchange() &&
-      (await deps.reservations.isReserved(cmd.copyId))
+      true
     ) {
       return err(LibraryApplicationError.copyReserved(cmd.copyId));
killedBy: copy mutation use cases makeUpdateCopySharing updates sharing and publishes CopyMadeAvailable
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
library/application/use-cases/update-copy-sharing.ts:41:7
     });
 
     if (
-      setting.isAvailableForAnyExchange() &&
-      (await deps.reservations.isReserved(cmd.copyId))
+      false
     ) {
       return err(LibraryApplicationError.copyReserved(cmd.copyId));
killedBy: copy mutation use cases makeUpdateCopySharing refuses to make a reserved copy available (Exchange seam)
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
library/application/use-cases/update-copy-sharing.ts:43:7
     if (
       setting.isAvailableForAnyExchange() &&
       (await deps.reservations.isReserved(cmd.copyId))
-    ) {
-      return err(LibraryApplicationError.copyReserved(cmd.copyId));
-    }
+    ) {}
 
     const outcome = copy.updateSharing(setting, deps.clock.now());
killedBy: copy mutation use cases makeUpdateCopySharing refuses to make a reserved copy available (Exchange seam)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
library/application/use-cases/update-copy-sharing.ts:48:9
     }
 
     const outcome = copy.updateSharing(setting, deps.clock.now());
-    if (outcome.isErr) return err(outcome.error);
+    if (true) return err(outcome.error);
 
     await deps.copies.save(copy);
killedBy: copy mutation use cases makeUpdateCopySharing updates sharing and publishes CopyMadeAvailable
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
library/application/use-cases/update-copy-sharing.ts:48:9
     }
 
     const outcome = copy.updateSharing(setting, deps.clock.now());
-    if (outcome.isErr) return err(outcome.error);
+    if (false) return err(outcome.error);
 
     await deps.copies.save(copy);
