[Killed] BlockStatement
src/library/domain/catalog-snapshot.ts:22:23
     readonly pieceCount: number;
     readonly brand?: string;
     readonly thumbnail?: string;
-  }): CatalogSnapshot {
-    return new CatalogSnapshot(
-      props.puzzleDefinitionId,
-      props.title,
-      props.pieceCount,
-      props.brand,
-      props.thumbnail,
-    );
-  }
+  }): CatalogSnapshot {}
 }
 
killedBy: loan use cases makeOpenLoan opens a loan, moves possession to the borrower, keeps ownership
statusReason: Cannot read properties of undefined (reading 'puzzleDefinitionId')
