[Killed] BlockStatement
src/library/domain/collection.ts:62:26
 
   private constructor(private state: CollectionState) {}
 
-  get id(): CollectionId {
-    return this.state.id;
-  }
+  get id(): CollectionId {}
 
   get ownerId(): OwnerId {
killedBy: makeCreateCollection allows the same name for a different owner
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BlockStatement
src/library/domain/collection.ts:66:26
     return this.state.id;
   }
 
-  get ownerId(): OwnerId {
-    return this.state.ownerId;
-  }
+  get ownerId(): OwnerId {}
 
   get name(): string {
killedBy: collection membership use cases makeAddCopyToCollection adds the owner's own copy and publishes CopyAddedToCollection
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/library/domain/collection.ts:70:22
     return this.state.ownerId;
   }
 
-  get name(): string {
-    return this.state.name;
-  }
+  get name(): string {}
 
   get isDefault(): boolean {
killedBy: collection membership use cases makeUpdateCollection patches the owner's collection and publishes CollectionUpdated
statusReason: expected undefined to be 'Renamed Shelf' // Object.is equality

[Killed] BlockStatement
src/library/domain/collection.ts:74:28
     return this.state.name;
   }
 
-  get isDefault(): boolean {
-    return this.state.isDefault;
-  }
+  get isDefault(): boolean {}
 
   get isWishlist(): boolean {
killedBy: Collection.create defaults isDefault and isWishlist to false, honouring explicit flags
statusReason: expected undefined to be false // Object.is equality

[Killed] BlockStatement
src/library/domain/collection.ts:78:29
     return this.state.isDefault;
   }
 
-  get isWishlist(): boolean {
-    return this.state.isWishlist;
-  }
+  get isWishlist(): boolean {}
 
   get copyMembers(): readonly CopyId[] {
killedBy: Collection.create defaults isDefault and isWishlist to false, honouring explicit flags
statusReason: expected undefined to be false // Object.is equality

[Killed] BlockStatement
src/library/domain/collection.ts:82:40
     return this.state.isWishlist;
   }
 
-  get copyMembers(): readonly CopyId[] {
-    return this.state.copyMembers;
-  }
+  get copyMembers(): readonly CopyId[] {}
 
   get wishedDefinitions(): readonly PuzzleDefinitionId[] {
killedBy: Collection.create starts empty, private, and records CollectionCreated
statusReason: expected undefined to deeply equal []

[Killed] BlockStatement
src/library/domain/collection.ts:86:58
     return this.state.copyMembers;
   }
 
-  get wishedDefinitions(): readonly PuzzleDefinitionId[] {
-    return this.state.wishedDefinitions;
-  }
+  get wishedDefinitions(): readonly PuzzleDefinitionId[] {}
 
   static create(
killedBy: wishlist behavior a wishlist references desired definitions, not copies, and emits PuzzleWished
statusReason: expected undefined to deeply equal [ 'def1' ]

[Killed] LogicalOperator
src/library/domain/collection.ts:93:24
   static create(
     props: CreateCollectionProps,
   ): Result<Collection, LibraryError> {
-    const isWishlist = props.isWishlist ?? false;
+    const isWishlist = props.isWishlist && false;
     const state: CollectionState = {
       id: props.id,
killedBy: collection membership use cases makeAddCopyToCollection surfaces the aggregate's WrongMemberType when adding a copy to a wishlist
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/library/domain/collection.ts:93:44
   static create(
     props: CreateCollectionProps,
   ): Result<Collection, LibraryError> {
-    const isWishlist = props.isWishlist ?? false;
+    const isWishlist = props.isWishlist ?? true;
     const state: CollectionState = {
       id: props.id,
killedBy: collection membership use cases makeAddCopyToCollection adds the owner's own copy and publishes CopyAddedToCollection
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/library/domain/collection.ts:99:19
       ownerId: props.ownerId,
       name: props.name,
       description: props.description,
-      visibility: props.visibility ?? "private",
+      visibility: props.visibility && "private",
       color: props.color,
       icon: props.icon,
killedBy: Collection.create starts empty, private, and records CollectionCreated
statusReason: expected undefined to be 'private' // Object.is equality

[Killed] StringLiteral
src/library/domain/collection.ts:99:39
       ownerId: props.ownerId,
       name: props.name,
       description: props.description,
-      visibility: props.visibility ?? "private",
+      visibility: props.visibility ?? "",
       color: props.color,
       icon: props.icon,
killedBy: Collection.create starts empty, private, and records CollectionCreated
statusReason: expected '' to be 'private' // Object.is equality

[Killed] BooleanLiteral
src/library/domain/collection.ts:102:37
       visibility: props.visibility ?? "private",
       color: props.color,
       icon: props.icon,
-      isDefault: props.isDefault ?? false,
+      isDefault: props.isDefault ?? true,
       isWishlist,
       personalNotes: props.personalNotes,
killedBy: collection membership use cases makeDeleteCollection deletes a non-default collection and publishes CollectionDeleted
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/library/domain/collection.ts:102:18
       visibility: props.visibility ?? "private",
       color: props.color,
       icon: props.icon,
-      isDefault: props.isDefault ?? false,
+      isDefault: props.isDefault && false,
       isWishlist,
       personalNotes: props.personalNotes,
killedBy: collection membership use cases makeDeleteCollection refuses to delete a default collection
statusReason: expected false to be true // Object.is equality

[Killed] ArrayDeclaration
src/library/domain/collection.ts:106:26
       isWishlist,
       personalNotes: props.personalNotes,
       copyMembers: [],
-      wishedDefinitions: [],
+      wishedDefinitions: ["Stryker was here"],
       createdAt: props.now,
       updatedAt: props.now,
killedBy: wishlist behavior a wishlist references desired definitions, not copies, and emits PuzzleWished
statusReason: expected [ 'Stryker was here', 'def1' ] to deeply equal [ 'def1' ]

[Killed] BlockStatement
src/library/domain/collection.ts:135:33
       readonly personalNotes?: string;
     },
     now: Date,
-  ): Result<void, LibraryError> {
-    this.state = {
-      ...this.state,
-      name: props.name ?? this.state.name,
-      description: props.description ?? this.state.description,
-      visibility: props.visibility ?? this.state.visibility,
-      color: props.color ?? this.state.color,
-      icon: props.icon ?? this.state.icon,
-      personalNotes: props.personalNotes ?? this.state.personalNotes,
-      updatedAt: now,
-    };
-    this.record(new CollectionUpdated(this.id, now));
-    return ok(undefined);
-  }
+  ): Result<void, LibraryError> {}
 
   // Add one of the owner's own copies. The "only the owner's own copies" rule needs the
killedBy: update applies provided fields and records CollectionUpdated
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] LogicalOperator
src/library/domain/collection.ts:138:13
   ): Result<void, LibraryError> {
     this.state = {
       ...this.state,
-      name: props.name ?? this.state.name,
+      name: props.name && this.state.name,
       description: props.description ?? this.state.description,
       visibility: props.visibility ?? this.state.visibility,
killedBy: update applies provided fields and records CollectionUpdated
statusReason: expected 'Favorites' to be 'Renamed' // Object.is equality

[Killed] LogicalOperator
src/library/domain/collection.ts:139:20
     this.state = {
       ...this.state,
       name: props.name ?? this.state.name,
-      description: props.description ?? this.state.description,
+      description: props.description && this.state.description,
       visibility: props.visibility ?? this.state.visibility,
       color: props.color ?? this.state.color,
killedBy: update applies provided fields and records CollectionUpdated
statusReason: expected undefined to be 'A description' // Object.is equality

[Killed] LogicalOperator
src/library/domain/collection.ts:140:19
       ...this.state,
       name: props.name ?? this.state.name,
       description: props.description ?? this.state.description,
-      visibility: props.visibility ?? this.state.visibility,
+      visibility: props.visibility && this.state.visibility,
       color: props.color ?? this.state.color,
       icon: props.icon ?? this.state.icon,
killedBy: update applies provided fields and records CollectionUpdated
statusReason: expected 'private' to be 'public' // Object.is equality

[Killed] LogicalOperator
src/library/domain/collection.ts:141:14
       name: props.name ?? this.state.name,
       description: props.description ?? this.state.description,
       visibility: props.visibility ?? this.state.visibility,
-      color: props.color ?? this.state.color,
+      color: props.color && this.state.color,
       icon: props.icon ?? this.state.icon,
       personalNotes: props.personalNotes ?? this.state.personalNotes,
killedBy: update applies provided fields and records CollectionUpdated
statusReason: expected undefined to be '#fff' // Object.is equality

[Killed] LogicalOperator
src/library/domain/collection.ts:142:13
       description: props.description ?? this.state.description,
       visibility: props.visibility ?? this.state.visibility,
       color: props.color ?? this.state.color,
-      icon: props.icon ?? this.state.icon,
+      icon: props.icon && this.state.icon,
       personalNotes: props.personalNotes ?? this.state.personalNotes,
       updatedAt: now,
killedBy: update applies provided fields and records CollectionUpdated
statusReason: expected undefined to be 'star' // Object.is equality

[Killed] LogicalOperator
src/library/domain/collection.ts:143:22
       visibility: props.visibility ?? this.state.visibility,
       color: props.color ?? this.state.color,
       icon: props.icon ?? this.state.icon,
-      personalNotes: props.personalNotes ?? this.state.personalNotes,
+      personalNotes: props.personalNotes && this.state.personalNotes,
       updatedAt: now,
     };
killedBy: update applies provided fields and records CollectionUpdated
statusReason: expected undefined to be 'mine' // Object.is equality

[Killed] BlockStatement
src/library/domain/collection.ts:153:66
   // Add one of the owner's own copies. The "only the owner's own copies" rule needs the
   // Copy's ownerId and is enforced in the AddCopyToCollection use case; the aggregate guards
   // the structural rule (a wishlist holds definitions, not copies) and de-duplicates.
-  addCopy(copyId: CopyId, now: Date): Result<void, LibraryError> {
-    if (this.state.isWishlist) {
-      return err(
-        LibraryError.wrongMemberType(
-          "A wishlist holds desired definitions, not copies",
-        ),
-      );
-    }
-    if (this.state.copyMembers.includes(copyId)) return ok(undefined);
-    this.state = {
-      ...this.state,
-      copyMembers: [...this.state.copyMembers, copyId],
-      updatedAt: now,
-    };
-    this.record(new CopyAddedToCollection(this.id, copyId, now));
-    return ok(undefined);
-  }
+  addCopy(copyId: CopyId, now: Date): Result<void, LibraryError> {}
 
   removeCopy(copyId: CopyId, now: Date): Result<void, LibraryError> {
killedBy: addCopy / removeCopy adds copies and records CopyAddedToCollection
statusReason: expected [] to deeply equal [ 'copyA' ]

[Killed] BlockStatement
src/library/domain/collection.ts:154:32
   // Copy's ownerId and is enforced in the AddCopyToCollection use case; the aggregate guards
   // the structural rule (a wishlist holds definitions, not copies) and de-duplicates.
   addCopy(copyId: CopyId, now: Date): Result<void, LibraryError> {
-    if (this.state.isWishlist) {
-      return err(
-        LibraryError.wrongMemberType(
-          "A wishlist holds desired definitions, not copies",
-        ),
-      );
-    }
+    if (this.state.isWishlist) {}
     if (this.state.copyMembers.includes(copyId)) return ok(undefined);
     this.state = {
killedBy: addCopy / removeCopy rejects adding a copy to a wishlist (wrong member type)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/library/domain/collection.ts:154:9
   // Copy's ownerId and is enforced in the AddCopyToCollection use case; the aggregate guards
   // the structural rule (a wishlist holds definitions, not copies) and de-duplicates.
   addCopy(copyId: CopyId, now: Date): Result<void, LibraryError> {
-    if (this.state.isWishlist) {
+    if (true) {
       return err(
         LibraryError.wrongMemberType(
killedBy: addCopy / removeCopy adds copies and records CopyAddedToCollection
statusReason: expected [] to deeply equal [ 'copyA' ]

[Killed] ConditionalExpression
src/library/domain/collection.ts:161:9
         ),
       );
     }
-    if (this.state.copyMembers.includes(copyId)) return ok(undefined);
+    if (false) return ok(undefined);
     this.state = {
       ...this.state,
killedBy: addCopy / removeCopy de-duplicates a repeated add (no second event)
statusReason: expected [ 'copyA', 'copyA' ] to deeply equal [ 'copyA' ]

[Killed] ConditionalExpression
src/library/domain/collection.ts:161:9
         ),
       );
     }
-    if (this.state.copyMembers.includes(copyId)) return ok(undefined);
+    if (true) return ok(undefined);
     this.state = {
       ...this.state,
killedBy: addCopy / removeCopy adds copies and records CopyAddedToCollection
statusReason: expected [] to deeply equal [ 'copyA' ]

[Killed] ObjectLiteral
src/library/domain/collection.ts:162:18
       );
     }
     if (this.state.copyMembers.includes(copyId)) return ok(undefined);
-    this.state = {
-      ...this.state,
-      copyMembers: [...this.state.copyMembers, copyId],
-      updatedAt: now,
-    };
+    this.state = {};
     this.record(new CopyAddedToCollection(this.id, copyId, now));
     return ok(undefined);
killedBy: addCopy / removeCopy adds copies and records CopyAddedToCollection
statusReason: expected undefined to deeply equal [ 'copyA' ]

[Killed] BlockStatement
src/library/domain/collection.ts:171:69
     return ok(undefined);
   }
 
-  removeCopy(copyId: CopyId, now: Date): Result<void, LibraryError> {
-    if (!this.state.copyMembers.includes(copyId)) {
-      return err(LibraryError.copyNotInCollection());
-    }
-    this.state = {
-      ...this.state,
-      copyMembers: this.state.copyMembers.filter((id) => id !== copyId),
-      updatedAt: now,
-    };
-    this.record(new CopyRemovedFromCollection(this.id, copyId, now));
-    return ok(undefined);
-  }
+  removeCopy(copyId: CopyId, now: Date): Result<void, LibraryError> {}
 
   // Wishlist-only: add a desired (not owned) PuzzleDefinition.
killedBy: addCopy / removeCopy removes a member and records CopyRemovedFromCollection
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] BooleanLiteral
src/library/domain/collection.ts:172:9
   }
 
   removeCopy(copyId: CopyId, now: Date): Result<void, LibraryError> {
-    if (!this.state.copyMembers.includes(copyId)) {
+    if (this.state.copyMembers.includes(copyId)) {
       return err(LibraryError.copyNotInCollection());
     }
killedBy: addCopy / removeCopy removes a member and records CopyRemovedFromCollection
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/library/domain/collection.ts:172:9
   }
 
   removeCopy(copyId: CopyId, now: Date): Result<void, LibraryError> {
-    if (!this.state.copyMembers.includes(copyId)) {
+    if (true) {
       return err(LibraryError.copyNotInCollection());
     }
killedBy: addCopy / removeCopy removes a member and records CopyRemovedFromCollection
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/library/domain/collection.ts:177:20
     }
     this.state = {
       ...this.state,
-      copyMembers: this.state.copyMembers.filter((id) => id !== copyId),
+      copyMembers: this.state.copyMembers,
       updatedAt: now,
     };
killedBy: addCopy / removeCopy removes a member and records CopyRemovedFromCollection
statusReason: expected [ 'copyA', 'copyB' ] to deeply equal [ 'copyB' ]

[Killed] EqualityOperator
src/library/domain/collection.ts:177:58
     }
     this.state = {
       ...this.state,
-      copyMembers: this.state.copyMembers.filter((id) => id !== copyId),
+      copyMembers: this.state.copyMembers.filter((id) => id === copyId),
       updatedAt: now,
     };
killedBy: addCopy / removeCopy removes a member and records CopyRemovedFromCollection
statusReason: expected [ 'copyA' ] to deeply equal [ 'copyB' ]

[Killed] BlockStatement
src/library/domain/collection.ts:188:33
   wishFor(
     definitionId: PuzzleDefinitionId,
     now: Date,
-  ): Result<void, LibraryError> {
-    if (!this.state.isWishlist) {
-      return err(
-        LibraryError.wrongMemberType(
-          "Only a wishlist can reference desired definitions",
-        ),
-      );
-    }
-    if (this.state.wishedDefinitions.includes(definitionId))
-      return ok(undefined);
-    this.state = {
-      ...this.state,
-      wishedDefinitions: [...this.state.wishedDefinitions, definitionId],
-      updatedAt: now,
-    };
-    this.record(new PuzzleWished(this.id, definitionId, now));
-    return ok(undefined);
-  }
+  ): Result<void, LibraryError> {}
 
   unwish(
killedBy: wishlist behavior a wishlist references desired definitions, not copies, and emits PuzzleWished
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] BooleanLiteral
src/library/domain/collection.ts:189:9
     definitionId: PuzzleDefinitionId,
     now: Date,
   ): Result<void, LibraryError> {
-    if (!this.state.isWishlist) {
+    if (this.state.isWishlist) {
       return err(
         LibraryError.wrongMemberType(
killedBy: wishlist behavior a wishlist references desired definitions, not copies, and emits PuzzleWished
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/library/domain/collection.ts:189:9
     definitionId: PuzzleDefinitionId,
     now: Date,
   ): Result<void, LibraryError> {
-    if (!this.state.isWishlist) {
+    if (true) {
       return err(
         LibraryError.wrongMemberType(
killedBy: wishlist behavior a wishlist references desired definitions, not copies, and emits PuzzleWished
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/library/domain/collection.ts:192:11
     if (!this.state.isWishlist) {
       return err(
         LibraryError.wrongMemberType(
-          "Only a wishlist can reference desired definitions",
+          "",
         ),
       );
killedBy: wishlist behavior rejects wishing on a non-wishlist collection
statusReason: expected '' to be 'Only a wishlist can reference desired…' // Object.is equality

[Killed] ConditionalExpression
src/library/domain/collection.ts:196:9
         ),
       );
     }
-    if (this.state.wishedDefinitions.includes(definitionId))
+    if (false)
       return ok(undefined);
     this.state = {
killedBy: wishlist behavior de-duplicates a repeated wish (no second event)
statusReason: expected [ 'def1', 'def1' ] to deeply equal [ 'def1' ]

[Killed] ConditionalExpression
src/library/domain/collection.ts:196:9
         ),
       );
     }
-    if (this.state.wishedDefinitions.includes(definitionId))
+    if (true)
       return ok(undefined);
     this.state = {
killedBy: wishlist behavior a wishlist references desired definitions, not copies, and emits PuzzleWished
statusReason: expected [] to deeply equal [ 'def1' ]

[Killed] BlockStatement
src/library/domain/collection.ts:210:33
   unwish(
     definitionId: PuzzleDefinitionId,
     now: Date,
-  ): Result<void, LibraryError> {
-    if (!this.state.wishedDefinitions.includes(definitionId)) {
-      return err(LibraryError.copyNotInCollection());
-    }
-    this.state = {
-      ...this.state,
-      wishedDefinitions: this.state.wishedDefinitions.filter(
-        (id) => id !== definitionId,
-      ),
-      updatedAt: now,
-    };
-    this.record(new PuzzleUnwished(this.id, definitionId, now));
-    return ok(undefined);
-  }
+  ): Result<void, LibraryError> {}
 
   // Invariant: a default (system) collection cannot be deleted. Returns the deletion event
killedBy: wishlist behavior unwishes a desired definition while keeping the others
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] BooleanLiteral
src/library/domain/collection.ts:211:9
     definitionId: PuzzleDefinitionId,
     now: Date,
   ): Result<void, LibraryError> {
-    if (!this.state.wishedDefinitions.includes(definitionId)) {
+    if (this.state.wishedDefinitions.includes(definitionId)) {
       return err(LibraryError.copyNotInCollection());
     }
killedBy: wishlist behavior unwishes a desired definition while keeping the others
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/library/domain/collection.ts:211:9
     definitionId: PuzzleDefinitionId,
     now: Date,
   ): Result<void, LibraryError> {
-    if (!this.state.wishedDefinitions.includes(definitionId)) {
+    if (true) {
       return err(LibraryError.copyNotInCollection());
     }
killedBy: wishlist behavior unwishes a desired definition while keeping the others
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/library/domain/collection.ts:216:26
     }
     this.state = {
       ...this.state,
-      wishedDefinitions: this.state.wishedDefinitions.filter(
-        (id) => id !== definitionId,
-      ),
+      wishedDefinitions: this.state.wishedDefinitions,
       updatedAt: now,
     };
killedBy: wishlist behavior unwishes a desired definition while keeping the others
statusReason: expected [ 'def1', 'def2' ] to deeply equal [ 'def2' ]

[Killed] EqualityOperator
src/library/domain/collection.ts:217:17
     this.state = {
       ...this.state,
       wishedDefinitions: this.state.wishedDefinitions.filter(
-        (id) => id !== definitionId,
+        (id) => id === definitionId,
       ),
       updatedAt: now,
killedBy: wishlist behavior unwishes a desired definition while keeping the others
statusReason: expected [ 'def1' ] to deeply equal [ 'def2' ]

[Killed] ArrowFunction
src/library/domain/collection.ts:217:9
     this.state = {
       ...this.state,
       wishedDefinitions: this.state.wishedDefinitions.filter(
-        (id) => id !== definitionId,
+        () => undefined,
       ),
       updatedAt: now,
killedBy: wishlist behavior unwishes a desired definition while keeping the others
statusReason: expected [] to deeply equal [ 'def2' ]

[Killed] BlockStatement
src/library/domain/collection.ts:227:49
 
   // Invariant: a default (system) collection cannot be deleted. Returns the deletion event
   // for the use case to publish after the repository removes the row.
-  delete(now: Date): Result<void, LibraryError> {
-    if (this.state.isDefault) {
-      return err(LibraryError.cannotDeleteDefaultCollection());
-    }
-    this.record(new CollectionDeleted(this.id, now));
-    return ok(undefined);
-  }
+  delete(now: Date): Result<void, LibraryError> {}
 
   pullEvents(): readonly DomainEvent[] {
killedBy: delete (default-collection guard) deletes a non-default collection and records CollectionDeleted
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] ConditionalExpression
src/library/domain/collection.ts:228:9
   // Invariant: a default (system) collection cannot be deleted. Returns the deletion event
   // for the use case to publish after the repository removes the row.
   delete(now: Date): Result<void, LibraryError> {
-    if (this.state.isDefault) {
+    if (true) {
       return err(LibraryError.cannotDeleteDefaultCollection());
     }
killedBy: delete (default-collection guard) deletes a non-default collection and records CollectionDeleted
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/library/domain/collection.ts:228:9
   // Invariant: a default (system) collection cannot be deleted. Returns the deletion event
   // for the use case to publish after the repository removes the row.
   delete(now: Date): Result<void, LibraryError> {
-    if (this.state.isDefault) {
+    if (false) {
       return err(LibraryError.cannotDeleteDefaultCollection());
     }
killedBy: delete (default-collection guard) refuses to delete a default collection
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/library/domain/collection.ts:235:40
     return ok(undefined);
   }
 
-  pullEvents(): readonly DomainEvent[] {
-    const drained = this.events;
-    this.events = [];
-    return drained;
-  }
+  pullEvents(): readonly DomainEvent[] {}
 
   static rehydrate(state: CollectionState): Collection {
killedBy: Collection.create starts empty, private, and records CollectionCreated
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
src/library/domain/collection.ts:241:56
     return drained;
   }
 
-  static rehydrate(state: CollectionState): Collection {
-    return new Collection(state);
-  }
+  static rehydrate(state: CollectionState): Collection {}
 
   toState(): CollectionState {
killedBy: rehydrate / toState round-trip rehydrates without re-recording events
statusReason: Cannot read properties of undefined (reading 'pullEvents')

[Killed] BlockStatement
src/library/domain/collection.ts:245:30
     return new Collection(state);
   }
 
-  toState(): CollectionState {
-    return this.state;
-  }
+  toState(): CollectionState {}
 
   private record(event: DomainEvent): void {
killedBy: Collection.create starts empty, private, and records CollectionCreated
statusReason: Cannot read properties of undefined (reading 'visibility')
