[Killed] BlockStatement
src/library/domain/copy-image.ts:28:17
     readonly description?: string;
     readonly tag?: CopyImageTag;
     readonly takenAt?: Date;
-  }): CopyImage {
-    return new CopyImage(
-      props.fileId,
-      props.title,
-      props.description,
-      props.tag,
-      props.takenAt,
-    );
-  }
+  }): CopyImage {}
 }
 
killedBy: copy mutation use cases makeAddCopyImage adds an image to the owner's copy and publishes CopyImageAdded
statusReason: Cannot read properties of undefined (reading 'fileId')
