[Killed] BlockStatement
src/library/domain/copy.ts:71:20
 
   private constructor(private state: CopyState) {}
 
-  get id(): CopyId {
-    return this.state.id;
-  }
+  get id(): CopyId {}
 
   get ownerId(): OwnerId {
killedBy: Copy.acquire exposes id, ownerId and condition through its getters
statusReason: expected undefined to be 'copy1' // Object.is equality

[Killed] BlockStatement
src/library/domain/copy.ts:79:25
     return this.state.ownerId;
   }
 
-  get heldBy(): OwnerId {
-    return this.state.heldBy;
-  }
+  get heldBy(): OwnerId {}
 
   get condition(): Condition {
killedBy: loan use cases makeOpenLoan opens a loan, moves possession to the borrower, keeps ownership
statusReason: expected undefined to be 'bob' // Object.is equality

[Killed] BlockStatement
src/library/domain/copy.ts:83:30
     return this.state.heldBy;
   }
 
-  get condition(): Condition {
-    return this.state.condition;
-  }
+  get condition(): Condition {}
 
   get sharing(): SharingSetting {
killedBy: Copy.acquire exposes id, ownerId and condition through its getters
statusReason: expected undefined to be 'good' // Object.is equality

[Killed] BlockStatement
src/library/domain/copy.ts:87:33
     return this.state.condition;
   }
 
-  get sharing(): SharingSetting {
-    return this.state.sharing;
-  }
+  get sharing(): SharingSetting {}
 
   // Mint a brand-new copy: owner, condition, acquisition, default (private) sharing; records
killedBy: Copy.acquire defaults to a private sharing setting (not available for any exchange)
statusReason: Cannot read properties of undefined (reading 'visibility')

[Killed] ObjectLiteral
src/library/domain/copy.ts:94:30
   // Mint a brand-new copy: owner, condition, acquisition, default (private) sharing; records
   // CopyAcquired. The snapshot is supplied by the application layer via the CatalogSnapshotProvider.
   static acquire(props: AcquireCopyProps): Result<Copy, LibraryError> {
-    const state: CopyState = {
-      id: props.id,
-      ownerId: props.ownerId,
-      heldBy: props.ownerId,
-      puzzleDefinitionId: props.snapshot.puzzleDefinitionId,
-      snapshot: props.snapshot,
-      condition: props.condition,
-      missingPiecesCount: props.missingPiecesCount,
-      notes: props.notes,
-      sharing: SharingSetting.private(),
-      acquisition: props.acquisition ?? Acquisition.unknown(),
-      images: [],
-      createdAt: props.now,
-      updatedAt: props.now,
-    };
+    const state: CopyState = {};
     const copy = new Copy(state);
     copy.record(
killedBy: Copy.acquire holds the catalog snapshot and references the definition id
statusReason: expected undefined to be 'def1' // Object.is equality

[Killed] LogicalOperator
src/library/domain/copy.ts:104:20
       missingPiecesCount: props.missingPiecesCount,
       notes: props.notes,
       sharing: SharingSetting.private(),
-      acquisition: props.acquisition ?? Acquisition.unknown(),
+      acquisition: props.acquisition && Acquisition.unknown(),
       images: [],
       createdAt: props.now,
killedBy: Copy.acquire defaults to an empty (unknown) acquisition when none is supplied
statusReason: Cannot read properties of undefined (reading 'date')

[Killed] ArrayDeclaration
src/library/domain/copy.ts:105:15
       notes: props.notes,
       sharing: SharingSetting.private(),
       acquisition: props.acquisition ?? Acquisition.unknown(),
-      images: [],
+      images: ["Stryker was here"],
       createdAt: props.now,
       updatedAt: props.now,
killedBy: addImage attaches an image and records CopyImageAdded with the tag
statusReason: expected [ 'Stryker was here', …(1) ] to have a length of 1 but got 2

[Killed] BlockStatement
src/library/domain/copy.ts:124:73
 
   // Re-grade the copy. Append-friendly: emits a from/to event feeding a future condition
   // timeline. A no-op (same grade) records nothing.
-  changeCondition(to: Condition, now: Date): Result<void, LibraryError> {
-    const from = this.state.condition;
-    if (from === to) return ok(undefined);
-    this.state = { ...this.state, condition: to, updatedAt: now };
-    this.record(new CopyConditionChanged(this.id, from, to, now));
-    return ok(undefined);
-  }
+  changeCondition(to: Condition, now: Date): Result<void, LibraryError> {}
 
   // Replace the whole sharing setting. Emits CopyMadeAvailable/Unavailable so subscribers
killedBy: changeCondition re-grades and records a from/to CopyConditionChanged
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] EqualityOperator
src/library/domain/copy.ts:126:9
   // timeline. A no-op (same grade) records nothing.
   changeCondition(to: Condition, now: Date): Result<void, LibraryError> {
     const from = this.state.condition;
-    if (from === to) return ok(undefined);
+    if (from !== to) return ok(undefined);
     this.state = { ...this.state, condition: to, updatedAt: now };
     this.record(new CopyConditionChanged(this.id, from, to, now));
killedBy: changeCondition re-grades and records a from/to CopyConditionChanged
statusReason: expected 'good' to be 'fair' // Object.is equality

[Killed] ConditionalExpression
src/library/domain/copy.ts:126:9
   // timeline. A no-op (same grade) records nothing.
   changeCondition(to: Condition, now: Date): Result<void, LibraryError> {
     const from = this.state.condition;
-    if (from === to) return ok(undefined);
+    if (false) return ok(undefined);
     this.state = { ...this.state, condition: to, updatedAt: now };
     this.record(new CopyConditionChanged(this.id, from, to, now));
killedBy: changeCondition is a no-op (no event) when the grade is unchanged
statusReason: expected [ CopyConditionChanged{ …(5) } ] to have a length of +0 but got 1

[Killed] ObjectLiteral
src/library/domain/copy.ts:127:18
   changeCondition(to: Condition, now: Date): Result<void, LibraryError> {
     const from = this.state.condition;
     if (from === to) return ok(undefined);
-    this.state = { ...this.state, condition: to, updatedAt: now };
+    this.state = {};
     this.record(new CopyConditionChanged(this.id, from, to, now));
     return ok(undefined);
killedBy: changeCondition re-grades and records a from/to CopyConditionChanged
statusReason: expected undefined to be 'fair' // Object.is equality

[Killed] BlockStatement
src/library/domain/copy.ts:137:33
   updateSharing(
     setting: SharingSetting,
     now: Date,
-  ): Result<void, LibraryError> {
-    this.state = { ...this.state, sharing: setting, updatedAt: now };
-    if (setting.isAvailableForAnyExchange()) {
-      this.record(
-        new CopyMadeAvailable(
-          this.id,
-          setting.forTrade,
-          setting.forSale,
-          setting.forLend,
-          now,
-        ),
-      );
-    } else {
-      this.record(new CopyMadeUnavailable(this.id, now));
-    }
-    return ok(undefined);
-  }
+  ): Result<void, LibraryError> {}
 
   // Settle an exchange: the SAME physical copy changes hands. Owner-scoped facts reset (sharing
killedBy: updateSharing emits CopyMadeAvailable when offered for an exchange kind
statusReason: expected [] to deeply equal [ 'CopyMadeAvailable' ]

[Killed] ConditionalExpression
src/library/domain/copy.ts:139:9
     now: Date,
   ): Result<void, LibraryError> {
     this.state = { ...this.state, sharing: setting, updatedAt: now };
-    if (setting.isAvailableForAnyExchange()) {
+    if (false) {
       this.record(
         new CopyMadeAvailable(
killedBy: updateSharing emits CopyMadeAvailable when offered for an exchange kind
statusReason: expected [ 'CopyMadeUnavailable' ] to deeply equal [ 'CopyMadeAvailable' ]

[Killed] BlockStatement
src/library/domain/copy.ts:139:46
     now: Date,
   ): Result<void, LibraryError> {
     this.state = { ...this.state, sharing: setting, updatedAt: now };
-    if (setting.isAvailableForAnyExchange()) {
-      this.record(
-        new CopyMadeAvailable(
-          this.id,
-          setting.forTrade,
-          setting.forSale,
-          setting.forLend,
-          now,
-        ),
-      );
-    } else {
+    if (setting.isAvailableForAnyExchange()) {} else {
       this.record(new CopyMadeUnavailable(this.id, now));
     }
killedBy: updateSharing emits CopyMadeAvailable when offered for an exchange kind
statusReason: expected [] to deeply equal [ 'CopyMadeAvailable' ]

[Killed] BlockStatement
src/library/domain/copy.ts:149:12
           now,
         ),
       );
-    } else {
-      this.record(new CopyMadeUnavailable(this.id, now));
-    }
+    } else {}
     return ok(undefined);
   }
killedBy: updateSharing emits CopyMadeUnavailable when no exchange kind is offered
statusReason: expected [] to deeply equal [ 'CopyMadeUnavailable' ]

[Killed] BlockStatement
src/library/domain/copy.ts:159:72
   // back to private so the new owner decides availability; acquisition becomes a trade; personal
   // notes drop), while the physical record (condition, snapshot, missing pieces, images) carries
   // over. The stable copy id keeps the chain-of-custody coherent across successive owners.
-  transferTo(newOwner: OwnerId, now: Date): Result<void, LibraryError> {
-    const previousOwner = this.state.ownerId;
-    this.state = {
-      ...this.state,
-      ownerId: newOwner,
-      heldBy: newOwner,
-      sharing: SharingSetting.private(),
-      acquisition: Acquisition.create({ source: "trade", date: now }),
-      notes: undefined,
-      updatedAt: now,
-    };
-    this.record(
-      new CopyOwnershipTransferred(this.id, previousOwner, newOwner, now),
-    );
-    return ok(undefined);
-  }
+  transferTo(newOwner: OwnerId, now: Date): Result<void, LibraryError> {}
 
   // Lend the copy out: possession passes to the borrower (ownership unchanged) and it leaves the
killedBy: Copy.transferTo reassigns ownership and records CopyOwnershipTransferred with both owners
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] ObjectLiteral
src/library/domain/copy.ts:166:39
       ownerId: newOwner,
       heldBy: newOwner,
       sharing: SharingSetting.private(),
-      acquisition: Acquisition.create({ source: "trade", date: now }),
+      acquisition: Acquisition.create({}),
       notes: undefined,
       updatedAt: now,
killedBy: Copy.transferTo resets owner-specific fields: sharing private, acquisition trade, notes cleared
statusReason: expected undefined to be 'trade' // Object.is equality

[Killed] StringLiteral
src/library/domain/copy.ts:166:49
       ownerId: newOwner,
       heldBy: newOwner,
       sharing: SharingSetting.private(),
-      acquisition: Acquisition.create({ source: "trade", date: now }),
+      acquisition: Acquisition.create({ source: "", date: now }),
       notes: undefined,
       updatedAt: now,
killedBy: Copy.transferTo resets owner-specific fields: sharing private, acquisition trade, notes cleared
statusReason: expected '' to be 'trade' // Object.is equality

[Killed] BlockStatement
src/library/domain/copy.ts:178:69
 
   // Lend the copy out: possession passes to the borrower (ownership unchanged) and it leaves the
   // market for the loan's duration. Driven by the loan use case; the owner stays this.state.ownerId.
-  lendOut(borrower: OwnerId, now: Date): Result<void, LibraryError> {
-    this.state = {
-      ...this.state,
-      heldBy: borrower,
-      sharing: SharingSetting.private(),
-      updatedAt: now,
-    };
-    this.record(new CopyLentOut(this.id, borrower, now));
-    return ok(undefined);
-  }
+  lendOut(borrower: OwnerId, now: Date): Result<void, LibraryError> {}
 
   // End a loan: possession returns to the owner (it stays off the market until re-shared).
killedBy: Copy possession (lend / return) lendOut hands possession to the borrower and takes it off the market
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] BlockStatement
src/library/domain/copy.ts:190:56
   }
 
   // End a loan: possession returns to the owner (it stays off the market until re-shared).
-  returnToOwner(now: Date): Result<void, LibraryError> {
-    this.state = {
-      ...this.state,
-      heldBy: this.state.ownerId,
-      updatedAt: now,
-    };
-    this.record(new CopyReturnedToOwner(this.id, now));
-    return ok(undefined);
-  }
+  returnToOwner(now: Date): Result<void, LibraryError> {}
 
   // Patch the descriptive fields the condition/sharing methods don't cover. An undefined field
killedBy: Copy possession (lend / return) returnToOwner restores possession to the owner
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] ObjectLiteral
src/library/domain/copy.ts:191:18
 
   // End a loan: possession returns to the owner (it stays off the market until re-shared).
   returnToOwner(now: Date): Result<void, LibraryError> {
-    this.state = {
-      ...this.state,
-      heldBy: this.state.ownerId,
-      updatedAt: now,
-    };
+    this.state = {};
     this.record(new CopyReturnedToOwner(this.id, now));
     return ok(undefined);
killedBy: Copy possession (lend / return) returnToOwner restores possession to the owner
statusReason: expected undefined to be 'alice' // Object.is equality

[Killed] BlockStatement
src/library/domain/copy.ts:208:33
       readonly notes?: string;
     },
     now: Date,
-  ): Result<void, LibraryError> {
-    this.state = {
-      ...this.state,
-      missingPiecesCount:
-        changes.missingPiecesCount ?? this.state.missingPiecesCount,
-      notes: changes.notes ?? this.state.notes,
-      updatedAt: now,
-    };
-    this.record(
-      new CopyDetailsUpdated(
-        this.id,
-        this.state.missingPiecesCount,
-        this.state.notes,
-        now,
-      ),
-    );
-    return ok(undefined);
-  }
+  ): Result<void, LibraryError> {}
 
   // Mark the copy for removal. Deletion is the repository dropping the row; this records a
killedBy: Copy.transferTo keeps the physical facts: condition, snapshot, missing pieces
statusReason: expected undefined to be 2 // Object.is equality

[Killed] LogicalOperator
src/library/domain/copy.ts:212:9
     this.state = {
       ...this.state,
       missingPiecesCount:
-        changes.missingPiecesCount ?? this.state.missingPiecesCount,
+        changes.missingPiecesCount && this.state.missingPiecesCount,
       notes: changes.notes ?? this.state.notes,
       updatedAt: now,
killedBy: Copy.transferTo keeps the physical facts: condition, snapshot, missing pieces
statusReason: expected undefined to be 2 // Object.is equality

[Killed] LogicalOperator
src/library/domain/copy.ts:213:14
       ...this.state,
       missingPiecesCount:
         changes.missingPiecesCount ?? this.state.missingPiecesCount,
-      notes: changes.notes ?? this.state.notes,
+      notes: changes.notes && this.state.notes,
       updatedAt: now,
     };
killedBy: copy mutation use cases makeUpdateCopyDetails applies the fields to the owner's copy and publishes CopyDetailsUpdated
statusReason: expected undefined to be 'corner piece missing' // Object.is equality

[Killed] BlockStatement
src/library/domain/copy.ts:229:49
 
   // Mark the copy for removal. Deletion is the repository dropping the row; this records a
   // CopyDeleted event the use case publishes afterwards so subscribers can react.
-  delete(now: Date): Result<void, LibraryError> {
-    this.record(new CopyDeleted(this.id, now));
-    return ok(undefined);
-  }
+  delete(now: Date): Result<void, LibraryError> {}
 
   // Choose the cover picture: one of the copy's own photos (its `ownedPuzzleImages` id), or null
killedBy: copy mutation use cases makeDeleteCopy removes the owner's copy and publishes CopyDeleted
statusReason: Cannot read properties of undefined (reading 'isErr')

[Killed] BlockStatement
src/library/domain/copy.ts:240:33
   changeCover(
     coverImageId: string | null,
     now: Date,
-  ): Result<void, LibraryError> {
-    this.state = {
-      ...this.state,
-      coverImageId: coverImageId ?? undefined,
-      updatedAt: now,
-    };
-    this.record(new CopyCoverChanged(this.id, coverImageId, now));
-    return ok(undefined);
-  }
+  ): Result<void, LibraryError> {}
 
   // Attach a photo. Images belong to the Copy (§1.4).
killedBy: changeCover sets the cover to one of the copy's photos and records CopyCoverChanged
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] LogicalOperator
src/library/domain/copy.ts:243:21
   ): Result<void, LibraryError> {
     this.state = {
       ...this.state,
-      coverImageId: coverImageId ?? undefined,
+      coverImageId: coverImageId && undefined,
       updatedAt: now,
     };
killedBy: changeCover sets the cover to one of the copy's photos and records CopyCoverChanged
statusReason: expected undefined to be 'img-1' // Object.is equality

[Killed] BlockStatement
src/library/domain/copy.ts:251:69
   }
 
   // Attach a photo. Images belong to the Copy (§1.4).
-  addImage(image: CopyImage, now: Date): Result<void, LibraryError> {
-    this.state = {
-      ...this.state,
-      images: [...this.state.images, image],
-      updatedAt: now,
-    };
-    this.record(new CopyImageAdded(this.id, image.fileId, image.tag, now));
-    return ok(undefined);
-  }
+  addImage(image: CopyImage, now: Date): Result<void, LibraryError> {}
 
   // Drain recorded events for the publisher; clears the buffer so a save can't double-emit.
killedBy: addImage attaches an image and records CopyImageAdded with the tag
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/library/domain/copy.ts:269:44
   }
 
   // Map to/from persistence without the aggregate knowing about any storage technology.
-  static rehydrate(state: CopyState): Copy {
-    return new Copy(state);
-  }
+  static rehydrate(state: CopyState): Copy {}
 
   toState(): CopyState {
killedBy: rehydrate / toState round-trip rehydrates without re-recording events
statusReason: Cannot read properties of undefined (reading 'pullEvents')

[Killed] BlockStatement
src/library/domain/copy.ts:273:24
     return new Copy(state);
   }
 
-  toState(): CopyState {
-    return this.state;
-  }
+  toState(): CopyState {}
 
   // --- internals ---
killedBy: makeAcquireCopy holds the fetched snapshot on the saved copy
statusReason: expected undefined to be 'Owl' // Object.is equality
