[Killed] StringLiteral
src/library/domain/events.ts:31:19
 // Condition changes are append-friendly (feeds a future condition timeline): each carries
 // the from/to grades.
 export class CopyConditionChanged implements DomainEvent {
-  readonly name = "CopyConditionChanged";
+  readonly name = "";
   constructor(
     readonly copyId: CopyId,
killedBy: changeCondition re-grades and records a from/to CopyConditionChanged
statusReason: expected [ '' ] to deeply equal [ 'CopyConditionChanged' ]

[Killed] StringLiteral
src/library/domain/events.ts:127:19
 // A Loan was opened: possession of the copy passes to the borrower, open-ended (an expectedReturn
 // is advisory, not enforced). The loan history read model folds these.
 export class LoanOpened implements DomainEvent {
-  readonly name = "LoanOpened";
+  readonly name = "";
   constructor(
     readonly loanId: LoanId,
killedBy: loan use cases makeOpenLoan opens a loan, moves possession to the borrower, keeps ownership
statusReason: expected [ '', 'CopyLentOut' ] to deeply equal [ 'LoanOpened', 'CopyLentOut' ]

[Killed] StringLiteral
src/library/domain/events.ts:172:19
 }
 
 export class CollectionCreated implements DomainEvent {
-  readonly name = "CollectionCreated";
+  readonly name = "";
   constructor(
     readonly collectionId: CollectionId,
killedBy: Collection.create starts empty, private, and records CollectionCreated
statusReason: expected [ '' ] to deeply equal [ 'CollectionCreated' ]

[Killed] StringLiteral
src/library/domain/events.ts:183:19
 }
 
 export class CopyAddedToCollection implements DomainEvent {
-  readonly name = "CopyAddedToCollection";
+  readonly name = "";
   constructor(
     readonly collectionId: CollectionId,
killedBy: addCopy / removeCopy adds copies and records CopyAddedToCollection
statusReason: expected [ '' ] to deeply equal [ 'CopyAddedToCollection' ]

[Killed] StringLiteral
src/library/domain/events.ts:228:19
 }
 
 export class PersonalCategoryCreated implements DomainEvent {
-  readonly name = "PersonalCategoryCreated";
+  readonly name = "";
   constructor(
     readonly categoryId: PersonalCategoryId,
killedBy: makeCreatePersonalCategory creates a category and publishes PersonalCategoryCreated
statusReason: expected [ '' ] to deeply equal [ 'PersonalCategoryCreated' ]
