[Killed] ArrayDeclaration
src/library/domain/loan.ts:32:35
 // borrower. Ownership stays with the lender throughout. expectedReturn is advisory only — a loan
 // closes when the borrower returns it or the owner recalls it, with no due-date enforcement.
 export class Loan {
-  private events: DomainEvent[] = [];
+  private events: DomainEvent[] = ["Stryker was here"];
 
   private constructor(private state: LoanState) {}
killedBy: loan use cases makeOpenLoan opens a loan, moves possession to the borrower, keeps ownership
statusReason: expected [ undefined, 'LoanOpened', …(1) ] to deeply equal [ 'LoanOpened', 'CopyLentOut' ]

[Killed] BlockStatement
src/library/domain/loan.ts:36:20
 
   private constructor(private state: LoanState) {}
 
-  get id(): LoanId {
-    return this.state.id;
-  }
+  get id(): LoanId {}
   get copyId(): CopyId {
     return this.state.copyId;
killedBy: Loan.open exposes id, copyId, lenderId and borrowerId through getters
statusReason: expected undefined to be 'loan1' // Object.is equality

[Killed] BlockStatement
src/library/domain/loan.ts:39:24
   get id(): LoanId {
     return this.state.id;
   }
-  get copyId(): CopyId {
-    return this.state.copyId;
-  }
+  get copyId(): CopyId {}
   get lenderId(): OwnerId {
     return this.state.lenderId;
killedBy: loan use cases closing a loan (return / recall) the borrower returns the loan -> possession back to the owner
statusReason: expected 'bob' to be 'alice' // Object.is equality

[Killed] BlockStatement
src/library/domain/loan.ts:42:27
   get copyId(): CopyId {
     return this.state.copyId;
   }
-  get lenderId(): OwnerId {
-    return this.state.lenderId;
-  }
+  get lenderId(): OwnerId {}
   get borrowerId(): OwnerId {
     return this.state.borrowerId;
killedBy: Loan.open exposes id, copyId, lenderId and borrowerId through getters
statusReason: expected undefined to be 'alice' // Object.is equality

[Killed] BlockStatement
src/library/domain/loan.ts:45:29
   get lenderId(): OwnerId {
     return this.state.lenderId;
   }
-  get borrowerId(): OwnerId {
-    return this.state.borrowerId;
-  }
+  get borrowerId(): OwnerId {}
   get status(): LoanStatus {
     return this.state.status;
killedBy: Loan.open exposes id, copyId, lenderId and borrowerId through getters
statusReason: expected undefined to be 'bob' // Object.is equality

[Killed] BlockStatement
src/library/domain/loan.ts:48:28
   get borrowerId(): OwnerId {
     return this.state.borrowerId;
   }
-  get status(): LoanStatus {
-    return this.state.status;
-  }
+  get status(): LoanStatus {}
 
   static open(props: OpenLoanProps): Result<Loan, LibraryError> {
killedBy: Loan.open opens an open loan and records LoanOpened with both parties
statusReason: expected undefined to be 'open' // Object.is equality

[Killed] ConditionalExpression
src/library/domain/loan.ts:53:9
   }
 
   static open(props: OpenLoanProps): Result<Loan, LibraryError> {
-    if (props.lenderId === props.borrowerId) {
+    if (false) {
       return err(LibraryError.cannotLendToSelf());
     }
killedBy: Loan.open rejects lending to self
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/library/domain/loan.ts:53:9
   }
 
   static open(props: OpenLoanProps): Result<Loan, LibraryError> {
-    if (props.lenderId === props.borrowerId) {
+    if (true) {
       return err(LibraryError.cannotLendToSelf());
     }
killedBy: loan use cases makeOpenLoan opens a loan, moves possession to the borrower, keeps ownership
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/library/domain/loan.ts:56:30
     if (props.lenderId === props.borrowerId) {
       return err(LibraryError.cannotLendToSelf());
     }
-    const state: LoanState = {
-      id: props.id,
-      copyId: props.copyId,
-      lenderId: props.lenderId,
-      borrowerId: props.borrowerId,
-      status: "open",
-      openedAt: props.now,
-      expectedReturn: props.expectedReturn,
-    };
+    const state: LoanState = {};
     const loan = new Loan(state);
     loan.record(
killedBy: loan use cases closing a loan (return / recall) the borrower returns the loan -> possession back to the owner
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/library/domain/loan.ts:61:15
       copyId: props.copyId,
       lenderId: props.lenderId,
       borrowerId: props.borrowerId,
-      status: "open",
+      status: "",
       openedAt: props.now,
       expectedReturn: props.expectedReturn,
killedBy: Loan.open opens an open loan and records LoanOpened with both parties
statusReason: expected '' to be 'open' // Object.is equality

[Killed] BlockStatement
src/library/domain/loan.ts:80:72
   }
 
   // The borrower hands the copy back.
-  returnByBorrower(by: OwnerId, now: Date): Result<void, LibraryError> {
-    if (this.state.status !== "open") return err(LibraryError.loanNotOpen());
-    if (by !== this.state.borrowerId) return err(LibraryError.notBorrower());
-    return this.close("returned", now);
-  }
+  returnByBorrower(by: OwnerId, now: Date): Result<void, LibraryError> {}
 
   // The owner asks for the copy back.
killedBy: Loan.returnByBorrower the borrower returns an open loan -> returned + LoanClosed(returned)
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] EqualityOperator
src/library/domain/loan.ts:81:9
 
   // The borrower hands the copy back.
   returnByBorrower(by: OwnerId, now: Date): Result<void, LibraryError> {
-    if (this.state.status !== "open") return err(LibraryError.loanNotOpen());
+    if (this.state.status === "open") return err(LibraryError.loanNotOpen());
     if (by !== this.state.borrowerId) return err(LibraryError.notBorrower());
     return this.close("returned", now);
killedBy: Loan.returnByBorrower the borrower returns an open loan -> returned + LoanClosed(returned)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/library/domain/loan.ts:81:9
 
   // The borrower hands the copy back.
   returnByBorrower(by: OwnerId, now: Date): Result<void, LibraryError> {
-    if (this.state.status !== "open") return err(LibraryError.loanNotOpen());
+    if (false) return err(LibraryError.loanNotOpen());
     if (by !== this.state.borrowerId) return err(LibraryError.notBorrower());
     return this.close("returned", now);
killedBy: Loan.returnByBorrower rejects returning an already-closed loan
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/library/domain/loan.ts:82:9
   // The borrower hands the copy back.
   returnByBorrower(by: OwnerId, now: Date): Result<void, LibraryError> {
     if (this.state.status !== "open") return err(LibraryError.loanNotOpen());
-    if (by !== this.state.borrowerId) return err(LibraryError.notBorrower());
+    if (true) return err(LibraryError.notBorrower());
     return this.close("returned", now);
   }
killedBy: loan use cases closing a loan (return / recall) the borrower returns the loan -> possession back to the owner
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/library/domain/loan.ts:82:9
   // The borrower hands the copy back.
   returnByBorrower(by: OwnerId, now: Date): Result<void, LibraryError> {
     if (this.state.status !== "open") return err(LibraryError.loanNotOpen());
-    if (by !== this.state.borrowerId) return err(LibraryError.notBorrower());
+    if (by === this.state.borrowerId) return err(LibraryError.notBorrower());
     return this.close("returned", now);
   }
killedBy: Loan.returnByBorrower the borrower returns an open loan -> returned + LoanClosed(returned)
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/library/domain/loan.ts:83:23
   returnByBorrower(by: OwnerId, now: Date): Result<void, LibraryError> {
     if (this.state.status !== "open") return err(LibraryError.loanNotOpen());
     if (by !== this.state.borrowerId) return err(LibraryError.notBorrower());
-    return this.close("returned", now);
+    return this.close("", now);
   }
 
killedBy: Loan.returnByBorrower the borrower returns an open loan -> returned + LoanClosed(returned)
statusReason: expected '' to be 'returned' // Object.is equality

[Killed] BlockStatement
src/library/domain/loan.ts:87:69
   }
 
   // The owner asks for the copy back.
-  recallByOwner(by: OwnerId, now: Date): Result<void, LibraryError> {
-    if (this.state.status !== "open") return err(LibraryError.loanNotOpen());
-    if (by !== this.state.lenderId) return err(LibraryError.notLender());
-    return this.close("recalled", now);
-  }
+  recallByOwner(by: OwnerId, now: Date): Result<void, LibraryError> {}
 
   pullEvents(): readonly DomainEvent[] {
killedBy: Loan.recallByOwner the lender recalls an open loan -> recalled + LoanClosed(recalled)
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] EqualityOperator
src/library/domain/loan.ts:88:9
 
   // The owner asks for the copy back.
   recallByOwner(by: OwnerId, now: Date): Result<void, LibraryError> {
-    if (this.state.status !== "open") return err(LibraryError.loanNotOpen());
+    if (this.state.status === "open") return err(LibraryError.loanNotOpen());
     if (by !== this.state.lenderId) return err(LibraryError.notLender());
     return this.close("recalled", now);
killedBy: Loan.recallByOwner the lender recalls an open loan -> recalled + LoanClosed(recalled)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/library/domain/loan.ts:88:9
 
   // The owner asks for the copy back.
   recallByOwner(by: OwnerId, now: Date): Result<void, LibraryError> {
-    if (this.state.status !== "open") return err(LibraryError.loanNotOpen());
+    if (true) return err(LibraryError.loanNotOpen());
     if (by !== this.state.lenderId) return err(LibraryError.notLender());
     return this.close("recalled", now);
killedBy: Loan.recallByOwner the lender recalls an open loan -> recalled + LoanClosed(recalled)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/library/domain/loan.ts:89:9
   // The owner asks for the copy back.
   recallByOwner(by: OwnerId, now: Date): Result<void, LibraryError> {
     if (this.state.status !== "open") return err(LibraryError.loanNotOpen());
-    if (by !== this.state.lenderId) return err(LibraryError.notLender());
+    if (false) return err(LibraryError.notLender());
     return this.close("recalled", now);
   }
killedBy: Loan.recallByOwner rejects a non-lender
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/library/domain/loan.ts:89:9
   // The owner asks for the copy back.
   recallByOwner(by: OwnerId, now: Date): Result<void, LibraryError> {
     if (this.state.status !== "open") return err(LibraryError.loanNotOpen());
-    if (by !== this.state.lenderId) return err(LibraryError.notLender());
+    if (true) return err(LibraryError.notLender());
     return this.close("recalled", now);
   }
killedBy: Loan.recallByOwner the lender recalls an open loan -> recalled + LoanClosed(recalled)
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/library/domain/loan.ts:99:44
     return drained;
   }
 
-  static rehydrate(state: LoanState): Loan {
-    return new Loan(state);
-  }
+  static rehydrate(state: LoanState): Loan {}
 
   toState(): LoanState {
killedBy: Loan rehydrate / toState round-trip rehydrates without re-recording events
statusReason: Cannot read properties of undefined (reading 'pullEvents')

[Killed] BlockStatement
src/library/domain/loan.ts:103:24
     return new Loan(state);
   }
 
-  toState(): LoanState {
-    return this.state;
-  }
+  toState(): LoanState {}
 
   // --- internals ---
killedBy: Loan.open carries an optional expected return date
statusReason: Cannot read properties of undefined (reading 'expectedReturn')

[Killed] BlockStatement
src/library/domain/loan.ts:112:33
   private close(
     reason: "returned" | "recalled",
     now: Date,
-  ): Result<void, LibraryError> {
-    this.state = { ...this.state, status: reason, closedAt: now };
-    this.record(
-      new LoanClosed(
-        this.state.id,
-        this.state.copyId,
-        this.state.lenderId,
-        this.state.borrowerId,
-        reason,
-        now,
-      ),
-    );
-    return ok(undefined);
-  }
+  ): Result<void, LibraryError> {}
 
   private record(event: DomainEvent): void {
killedBy: Loan.returnByBorrower the borrower returns an open loan -> returned + LoanClosed(returned)
statusReason: Cannot read properties of undefined (reading 'isOk')
