[Killed] ArrayDeclaration
src/library/domain/personal-category.ts:30:35
 }
 
 export class PersonalCategory {
-  private events: DomainEvent[] = [];
+  private events: DomainEvent[] = ["Stryker was here"];
 
   private constructor(private state: PersonalCategoryState) {}
killedBy: makeCreatePersonalCategory creates a category and publishes PersonalCategoryCreated
statusReason: expected [ Array(2) ] to deeply equal [ 'PersonalCategoryCreated' ]

[Killed] BlockStatement
src/library/domain/personal-category.ts:34:32
 
   private constructor(private state: PersonalCategoryState) {}
 
-  get id(): PersonalCategoryId {
-    return this.state.id;
-  }
+  get id(): PersonalCategoryId {}
 
   get ownerId(): OwnerId {
killedBy: PersonalCategory.create exposes the supplied identity through its getters
statusReason: expected undefined to be 'pc1' // Object.is equality

[Killed] BlockStatement
src/library/domain/personal-category.ts:48:45
 
   static create(
     props: CreatePersonalCategoryProps,
-  ): Result<PersonalCategory, LibraryError> {
-    const state: PersonalCategoryState = {
-      id: props.id,
-      ownerId: props.ownerId,
-      name: props.name,
-      color: props.color,
-      description: props.description,
-      isDefault: props.isDefault ?? false,
-      createdAt: props.now,
-      updatedAt: props.now,
-    };
-    const category = new PersonalCategory(state);
-    category.record(
-      new PersonalCategoryCreated(
-        state.id,
-        state.ownerId,
-        state.name,
-        props.now,
-      ),
-    );
-    return ok(category);
-  }
+  ): Result<PersonalCategory, LibraryError> {}
 
   pullEvents(): readonly DomainEvent[] {
killedBy: makeCreatePersonalCategory creates a category and publishes PersonalCategoryCreated
statusReason: Cannot read properties of undefined (reading 'isErr')

[Killed] ObjectLiteral
src/library/domain/personal-category.ts:49:42
   static create(
     props: CreatePersonalCategoryProps,
   ): Result<PersonalCategory, LibraryError> {
-    const state: PersonalCategoryState = {
-      id: props.id,
-      ownerId: props.ownerId,
-      name: props.name,
-      color: props.color,
-      description: props.description,
-      isDefault: props.isDefault ?? false,
-      createdAt: props.now,
-      updatedAt: props.now,
-    };
+    const state: PersonalCategoryState = {};
     const category = new PersonalCategory(state);
     category.record(
killedBy: PersonalCategory.create exposes the supplied identity through its getters
statusReason: expected undefined to be 'pc1' // Object.is equality

[Killed] LogicalOperator
src/library/domain/personal-category.ts:55:18
       name: props.name,
       color: props.color,
       description: props.description,
-      isDefault: props.isDefault ?? false,
+      isDefault: props.isDefault && false,
       createdAt: props.now,
       updatedAt: props.now,
killedBy: PersonalCategory.create defaults isDefault to false but honours an explicit true
statusReason: expected undefined to be false // Object.is equality

[Killed] BooleanLiteral
src/library/domain/personal-category.ts:55:37
       name: props.name,
       color: props.color,
       description: props.description,
-      isDefault: props.isDefault ?? false,
+      isDefault: props.isDefault ?? true,
       createdAt: props.now,
       updatedAt: props.now,
killedBy: PersonalCategory.create defaults isDefault to false but honours an explicit true
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/library/domain/personal-category.ts:77:68
     return drained;
   }
 
-  static rehydrate(state: PersonalCategoryState): PersonalCategory {
-    return new PersonalCategory(state);
-  }
+  static rehydrate(state: PersonalCategoryState): PersonalCategory {}
 
   toState(): PersonalCategoryState {
killedBy: PersonalCategory rehydrate / pullEvents rehydrates from state without re-recording events
statusReason: Cannot read properties of undefined (reading 'pullEvents')

[Killed] BlockStatement
src/library/domain/personal-category.ts:81:36
     return new PersonalCategory(state);
   }
 
-  toState(): PersonalCategoryState {
-    return this.state;
-  }
+  toState(): PersonalCategoryState {}
 
   private record(event: DomainEvent): void {
killedBy: makeCreatePersonalCategory rejects a duplicate name for the same owner
statusReason: Cannot read properties of undefined (reading 'ownerId')
