[Killed] BlockStatement
src/library/domain/price.ts:16:34
   static create(
     amountCents: number,
     currency: string,
-  ): Result<Price, LibraryError> {
-    if (!Number.isInteger(amountCents) || amountCents <= 0) {
-      return err(
-        LibraryError.invalidPrice("amount must be a positive integer (cents)"),
-      );
-    }
-    if (currency.length !== 3) {
-      return err(
-        LibraryError.invalidPrice("currency must be a 3-letter ISO code"),
-      );
-    }
-    return ok(new Price(amountCents, currency.toUpperCase()));
-  }
+  ): Result<Price, LibraryError> {}
 
   // Rehydrate a persisted value that was already validated when first stored.
killedBy: Copy.acquire captures an optional acquisition with price
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] ConditionalExpression
src/library/domain/price.ts:17:9
     amountCents: number,
     currency: string,
   ): Result<Price, LibraryError> {
-    if (!Number.isInteger(amountCents) || amountCents <= 0) {
+    if (true) {
       return err(
         LibraryError.invalidPrice("amount must be a positive integer (cents)"),
killedBy: Copy.acquire captures an optional acquisition with price
statusReason: setup

[Killed] BooleanLiteral
src/library/domain/price.ts:17:9
     amountCents: number,
     currency: string,
   ): Result<Price, LibraryError> {
-    if (!Number.isInteger(amountCents) || amountCents <= 0) {
+    if (Number.isInteger(amountCents) || amountCents <= 0) {
       return err(
         LibraryError.invalidPrice("amount must be a positive integer (cents)"),
killedBy: Copy.acquire captures an optional acquisition with price
statusReason: setup

[Killed] BlockStatement
src/library/domain/price.ts:22:32
         LibraryError.invalidPrice("amount must be a positive integer (cents)"),
       );
     }
-    if (currency.length !== 3) {
-      return err(
-        LibraryError.invalidPrice("currency must be a 3-letter ISO code"),
-      );
-    }
+    if (currency.length !== 3) {}
     return ok(new Price(amountCents, currency.toUpperCase()));
   }
killedBy: Price.create rejects a currency that is too short
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/library/domain/price.ts:27:38
         LibraryError.invalidPrice("currency must be a 3-letter ISO code"),
       );
     }
-    return ok(new Price(amountCents, currency.toUpperCase()));
+    return ok(new Price(amountCents, currency.toLowerCase()));
   }
 
killedBy: Price.create accepts a positive integer amount and upper-cases the currency
statusReason: expected 'usd' to be 'USD' // Object.is equality

[Killed] BlockStatement
src/library/domain/price.ts:31:66
   }
 
   // Rehydrate a persisted value that was already validated when first stored.
-  static fromState(amountCents: number, currency: string): Price {
-    return new Price(amountCents, currency);
-  }
+  static fromState(amountCents: number, currency: string): Price {}
 }
 
killedBy: Price.fromState rehydrates a persisted value verbatim, without re-validating or normalising
statusReason: Cannot read properties of undefined (reading 'amountCents')
