[Killed] BlockStatement
src/library/domain/sharing-setting.ts:30:36
   ) {}
 
   // The safe default for a freshly acquired Copy: private, not offered for anything.
-  static private(): SharingSetting {
-    return new SharingSetting("private", false, false, false);
-  }
+  static private(): SharingSetting {}
 
   static create(props: {
killedBy: DefaultVisibilityPolicy the owner can view their own private copy
statusReason: Cannot read properties of undefined (reading 'isAvailableForAnyExchange')

[Killed] BooleanLiteral
src/library/domain/sharing-setting.ts:31:49
 
   // The safe default for a freshly acquired Copy: private, not offered for anything.
   static private(): SharingSetting {
-    return new SharingSetting("private", false, false, false);
+    return new SharingSetting("private", false, true, false);
   }
 
killedBy: DefaultVisibilityPolicy a stranger cannot view a private, non-offered copy
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/library/domain/sharing-setting.ts:31:42
 
   // The safe default for a freshly acquired Copy: private, not offered for anything.
   static private(): SharingSetting {
-    return new SharingSetting("private", false, false, false);
+    return new SharingSetting("private", true, false, false);
   }
 
killedBy: Copy.acquire defaults to a private sharing setting (not available for any exchange)
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/library/domain/sharing-setting.ts:40:22
     readonly forSale?: boolean;
     readonly forLend?: boolean;
     readonly salePrice?: Price;
-  }): SharingSetting {
-    return new SharingSetting(
-      props.visibility,
-      props.forTrade ?? false,
-      props.forSale ?? false,
-      props.forLend ?? false,
-      props.salePrice,
-    );
-  }
+  }): SharingSetting {}
 
   // Is this copy offered for the given exchange kind? swappable⇒trade, tradeable⇒sale,
killedBy: DefaultVisibilityPolicy the owner can always view but cannot transact with themselves
statusReason: Cannot read properties of undefined (reading 'isAvailableForAnyExchange')

[Killed] BooleanLiteral
src/library/domain/sharing-setting.ts:43:25
   }): SharingSetting {
     return new SharingSetting(
       props.visibility,
-      props.forTrade ?? false,
+      props.forTrade ?? true,
       props.forSale ?? false,
       props.forLend ?? false,
killedBy: DefaultVisibilityPolicy a stranger can view a public copy but cannot transact when no kind is offered
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/library/domain/sharing-setting.ts:43:7
   }): SharingSetting {
     return new SharingSetting(
       props.visibility,
-      props.forTrade ?? false,
+      props.forTrade && false,
       props.forSale ?? false,
       props.forLend ?? false,
killedBy: copy mutation use cases makeUpdateCopySharing updates sharing and publishes CopyMadeAvailable
statusReason: expected [ 'CopyMadeUnavailable' ] to deeply equal [ 'CopyMadeAvailable' ]

[Killed] BooleanLiteral
src/library/domain/sharing-setting.ts:44:24
     return new SharingSetting(
       props.visibility,
       props.forTrade ?? false,
-      props.forSale ?? false,
+      props.forSale ?? true,
       props.forLend ?? false,
       props.salePrice,
killedBy: updateSharing emits CopyMadeUnavailable when no exchange kind is offered
statusReason: expected [ 'CopyMadeAvailable' ] to deeply equal [ 'CopyMadeUnavailable' ]

[Killed] LogicalOperator
src/library/domain/sharing-setting.ts:44:7
     return new SharingSetting(
       props.visibility,
       props.forTrade ?? false,
-      props.forSale ?? false,
+      props.forSale && false,
       props.forLend ?? false,
       props.salePrice,
killedBy: DefaultVisibilityPolicy a stranger can view and transact on a copy offered for exchange
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/library/domain/sharing-setting.ts:45:7
       props.visibility,
       props.forTrade ?? false,
       props.forSale ?? false,
-      props.forLend ?? false,
+      props.forLend && false,
       props.salePrice,
     );
killedBy: DefaultVisibilityPolicy a stranger can view a public copy but cannot transact when no kind is offered
statusReason: expected undefined to be false // Object.is equality

[Killed] BooleanLiteral
src/library/domain/sharing-setting.ts:45:24
       props.visibility,
       props.forTrade ?? false,
       props.forSale ?? false,
-      props.forLend ?? false,
+      props.forLend ?? true,
       props.salePrice,
     );
killedBy: copy mutation use cases makeUpdateCopySharing does not consult the reservation seam when withdrawing availability
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/library/domain/sharing-setting.ts:52:59
 
   // Is this copy offered for the given exchange kind? swappable⇒trade, tradeable⇒sale,
   // lendable⇒lend (the spec's level names map onto these flags).
-  isAvailableFor(kind: ExchangeAvailabilityKind): boolean {
-    switch (kind) {
-      case "trade":
-        return this.forTrade;
-      case "sale":
-        return this.forSale;
-      case "lend":
-        return this.forLend;
-    }
-  }
+  isAvailableFor(kind: ExchangeAvailabilityKind): boolean {}
 
   // Offered for at least one kind of exchange.
killedBy: updateSharing emits CopyMadeAvailable when offered for an exchange kind
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/library/domain/sharing-setting.ts:54:7
   // lendable⇒lend (the spec's level names map onto these flags).
   isAvailableFor(kind: ExchangeAvailabilityKind): boolean {
     switch (kind) {
-      case "trade":
-        return this.forTrade;
+      case "trade":
       case "sale":
         return this.forSale;
killedBy: updateSharing emits CopyMadeAvailable when offered for an exchange kind
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/library/domain/sharing-setting.ts:54:12
   // lendable⇒lend (the spec's level names map onto these flags).
   isAvailableFor(kind: ExchangeAvailabilityKind): boolean {
     switch (kind) {
-      case "trade":
+      case "":
         return this.forTrade;
       case "sale":
killedBy: updateSharing emits CopyMadeAvailable when offered for an exchange kind
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/library/domain/sharing-setting.ts:56:7
     switch (kind) {
       case "trade":
         return this.forTrade;
-      case "sale":
-        return this.forSale;
+      case "sale":
       case "lend":
         return this.forLend;
killedBy: SharingSetting isAvailableFor maps each kind onto its flag
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
src/library/domain/sharing-setting.ts:56:12
     switch (kind) {
       case "trade":
         return this.forTrade;
-      case "sale":
+      case "":
         return this.forSale;
       case "lend":
killedBy: SharingSetting isAvailableFor maps each kind onto its flag
statusReason: expected undefined to be false // Object.is equality

[Killed] ConditionalExpression
src/library/domain/sharing-setting.ts:58:7
         return this.forTrade;
       case "sale":
         return this.forSale;
-      case "lend":
-        return this.forLend;
+      case "lend":
     }
   }
killedBy: SharingSetting isAvailableFor maps each kind onto its flag
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/library/domain/sharing-setting.ts:64:40
   }
 
   // Offered for at least one kind of exchange.
-  isAvailableForAnyExchange(): boolean {
-    return this.forTrade || this.forSale || this.forLend;
-  }
+  isAvailableForAnyExchange(): boolean {}
 
   // Anyone other than the owner may see this copy when it is public or offered for exchange
killedBy: SharingSetting private() is private and offered for nothing
statusReason: expected undefined to be false // Object.is equality

[Killed] LogicalOperator
src/library/domain/sharing-setting.ts:65:12
 
   // Offered for at least one kind of exchange.
   isAvailableForAnyExchange(): boolean {
-    return this.forTrade || this.forSale || this.forLend;
+    return this.forTrade && this.forSale || this.forLend;
   }
 
killedBy: SharingSetting a private copy offered for exchange is still publicly visible (offer implies visibility)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/library/domain/sharing-setting.ts:65:12
 
   // Offered for at least one kind of exchange.
   isAvailableForAnyExchange(): boolean {
-    return this.forTrade || this.forSale || this.forLend;
+    return false;
   }
 
killedBy: DefaultVisibilityPolicy a stranger can view and transact on a copy offered for exchange
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/library/domain/sharing-setting.ts:71:32
   // Anyone other than the owner may see this copy when it is public or offered for exchange
   // (an exchange offer is meaningless if the copy is invisible). Friend-circle scoping is
   // layered on top of this in Phase 6.
-  isPubliclyVisible(): boolean {
-    return this.visibility === "visible" || this.isAvailableForAnyExchange();
-  }
+  isPubliclyVisible(): boolean {}
 }
 
killedBy: DefaultVisibilityPolicy a stranger cannot view a private, non-offered copy
statusReason: expected undefined to be false // Object.is equality

[Killed] LogicalOperator
src/library/domain/sharing-setting.ts:72:12
   // (an exchange offer is meaningless if the copy is invisible). Friend-circle scoping is
   // layered on top of this in Phase 6.
   isPubliclyVisible(): boolean {
-    return this.visibility === "visible" || this.isAvailableForAnyExchange();
+    return this.visibility === "visible" && this.isAvailableForAnyExchange();
   }
 }
killedBy: SharingSetting a private copy offered for exchange is still publicly visible (offer implies visibility)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/library/domain/sharing-setting.ts:72:12
   // (an exchange offer is meaningless if the copy is invisible). Friend-circle scoping is
   // layered on top of this in Phase 6.
   isPubliclyVisible(): boolean {
-    return this.visibility === "visible" || this.isAvailableForAnyExchange();
+    return false;
   }
 }
killedBy: SharingSetting a private copy offered for exchange is still publicly visible (offer implies visibility)
statusReason: expected false to be true // Object.is equality
