[Killed] ArrowFunction
notifications/application/use-cases/mark-notification-read.ts:25:3
 // Load the notification, delegate the ownership + idempotency rules to the aggregate, then save
 // and publish. A missing notification is an application error; a wrong owner is a domain error.
 export const makeMarkNotificationRead =
-  (deps: MarkNotificationReadDeps): MarkNotificationRead =>
-  async (
-    cmd: MarkNotificationReadCommand,
-  ): Promise<
-    Result<void, NotificationError | NotificationApplicationError>
-  > => {
-    const notification = await deps.notifications.findById(cmd.notificationId);
-    if (!notification) {
-      return err(
-        NotificationApplicationError.notificationNotFound(cmd.notificationId),
-      );
-    }
-
-    const marked = notification.markRead(cmd.memberId, deps.clock.now());
-    if (marked.isErr) return err(marked.error);
-
-    await deps.notifications.save(notification);
-    await deps.events.publish(notification.pullEvents());
-    return ok(undefined);
-  };
+  () => undefined;
 
killedBy: makeMarkNotificationRead marks the owner's notification read and publishes NotificationRead
statusReason: markRead is not a function

[Killed] BlockStatement
notifications/application/use-cases/mark-notification-read.ts:30:8
     cmd: MarkNotificationReadCommand,
   ): Promise<
     Result<void, NotificationError | NotificationApplicationError>
-  > => {
-    const notification = await deps.notifications.findById(cmd.notificationId);
-    if (!notification) {
-      return err(
-        NotificationApplicationError.notificationNotFound(cmd.notificationId),
-      );
-    }
-
-    const marked = notification.markRead(cmd.memberId, deps.clock.now());
-    if (marked.isErr) return err(marked.error);
-
-    await deps.notifications.save(notification);
-    await deps.events.publish(notification.pullEvents());
-    return ok(undefined);
-  };
+  > => {};
 
killedBy: makeMarkNotificationRead marks the owner's notification read and publishes NotificationRead
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] ConditionalExpression
notifications/application/use-cases/mark-notification-read.ts:32:9
     Result<void, NotificationError | NotificationApplicationError>
   > => {
     const notification = await deps.notifications.findById(cmd.notificationId);
-    if (!notification) {
+    if (false) {
       return err(
         NotificationApplicationError.notificationNotFound(cmd.notificationId),
killedBy: makeMarkNotificationRead returns NotificationNotFound for an unknown id
statusReason: Cannot read properties of null (reading 'markRead')

[Killed] BooleanLiteral
notifications/application/use-cases/mark-notification-read.ts:32:9
     Result<void, NotificationError | NotificationApplicationError>
   > => {
     const notification = await deps.notifications.findById(cmd.notificationId);
-    if (!notification) {
+    if (notification) {
       return err(
         NotificationApplicationError.notificationNotFound(cmd.notificationId),
killedBy: makeMarkNotificationRead marks the owner's notification read and publishes NotificationRead
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
notifications/application/use-cases/mark-notification-read.ts:39:9
     }
 
     const marked = notification.markRead(cmd.memberId, deps.clock.now());
-    if (marked.isErr) return err(marked.error);
+    if (true) return err(marked.error);
 
     await deps.notifications.save(notification);
killedBy: makeMarkNotificationRead marks the owner's notification read and publishes NotificationRead
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
notifications/application/use-cases/mark-notification-read.ts:39:9
     }
 
     const marked = notification.markRead(cmd.memberId, deps.clock.now());
-    if (marked.isErr) return err(marked.error);
+    if (false) return err(marked.error);
 
     await deps.notifications.save(notification);
killedBy: makeMarkNotificationRead rejects a non-owner with NotNotificationOwner and does not mutate
statusReason: expected true to be false // Object.is equality
