[Killed] LogicalOperator
notifications/application/use-cases/notify-member.ts:49:44
   ): Promise<Result<readonly NotificationId[], never>> => {
     const preference = await loadPreference(deps, cmd.memberId);
 
-    const candidates: readonly Channel[] = cmd.channels ?? CHANNELS;
+    const candidates: readonly Channel[] = cmd.channels && CHANNELS;
     const allowed = candidates.filter(
       (channel) =>
killedBy: makeNotifyMember creates one in-app notification by default (no stored preference)
statusReason: Cannot read properties of undefined (reading 'filter')

[Killed] MethodExpression
notifications/application/use-cases/notify-member.ts:50:21
     const preference = await loadPreference(deps, cmd.memberId);
 
     const candidates: readonly Channel[] = cmd.channels ?? CHANNELS;
-    const allowed = candidates.filter(
-      (channel) =>
-        (channel !== "email" || EMAIL_ELIGIBLE_TYPES.has(cmd.type)) &&
-        preference.allows(cmd.type, channel),
-    );
+    const allowed = candidates;
 
     const created: NotificationId[] = [];
killedBy: makeNotifyMember creates one in-app notification by default (no stored preference)
statusReason: expected [ 'ntf-1', 'ntf-2', 'ntf-3' ] to have a length of 1 but got 3

[Killed] ArrowFunction
notifications/application/use-cases/notify-member.ts:51:7
 
     const candidates: readonly Channel[] = cmd.channels ?? CHANNELS;
     const allowed = candidates.filter(
-      (channel) =>
-        (channel !== "email" || EMAIL_ELIGIBLE_TYPES.has(cmd.type)) &&
-        preference.allows(cmd.type, channel),
+      () => undefined,
     );
 
killedBy: makeNotifyMember creates one in-app notification by default (no stored preference)
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
notifications/application/use-cases/notify-member.ts:52:10
     const candidates: readonly Channel[] = cmd.channels ?? CHANNELS;
     const allowed = candidates.filter(
       (channel) =>
-        (channel !== "email" || EMAIL_ELIGIBLE_TYPES.has(cmd.type)) &&
+        (false || EMAIL_ELIGIBLE_TYPES.has(cmd.type)) &&
         preference.allows(cmd.type, channel),
     );
killedBy: makeNotifyMember never delivers email for a type outside EMAIL_ELIGIBLE_TYPES, even when opted in
statusReason: expected [] to deeply equal [ 'inApp' ]

[Killed] LogicalOperator
notifications/application/use-cases/notify-member.ts:52:10
     const candidates: readonly Channel[] = cmd.channels ?? CHANNELS;
     const allowed = candidates.filter(
       (channel) =>
-        (channel !== "email" || EMAIL_ELIGIBLE_TYPES.has(cmd.type)) &&
+        (channel !== "email" && EMAIL_ELIGIBLE_TYPES.has(cmd.type)) &&
         preference.allows(cmd.type, channel),
     );
killedBy: makeNotifyMember delivers email when the member opts into the email channel
statusReason: expected [ 'ntf-1' ] to have a length of 2 but got 1

[Killed] BlockStatement
notifications/application/use-cases/notify-member.ts:60:36
     const pending: DomainEvent[] = [];
     const now = deps.clock.now();
 
-    for (const channel of allowed) {
-      const notification = Notification.create({
-        id: deps.notificationIds.next(),
-        userId: cmd.memberId,
-        type: cmd.type,
-        params: cmd.params,
-        relatedId: cmd.relatedId,
-        channel,
-        now,
-      });
-      // Delivery owns the medium: in-app persists, email/push dispatch out-of-band. The use case
-      // stays oblivious to which, and must NOT also persist or in-app rows would double-write.
-      await deps.delivery.deliver(channel, notification);
-      created.push(notification.id);
-      pending.push(...notification.pullEvents());
-    }
+    for (const channel of allowed) {}
 
     if (pending.length > 0) {
killedBy: makeNotifyMember creates one in-app notification by default (no stored preference)
statusReason: expected [] to have a length of 1 but got +0

[Killed] ObjectLiteral
notifications/application/use-cases/notify-member.ts:61:48
     const now = deps.clock.now();
 
     for (const channel of allowed) {
-      const notification = Notification.create({
-        id: deps.notificationIds.next(),
-        userId: cmd.memberId,
-        type: cmd.type,
-        params: cmd.params,
-        relatedId: cmd.relatedId,
-        channel,
-        now,
-      });
+      const notification = Notification.create({});
       // Delivery owns the medium: in-app persists, email/push dispatch out-of-band. The use case
       // stays oblivious to which, and must NOT also persist or in-app rows would double-write.
killedBy: makeNotifyMember creates one in-app notification by default (no stored preference)
statusReason: Cannot read properties of undefined (reading 'channel')

[Killed] EqualityOperator
notifications/application/use-cases/notify-member.ts:77:9
       pending.push(...notification.pullEvents());
     }
 
-    if (pending.length > 0) {
+    if (pending.length >= 0) {
       await deps.events.publish(pending);
     }
killedBy: makeNotifyMember suppresses the notification when the type/channel is disabled (no-op)
statusReason: expected [ [] ] to deeply equal []

[Killed] ConditionalExpression
notifications/application/use-cases/notify-member.ts:77:9
       pending.push(...notification.pullEvents());
     }
 
-    if (pending.length > 0) {
+    if (true) {
       await deps.events.publish(pending);
     }
killedBy: makeNotifyMember suppresses the notification when the type/channel is disabled (no-op)
statusReason: expected [ [] ] to deeply equal []

[Killed] BlockStatement
notifications/application/use-cases/notify-member.ts:88:39
 const loadPreference = async (
   deps: NotifyMemberDeps,
   memberId: MemberId,
-): Promise<NotificationPreference> => {
-  const existing = await deps.preferences.findByMember(memberId);
-  if (existing) return existing;
-
-  const fresh = NotificationPreference.createDefault(
-    deps.preferenceIds.next(),
-    memberId,
-    deps.clock.now(),
-  );
-  await deps.preferences.save(fresh);
-  return fresh;
-};
+): Promise<NotificationPreference> => {};
 
killedBy: makeNotifyMember creates one in-app notification by default (no stored preference)
statusReason: Cannot read properties of undefined (reading 'allows')

[Killed] ConditionalExpression
notifications/application/use-cases/notify-member.ts:90:7
   memberId: MemberId,
 ): Promise<NotificationPreference> => {
   const existing = await deps.preferences.findByMember(memberId);
-  if (existing) return existing;
+  if (false) return existing;
 
   const fresh = NotificationPreference.createDefault(
killedBy: makeNotifyMember suppresses the notification when the type/channel is disabled (no-op)
statusReason: expected [ 'ntf-1' ] to deeply equal []

[Killed] ConditionalExpression
notifications/application/use-cases/notify-member.ts:90:7
   memberId: MemberId,
 ): Promise<NotificationPreference> => {
   const existing = await deps.preferences.findByMember(memberId);
-  if (existing) return existing;
+  if (true) return existing;
 
   const fresh = NotificationPreference.createDefault(
killedBy: makeNotifyMember creates one in-app notification by default (no stored preference)
statusReason: Cannot read properties of null (reading 'allows')
