[Killed] ArrowFunction
notifications/application/use-cases/update-notification-preference.ts:26:3
 // member has none stored. Delegates enablement (and the no-op-when-unchanged rule) to the
 // aggregate, then saves and publishes any PreferenceChanged event.
 export const makeUpdateNotificationPreference =
-  (deps: UpdateNotificationPreferenceDeps): UpdateNotificationPreference =>
-  async (
-    cmd: UpdateNotificationPreferenceCommand,
-  ): Promise<Result<void, never>> => {
-    const now = deps.clock.now();
-    const preference =
-      (await deps.preferences.findByMember(cmd.memberId)) ??
-      NotificationPreference.createDefault(
-        deps.preferenceIds.next(),
-        cmd.memberId,
-        now,
-      );
-
-    if (cmd.enabled) {
-      preference.enable(cmd.type, cmd.channel, now);
-    } else {
-      preference.disable(cmd.type, cmd.channel, now);
-    }
-
-    await deps.preferences.save(preference);
-    await deps.events.publish(preference.pullEvents());
-    return ok(undefined);
-  };
+  () => undefined;
 
killedBy: makeUpdateNotificationPreference materialises a default preference then toggles a channel on; allows() reflects it
statusReason: update is not a function

[Killed] BlockStatement
notifications/application/use-cases/update-notification-preference.ts:29:38
   (deps: UpdateNotificationPreferenceDeps): UpdateNotificationPreference =>
   async (
     cmd: UpdateNotificationPreferenceCommand,
-  ): Promise<Result<void, never>> => {
-    const now = deps.clock.now();
-    const preference =
-      (await deps.preferences.findByMember(cmd.memberId)) ??
-      NotificationPreference.createDefault(
-        deps.preferenceIds.next(),
-        cmd.memberId,
-        now,
-      );
-
-    if (cmd.enabled) {
-      preference.enable(cmd.type, cmd.channel, now);
-    } else {
-      preference.disable(cmd.type, cmd.channel, now);
-    }
-
-    await deps.preferences.save(preference);
-    await deps.events.publish(preference.pullEvents());
-    return ok(undefined);
-  };
+  ): Promise<Result<void, never>> => {};
 
killedBy: makeUpdateNotificationPreference materialises a default preference then toggles a channel on; allows() reflects it
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] LogicalOperator
notifications/application/use-cases/update-notification-preference.ts:32:7
   ): Promise<Result<void, never>> => {
     const now = deps.clock.now();
     const preference =
-      (await deps.preferences.findByMember(cmd.memberId)) ??
-      NotificationPreference.createDefault(
-        deps.preferenceIds.next(),
-        cmd.memberId,
-        now,
-      );
+      (await deps.preferences.findByMember(cmd.memberId)) && NotificationPreference.createDefault(deps.preferenceIds.next(), cmd.memberId, now);
 
     if (cmd.enabled) {
killedBy: makeUpdateNotificationPreference materialises a default preference then toggles a channel on; allows() reflects it
statusReason: Cannot read properties of null (reading 'enable')

[Killed] ConditionalExpression
notifications/application/use-cases/update-notification-preference.ts:39:9
         now,
       );
 
-    if (cmd.enabled) {
+    if (true) {
       preference.enable(cmd.type, cmd.channel, now);
     } else {
killedBy: makeUpdateNotificationPreference disabling the default inApp channel makes allows() false
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
notifications/application/use-cases/update-notification-preference.ts:39:9
         now,
       );
 
-    if (cmd.enabled) {
+    if (false) {
       preference.enable(cmd.type, cmd.channel, now);
     } else {
killedBy: makeUpdateNotificationPreference materialises a default preference then toggles a channel on; allows() reflects it
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
notifications/application/use-cases/update-notification-preference.ts:41:12
 
     if (cmd.enabled) {
       preference.enable(cmd.type, cmd.channel, now);
-    } else {
-      preference.disable(cmd.type, cmd.channel, now);
-    }
+    } else {}
 
     await deps.preferences.save(preference);
killedBy: makeUpdateNotificationPreference disabling the default inApp channel makes allows() false
statusReason: expected true to be false // Object.is equality
