[Killed] BlockStatement
src/notifications/domain/notification-preference.ts:27:80
 
 // Build the sensible default toggle map: every type enabled on inApp, email/push off. This is the
 // policy a member with no stored preference gets (the application layer materialises one of these).
-const defaultToggles = (): Record<NotificationType, ResolvedChannelToggles> => {
-  const map = {} as Record<NotificationType, ResolvedChannelToggles>;
-  for (const type of NOTIFICATION_TYPES) {
-    map[type] = { inApp: true, email: false, push: false };
-  }
-  return map;
-};
+const defaultToggles = (): Record<NotificationType, ResolvedChannelToggles> => {};
 
 // NotificationPreference: the per-member aggregate root governing which (type, channel) deliveries
killedBy: NotificationPreference.createDefault enables every type on inApp and disables email/push by default
statusReason: Cannot read properties of undefined (reading 'trade_request')

[Killed] BlockStatement
src/notifications/domain/notification-preference.ts:29:42
 // policy a member with no stored preference gets (the application layer materialises one of these).
 const defaultToggles = (): Record<NotificationType, ResolvedChannelToggles> => {
   const map = {} as Record<NotificationType, ResolvedChannelToggles>;
-  for (const type of NOTIFICATION_TYPES) {
-    map[type] = { inApp: true, email: false, push: false };
-  }
+  for (const type of NOTIFICATION_TYPES) {}
   return map;
 };
killedBy: makeNotifyMember creates one in-app notification by default (no stored preference)
statusReason: Cannot read properties of undefined (reading 'inApp')

[Killed] BooleanLiteral
src/notifications/domain/notification-preference.ts:30:26
 const defaultToggles = (): Record<NotificationType, ResolvedChannelToggles> => {
   const map = {} as Record<NotificationType, ResolvedChannelToggles>;
   for (const type of NOTIFICATION_TYPES) {
-    map[type] = { inApp: true, email: false, push: false };
+    map[type] = { inApp: false, email: false, push: false };
   }
   return map;
killedBy: NotificationPreference.createDefault enables every type on inApp and disables email/push by default
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/notifications/domain/notification-preference.ts:30:39
 const defaultToggles = (): Record<NotificationType, ResolvedChannelToggles> => {
   const map = {} as Record<NotificationType, ResolvedChannelToggles>;
   for (const type of NOTIFICATION_TYPES) {
-    map[type] = { inApp: true, email: false, push: false };
+    map[type] = { inApp: true, email: true, push: false };
   }
   return map;
killedBy: makeNotifyMember creates one in-app notification by default (no stored preference)
statusReason: expected [ 'ntf-1', 'ntf-2' ] to have a length of 1 but got 2

[Killed] BlockStatement
src/notifications/domain/notification-preference.ts:43:38
 
   private constructor(private state: NotificationPreferenceState) {}
 
-  get id(): NotificationPreferenceId {
-    return this.state.id;
-  }
+  get id(): NotificationPreferenceId {}
 
   get memberId(): MemberId {
killedBy: NotificationPreference.createDefault enables every type on inApp and disables email/push by default
statusReason: expected undefined to be 'pref1' // Object.is equality

[Killed] BlockStatement
src/notifications/domain/notification-preference.ts:56:29
     id: NotificationPreferenceId,
     memberId: MemberId,
     now: Date,
-  ): NotificationPreference {
-    return new NotificationPreference({
-      id,
-      memberId,
-      toggles: defaultToggles(),
-      updatedAt: now,
-    });
-  }
+  ): NotificationPreference {}
 
   // Does this member accept a notification of `type` on `channel`? Falls back PER CHANNEL: absent
killedBy: makeUpdateNotificationPreference materialises a default preference then toggles a channel on; allows() reflects it
statusReason: Cannot read properties of undefined (reading 'enable')

[Killed] ObjectLiteral
src/notifications/domain/notification-preference.ts:57:39
     memberId: MemberId,
     now: Date,
   ): NotificationPreference {
-    return new NotificationPreference({
-      id,
-      memberId,
-      toggles: defaultToggles(),
-      updatedAt: now,
-    });
+    return new NotificationPreference({});
   }
 
killedBy: NotificationPreference.createDefault enables every type on inApp and disables email/push by default
statusReason: Cannot read properties of undefined (reading 'trade_request')

[Killed] BlockStatement
src/notifications/domain/notification-preference.ts:68:61
   // Does this member accept a notification of `type` on `channel`? Falls back PER CHANNEL: absent
   // keys arise from type-level absence (untouched types, or types added after the row was written)
   // or channels added later; an explicit stored value (including false) always wins.
-  allows(type: NotificationType, channel: Channel): boolean {
-    return (
-      this.state.toggles[type]?.[channel] ?? defaultToggles()[type][channel]
-    );
-  }
+  allows(type: NotificationType, channel: Channel): boolean {}
 
   // The full 21-type read model: every NOTIFICATION_TYPES member resolved to its complete
killedBy: makeNotifyMember creates one in-app notification by default (no stored preference)
statusReason: expected [] to have a length of 1 but got +0

[Killed] OptionalChaining
src/notifications/domain/notification-preference.ts:70:7
   // or channels added later; an explicit stored value (including false) always wins.
   allows(type: NotificationType, channel: Channel): boolean {
     return (
-      this.state.toggles[type]?.[channel] ?? defaultToggles()[type][channel]
+      this.state.toggles[type][channel] ?? defaultToggles()[type][channel]
     );
   }
killedBy: NotificationPreference with a sparse (rehydrated) toggle map falls back to the type's default toggles when the type is absent from the stored map
statusReason: Cannot read properties of undefined (reading 'inApp')

[Killed] LogicalOperator
src/notifications/domain/notification-preference.ts:70:7
   // or channels added later; an explicit stored value (including false) always wins.
   allows(type: NotificationType, channel: Channel): boolean {
     return (
-      this.state.toggles[type]?.[channel] ?? defaultToggles()[type][channel]
+      this.state.toggles[type]?.[channel] && defaultToggles()[type][channel]
     );
   }
killedBy: NotificationPreference.enable / disable enable turns a channel on and records PreferenceChanged(enabled=true)
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/notifications/domain/notification-preference.ts:78:73
   // {inApp, email, push} triple, via the same per-channel stored-over-default merge as `allows`.
   // This is the READ-side truth the preferences UI renders; `allows` is the delivery-side
   // equivalent.
-  resolvedToggles(): Readonly<Record<NotificationType, ChannelToggles>> {
-    const resolved = {} as Record<NotificationType, ChannelToggles>;
-    for (const type of NOTIFICATION_TYPES) {
-      const triple = {} as Record<Channel, boolean>;
-      for (const channel of CHANNELS) {
-        triple[channel] = this.allows(type, channel);
-      }
-      resolved[type] = triple;
-    }
-    return resolved;
-  }
+  resolvedToggles(): Readonly<Record<NotificationType, ChannelToggles>> {}
 
   // Turn a (type, channel) delivery on. Records PreferenceChanged only when it actually changed.
killedBy: NotificationPreference with a sparse (rehydrated) toggle map an explicit stored false always wins over the default (deliberate opt-outs are never overridden)
statusReason: Cannot read properties of undefined (reading 'trade_request')

[Killed] BlockStatement
src/notifications/domain/notification-preference.ts:80:44
   // equivalent.
   resolvedToggles(): Readonly<Record<NotificationType, ChannelToggles>> {
     const resolved = {} as Record<NotificationType, ChannelToggles>;
-    for (const type of NOTIFICATION_TYPES) {
-      const triple = {} as Record<Channel, boolean>;
-      for (const channel of CHANNELS) {
-        triple[channel] = this.allows(type, channel);
-      }
-      resolved[type] = triple;
-    }
+    for (const type of NOTIFICATION_TYPES) {}
     return resolved;
   }
killedBy: NotificationPreference with a sparse (rehydrated) toggle map an explicit stored false always wins over the default (deliberate opt-outs are never overridden)
statusReason: expected undefined to deeply equal { inApp: false, email: true, …(1) }

[Killed] BlockStatement
src/notifications/domain/notification-preference.ts:82:39
     const resolved = {} as Record<NotificationType, ChannelToggles>;
     for (const type of NOTIFICATION_TYPES) {
       const triple = {} as Record<Channel, boolean>;
-      for (const channel of CHANNELS) {
-        triple[channel] = this.allows(type, channel);
-      }
+      for (const channel of CHANNELS) {}
       resolved[type] = triple;
     }
killedBy: NotificationPreference with a sparse (rehydrated) toggle map an explicit stored false always wins over the default (deliberate opt-outs are never overridden)
statusReason: expected {} to deeply equal { inApp: false, email: true, …(1) }

[Killed] BlockStatement
src/notifications/domain/notification-preference.ts:91:69
   }
 
   // Turn a (type, channel) delivery on. Records PreferenceChanged only when it actually changed.
-  enable(type: NotificationType, channel: Channel, now: Date): void {
-    this.set(type, channel, true, now);
-  }
+  enable(type: NotificationType, channel: Channel, now: Date): void {}
 
   // Turn a (type, channel) delivery off. Records PreferenceChanged only when it actually changed.
killedBy: makeNotifyMember delivers email when the member opts into the email channel
statusReason: expected [ 'ntf-1' ] to have a length of 2 but got 1

[Killed] BooleanLiteral
src/notifications/domain/notification-preference.ts:92:29
 
   // Turn a (type, channel) delivery on. Records PreferenceChanged only when it actually changed.
   enable(type: NotificationType, channel: Channel, now: Date): void {
-    this.set(type, channel, true, now);
+    this.set(type, channel, false, now);
   }
 
killedBy: makeNotifyMember delivers email when the member opts into the email channel
statusReason: expected [ 'ntf-1' ] to have a length of 2 but got 1

[Killed] BlockStatement
src/notifications/domain/notification-preference.ts:96:70
   }
 
   // Turn a (type, channel) delivery off. Records PreferenceChanged only when it actually changed.
-  disable(type: NotificationType, channel: Channel, now: Date): void {
-    this.set(type, channel, false, now);
-  }
+  disable(type: NotificationType, channel: Channel, now: Date): void {}
 
   // Drain recorded events for the publisher; clears the buffer so a save can't double-emit.
killedBy: NotificationPreference.enable / disable disable turns a channel off and records PreferenceChanged(enabled=false)
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/notifications/domain/notification-preference.ts:97:29
 
   // Turn a (type, channel) delivery off. Records PreferenceChanged only when it actually changed.
   disable(type: NotificationType, channel: Channel, now: Date): void {
-    this.set(type, channel, false, now);
+    this.set(type, channel, true, now);
   }
 
killedBy: makeNotifyMember suppresses the notification when the type/channel is disabled (no-op)
statusReason: expected [ 'ntf-1' ] to deeply equal []

[Killed] BlockStatement
src/notifications/domain/notification-preference.ts:108:80
   }
 
   // Map to/from persistence without the aggregate knowing about any storage technology.
-  static rehydrate(state: NotificationPreferenceState): NotificationPreference {
-    return new NotificationPreference(state);
-  }
+  static rehydrate(state: NotificationPreferenceState): NotificationPreference {}
 
   toState(): NotificationPreferenceState {
killedBy: NotificationPreference with a sparse (rehydrated) toggle map falls back to the type's default toggles when the type is absent from the stored map
statusReason: Cannot read properties of undefined (reading 'allows')

[Killed] BlockStatement
src/notifications/domain/notification-preference.ts:112:42
     return new NotificationPreference(state);
   }
 
-  toState(): NotificationPreferenceState {
-    return this.state;
-  }
+  toState(): NotificationPreferenceState {}
 
   // --- internals ---
killedBy: makeNotifyMember materialises and persists a default preference when none exists
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/notifications/domain/notification-preference.ts:125:11
     channel: Channel,
     enabled: boolean,
     now: Date,
-  ): void {
-    if (this.allows(type, channel) === enabled) {
-      return;
-    }
-    const current = this.state.toggles[type] ?? defaultToggles()[type];
-    const nextForType: ChannelToggles = { ...current, [channel]: enabled };
-    this.state = {
-      ...this.state,
-      toggles: { ...this.state.toggles, [type]: nextForType },
-      updatedAt: now,
-    };
-    this.record(
-      new PreferenceChanged(this.state.memberId, type, channel, enabled, now),
-    );
-  }
+  ): void {}
 
   private record(event: DomainEvent): void {
killedBy: NotificationPreference.enable / disable enable turns a channel on and records PreferenceChanged(enabled=true)
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/notifications/domain/notification-preference.ts:126:49
     enabled: boolean,
     now: Date,
   ): void {
-    if (this.allows(type, channel) === enabled) {
-      return;
-    }
+    if (this.allows(type, channel) === enabled) {}
     const current = this.state.toggles[type] ?? defaultToggles()[type];
     const nextForType: ChannelToggles = { ...current, [channel]: enabled };
killedBy: NotificationPreference.enable / disable is a no-op when the value already matches (no spurious event)
statusReason: expected [ PreferenceChanged{ …(6) } ] to deeply equal []

[Killed] EqualityOperator
src/notifications/domain/notification-preference.ts:126:9
     enabled: boolean,
     now: Date,
   ): void {
-    if (this.allows(type, channel) === enabled) {
+    if (this.allows(type, channel) !== enabled) {
       return;
     }
killedBy: NotificationPreference.enable / disable enable turns a channel on and records PreferenceChanged(enabled=true)
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/notifications/domain/notification-preference.ts:129:21
     if (this.allows(type, channel) === enabled) {
       return;
     }
-    const current = this.state.toggles[type] ?? defaultToggles()[type];
+    const current = this.state.toggles[type] && defaultToggles()[type];
     const nextForType: ChannelToggles = { ...current, [channel]: enabled };
     this.state = {
killedBy: makeUpdateNotificationPreferences applies every update atomically against one loaded aggregate
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/notifications/domain/notification-preference.ts:130:41
       return;
     }
     const current = this.state.toggles[type] ?? defaultToggles()[type];
-    const nextForType: ChannelToggles = { ...current, [channel]: enabled };
+    const nextForType: ChannelToggles = {};
     this.state = {
       ...this.state,
killedBy: NotificationPreference.enable / disable enable turns a channel on and records PreferenceChanged(enabled=true)
statusReason: expected false to be true // Object.is equality
