[Killed] BlockStatement
reputation/application/use-cases/submit-partner-review.ts:58:21
       cmd.reviewerId,
       cmd.revieweeId,
     );
-    if (!completed) {
-      return err(
-        ReputationApplicationError.exchangeNotCompleted(cmd.exchangeId),
-      );
-    }
+    if (!completed) {}
 
     // One review per reviewer per exchange.
killedBy: makeSubmitPartnerReview rejects when the exchange is not completed (no window)
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
reputation/application/use-cases/submit-partner-review.ts:58:9
       cmd.reviewerId,
       cmd.revieweeId,
     );
-    if (!completed) {
+    if (completed) {
       return err(
         ReputationApplicationError.exchangeNotCompleted(cmd.exchangeId),
killedBy: makeSubmitPartnerReview submits a review: saves it, recomputes the reviewee profile, and publishes both events
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
reputation/application/use-cases/submit-partner-review.ts:69:9
       cmd.exchangeId,
       cmd.reviewerId,
     );
-    if (existing) {
+    if (false) {
       return err(
         ReputationApplicationError.duplicatePartnerReview(cmd.exchangeId),
killedBy: makeSubmitPartnerReview rejects a duplicate review by the same reviewer for the same exchange
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
reputation/application/use-cases/submit-partner-review.ts:69:9
       cmd.exchangeId,
       cmd.reviewerId,
     );
-    if (existing) {
+    if (true) {
       return err(
         ReputationApplicationError.duplicatePartnerReview(cmd.exchangeId),
killedBy: makeSubmitPartnerReview submits a review: saves it, recomputes the reviewee profile, and publishes both events
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
reputation/application/use-cases/submit-partner-review.ts:86:9
       scores: cmd.scores,
       now: deps.clock.now(),
     });
-    if (review.isErr) return err(review.error);
+    if (true) return err(review.error);
 
     await deps.reviews.save(review.value);
killedBy: makeSubmitPartnerReview submits a review: saves it, recomputes the reviewee profile, and publishes both events
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
reputation/application/use-cases/submit-partner-review.ts:86:9
       scores: cmd.scores,
       now: deps.clock.now(),
     });
-    if (review.isErr) return err(review.error);
+    if (false) return err(review.error);
 
     await deps.reviews.save(review.value);
killedBy: makeSubmitPartnerReview rejects a self-review and writes nothing
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] LogicalOperator
reputation/application/use-cases/submit-partner-review.ts:93:7
     // Fold the review into the reviewee's profile, opening a fresh one if none exists.
     const existingProfile = await deps.profiles.findByMember(cmd.revieweeId);
     const profile =
-      existingProfile ??
-      ReputationProfile.open(
-        deps.profileIds.next(),
-        cmd.revieweeId,
-        deps.clock.now(),
-      );
+      existingProfile && ReputationProfile.open(deps.profileIds.next(), cmd.revieweeId, deps.clock.now());
     profile.applyReview(review.value, deps.clock.now());
     await deps.profiles.save(profile);
killedBy: makeSubmitPartnerReview submits a review: saves it, recomputes the reviewee profile, and publishes both events
statusReason: Cannot read properties of null (reading 'applyReview')

[Killed] ArrayDeclaration
reputation/application/use-cases/submit-partner-review.ts:103:35
     await deps.profiles.save(profile);
 
     // Publish both aggregates' events together: PartnerReviewSubmitted then ReputationChanged.
-    const events: DomainEvent[] = [
-      ...review.value.pullEvents(),
-      ...profile.pullEvents(),
-    ];
+    const events: DomainEvent[] = [];
     await deps.events.publish(events);
 
killedBy: makeSubmitPartnerReview submits a review: saves it, recomputes the reviewee profile, and publishes both events
statusReason: expected [] to deeply equal [ 'PartnerReviewSubmitted', …(1) ]
