[Killed] ArrayDeclaration
src/reputation/domain/partner-review.ts:40:35
 // PuzzleReview, which is an opinion about a puzzle). An entity within the Reputation context;
 // the ReputationProfile is the aggregate that consumes it.
 export class PartnerReview {
-  private events: DomainEvent[] = [];
+  private events: DomainEvent[] = ["Stryker was here"];
 
   private constructor(private readonly state: PartnerReviewState) {}
killedBy: makeSubmitPartnerReview submits a review: saves it, recomputes the reviewee profile, and publishes both events
statusReason: expected [ undefined, …(2) ] to deeply equal [ 'PartnerReviewSubmitted', …(1) ]

[Killed] BlockStatement
src/reputation/domain/partner-review.ts:44:29
 
   private constructor(private readonly state: PartnerReviewState) {}
 
-  get id(): PartnerReviewId {
-    return this.state.id;
-  }
+  get id(): PartnerReviewId {}
 
   get reviewerId(): MemberId {
killedBy: makeSubmitPartnerReview accumulates multiple reviews into one reviewee profile and recomputes the average
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BlockStatement
src/reputation/domain/partner-review.ts:48:30
     return this.state.id;
   }
 
-  get reviewerId(): MemberId {
-    return this.state.reviewerId;
-  }
+  get reviewerId(): MemberId {}
 
   get revieweeId(): MemberId {
killedBy: PartnerReview.submit round-trips through toState/rehydrate
statusReason: expected undefined to be 'alice' // Object.is equality

[Killed] BlockStatement
src/reputation/domain/partner-review.ts:52:30
     return this.state.reviewerId;
   }
 
-  get revieweeId(): MemberId {
-    return this.state.revieweeId;
-  }
+  get revieweeId(): MemberId {}
 
   get exchangeId(): ExchangeId {
killedBy: PartnerReview.submit round-trips through toState/rehydrate
statusReason: expected undefined to be 'bob' // Object.is equality

[Killed] BlockStatement
src/reputation/domain/partner-review.ts:56:32
     return this.state.revieweeId;
   }
 
-  get exchangeId(): ExchangeId {
-    return this.state.exchangeId;
-  }
+  get exchangeId(): ExchangeId {}
 
   get rating(): StarRating {
killedBy: PartnerReview.submit round-trips through toState/rehydrate
statusReason: expected undefined to be 'ex-1' // Object.is equality

[Killed] BlockStatement
src/reputation/domain/partner-review.ts:60:28
     return this.state.exchangeId;
   }
 
-  get rating(): StarRating {
-    return this.state.rating;
-  }
+  get rating(): StarRating {}
 
   // Create a brand-new partner review. Decides only from its own data: rejects self-review
killedBy: makeSubmitPartnerReview submits a review: saves it, recomputes the reviewee profile, and publishes both events
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] BlockStatement
src/reputation/domain/partner-review.ts:68:48
   // and any invalid rating (overall or per-category). Window/uniqueness/exchange-completed
   // checks need ports and live in the application layer (1b), not here.
   static submit(props: SubmitProps): Result<PartnerReview, ReputationError> {
-    if (props.reviewerId === props.revieweeId) {
-      return err(ReputationError.selfReview());
-    }
+    if (props.reviewerId === props.revieweeId) {}
 
     const rating = StarRating.create(props.rating);
killedBy: PartnerReview.submit rejects a self-review (reviewer === reviewee)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/reputation/domain/partner-review.ts:68:9
   // and any invalid rating (overall or per-category). Window/uniqueness/exchange-completed
   // checks need ports and live in the application layer (1b), not here.
   static submit(props: SubmitProps): Result<PartnerReview, ReputationError> {
-    if (props.reviewerId === props.revieweeId) {
+    if (true) {
       return err(ReputationError.selfReview());
     }
killedBy: makeSubmitPartnerReview submits a review: saves it, recomputes the reviewee profile, and publishes both events
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/reputation/domain/partner-review.ts:73:9
     }
 
     const rating = StarRating.create(props.rating);
-    if (rating.isErr) return err(rating.error);
+    if (false) return err(rating.error);
 
     const scores = PartnerReviewScores.create(props.scores);
killedBy: makeSubmitPartnerReview rejects an out-of-bounds rating 0 without writing
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] ConditionalExpression
src/reputation/domain/partner-review.ts:73:9
     }
 
     const rating = StarRating.create(props.rating);
-    if (rating.isErr) return err(rating.error);
+    if (true) return err(rating.error);
 
     const scores = PartnerReviewScores.create(props.scores);
killedBy: makeSubmitPartnerReview submits a review: saves it, recomputes the reviewee profile, and publishes both events
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/reputation/domain/partner-review.ts:76:9
     if (rating.isErr) return err(rating.error);
 
     const scores = PartnerReviewScores.create(props.scores);
-    if (scores.isErr) return err(scores.error);
+    if (true) return err(scores.error);
 
     const review = new PartnerReview({
killedBy: makeSubmitPartnerReview submits a review: saves it, recomputes the reviewee profile, and publishes both events
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/reputation/domain/partner-review.ts:76:9
     if (rating.isErr) return err(rating.error);
 
     const scores = PartnerReviewScores.create(props.scores);
-    if (scores.isErr) return err(scores.error);
+    if (false) return err(scores.error);
 
     const review = new PartnerReview({
killedBy: PartnerReview.submit rejects an out-of-bounds category sub-score
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/reputation/domain/partner-review.ts:78:38
     const scores = PartnerReviewScores.create(props.scores);
     if (scores.isErr) return err(scores.error);
 
-    const review = new PartnerReview({
-      id: props.id,
-      exchangeId: props.exchangeId,
-      reviewerId: props.reviewerId,
-      revieweeId: props.revieweeId,
-      rating: rating.value,
-      comment: props.comment,
-      scores: scores.value,
-      createdAt: props.now,
-    });
+    const review = new PartnerReview({});
     review.record(
       new PartnerReviewSubmitted(
killedBy: makeSubmitPartnerReview submits a review: saves it, recomputes the reviewee profile, and publishes both events
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] BlockStatement
src/reputation/domain/partner-review.ts:109:62
   }
 
   // Map to/from persistence without the entity knowing about any storage technology.
-  static rehydrate(state: PartnerReviewState): PartnerReview {
-    return new PartnerReview(state);
-  }
+  static rehydrate(state: PartnerReviewState): PartnerReview {}
 
   toState(): PartnerReviewState {
killedBy: PartnerReview.submit round-trips through toState/rehydrate
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] BlockStatement
src/reputation/domain/partner-review.ts:113:33
     return new PartnerReview(state);
   }
 
-  toState(): PartnerReviewState {
-    return this.state;
-  }
+  toState(): PartnerReviewState {}
 
   private record(event: DomainEvent): void {
killedBy: makeSubmitPartnerReview rejects a duplicate review by the same reviewer for the same exchange
statusReason: Cannot read properties of undefined (reading 'exchangeId')
