[Killed] ArrayDeclaration
src/reputation/domain/reputation-profile.ts:27:35
 // the reviewee) and maintains the aggregate score + count + credibility. Recomputing on each
 // applied review keeps the average authoritative and emits ReputationChanged.
 export class ReputationProfile {
-  private events: DomainEvent[] = [];
+  private events: DomainEvent[] = ["Stryker was here"];
 
   private constructor(private state: ReputationProfileState) {}
killedBy: makeSubmitPartnerReview submits a review: saves it, recomputes the reviewee profile, and publishes both events
statusReason: expected [ 'PartnerReviewSubmitted', …(2) ] to deeply equal [ 'PartnerReviewSubmitted', …(1) ]

[Killed] BlockStatement
src/reputation/domain/reputation-profile.ts:31:33
 
   private constructor(private state: ReputationProfileState) {}
 
-  get id(): ReputationProfileId {
-    return this.state.id;
-  }
+  get id(): ReputationProfileId {}
 
   get memberId(): MemberId {
killedBy: ReputationProfile opens empty with a zero average, count, and credibility
statusReason: expected undefined to be 'profile-1' // Object.is equality

[Killed] BlockStatement
src/reputation/domain/reputation-profile.ts:39:31
     return this.state.memberId;
   }
 
-  get averageRating(): number {
-    return this.state.averageRating;
-  }
+  get averageRating(): number {}
 
   get reviewCount(): number {
killedBy: makeSubmitPartnerReview submits a review: saves it, recomputes the reviewee profile, and publishes both events
statusReason: expected undefined to be 4 // Object.is equality

[Killed] BlockStatement
src/reputation/domain/reputation-profile.ts:43:29
     return this.state.averageRating;
   }
 
-  get reviewCount(): number {
-    return this.state.reviewCount;
-  }
+  get reviewCount(): number {}
 
   get credibility(): number {
killedBy: makeSubmitPartnerReview submits a review: saves it, recomputes the reviewee profile, and publishes both events
statusReason: expected undefined to be 1 // Object.is equality

[Killed] BlockStatement
src/reputation/domain/reputation-profile.ts:47:29
     return this.state.reviewCount;
   }
 
-  get credibility(): number {
-    return this.state.credibility;
-  }
+  get credibility(): number {}
 
   // A fresh, empty profile for a member who has not yet been reviewed.
killedBy: ReputationProfile opens empty with a zero average, count, and credibility
statusReason: expected undefined to be +0 // Object.is equality

[Killed] BlockStatement
src/reputation/domain/reputation-profile.ts:56:24
     id: ReputationProfileId,
     memberId: MemberId,
     now: Date,
-  ): ReputationProfile {
-    return new ReputationProfile({
-      id,
-      memberId,
-      ratingSum: 0,
-      reviewCount: 0,
-      averageRating: 0,
-      credibility: 0,
-      updatedAt: now,
-    });
-  }
+  ): ReputationProfile {}
 
   // Fold a received review into the aggregate: add its overall rating to the running sum,
killedBy: ReputationProfile opens empty with a zero average, count, and credibility
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ObjectLiteral
src/reputation/domain/reputation-profile.ts:57:34
     memberId: MemberId,
     now: Date,
   ): ReputationProfile {
-    return new ReputationProfile({
-      id,
-      memberId,
-      ratingSum: 0,
-      reviewCount: 0,
-      averageRating: 0,
-      credibility: 0,
-      updatedAt: now,
-    });
+    return new ReputationProfile({});
   }
 
killedBy: makeSubmitPartnerReview submits a review: saves it, recomputes the reviewee profile, and publishes both events
statusReason: expected undefined to be 1 // Object.is equality

[Killed] BlockStatement
src/reputation/domain/reputation-profile.ts:72:55
   // bump the count, recompute the average and credibility, then emit ReputationChanged. The
   // review must be ABOUT this member (revieweeId === memberId); the application layer loads
   // the reviewee's profile, so this is an invariant the caller upholds.
-  applyReview(review: PartnerReview, now: Date): void {
-    const ratingSum = this.state.ratingSum + review.rating.value;
-    const reviewCount = this.state.reviewCount + 1;
-    const averageRating = ratingSum / reviewCount;
-    const credibility = Math.min(reviewCount / CREDIBILITY_SATURATION, 1);
-
-    this.state = {
-      ...this.state,
-      ratingSum,
-      reviewCount,
-      averageRating,
-      credibility,
-      updatedAt: now,
-    };
-
-    this.record(
-      new ReputationChanged(
-        this.state.memberId,
-        averageRating,
-        reviewCount,
-        now,
-      ),
-    );
-  }
+  applyReview(review: PartnerReview, now: Date): void {}
 
   // Drain recorded events for the publisher; clears the buffer so a save can't double-emit.
killedBy: makeSubmitPartnerReview submits a review: saves it, recomputes the reviewee profile, and publishes both events
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArithmeticOperator
src/reputation/domain/reputation-profile.ts:73:23
   // review must be ABOUT this member (revieweeId === memberId); the application layer loads
   // the reviewee's profile, so this is an invariant the caller upholds.
   applyReview(review: PartnerReview, now: Date): void {
-    const ratingSum = this.state.ratingSum + review.rating.value;
+    const ratingSum = this.state.ratingSum - review.rating.value;
     const reviewCount = this.state.reviewCount + 1;
     const averageRating = ratingSum / reviewCount;
killedBy: makeSubmitPartnerReview submits a review: saves it, recomputes the reviewee profile, and publishes both events
statusReason: expected -4 to be 4 // Object.is equality

[Killed] ArithmeticOperator
src/reputation/domain/reputation-profile.ts:74:25
   // the reviewee's profile, so this is an invariant the caller upholds.
   applyReview(review: PartnerReview, now: Date): void {
     const ratingSum = this.state.ratingSum + review.rating.value;
-    const reviewCount = this.state.reviewCount + 1;
+    const reviewCount = this.state.reviewCount - 1;
     const averageRating = ratingSum / reviewCount;
     const credibility = Math.min(reviewCount / CREDIBILITY_SATURATION, 1);
killedBy: ReputationProfile recomputes the average across multiple applied reviews
statusReason: expected -1 to be 1 // Object.is equality

[Killed] ArithmeticOperator
src/reputation/domain/reputation-profile.ts:75:27
   applyReview(review: PartnerReview, now: Date): void {
     const ratingSum = this.state.ratingSum + review.rating.value;
     const reviewCount = this.state.reviewCount + 1;
-    const averageRating = ratingSum / reviewCount;
+    const averageRating = ratingSum * reviewCount;
     const credibility = Math.min(reviewCount / CREDIBILITY_SATURATION, 1);
 
killedBy: makeSubmitPartnerReview accumulates multiple reviews into one reviewee profile and recomputes the average
statusReason: expected 12 to be 3 // Object.is equality

[Killed] MethodExpression
src/reputation/domain/reputation-profile.ts:76:25
     const ratingSum = this.state.ratingSum + review.rating.value;
     const reviewCount = this.state.reviewCount + 1;
     const averageRating = ratingSum / reviewCount;
-    const credibility = Math.min(reviewCount / CREDIBILITY_SATURATION, 1);
+    const credibility = Math.max(reviewCount / CREDIBILITY_SATURATION, 1);
 
     this.state = {
killedBy: ReputationProfile grows credibility with review count and caps it at 1
statusReason: expected 1 to be close to 0.1, received difference is 0.9, but expected 5e-11

[Killed] ArithmeticOperator
src/reputation/domain/reputation-profile.ts:76:34
     const ratingSum = this.state.ratingSum + review.rating.value;
     const reviewCount = this.state.reviewCount + 1;
     const averageRating = ratingSum / reviewCount;
-    const credibility = Math.min(reviewCount / CREDIBILITY_SATURATION, 1);
+    const credibility = Math.min(reviewCount * CREDIBILITY_SATURATION, 1);
 
     this.state = {
killedBy: ReputationProfile grows credibility with review count and caps it at 1
statusReason: expected 1 to be close to 0.1, received difference is 0.9, but expected 5e-11

[Killed] BlockStatement
src/reputation/domain/reputation-profile.ts:105:70
   }
 
   // Map to/from persistence without the aggregate knowing about any storage technology.
-  static rehydrate(state: ReputationProfileState): ReputationProfile {
-    return new ReputationProfile(state);
-  }
+  static rehydrate(state: ReputationProfileState): ReputationProfile {}
 
   toState(): ReputationProfileState {
killedBy: makeSubmitPartnerReview submits a review: saves it, recomputes the reviewee profile, and publishes both events
statusReason: expected undefined to be 1 // Object.is equality

[Killed] BlockStatement
src/reputation/domain/reputation-profile.ts:109:37
     return new ReputationProfile(state);
   }
 
-  toState(): ReputationProfileState {
-    return this.state;
-  }
+  toState(): ReputationProfileState {}
 
   private record(event: DomainEvent): void {
killedBy: ReputationProfile round-trips through toState/rehydrate
statusReason: Cannot read properties of undefined (reading 'averageRating')
