[Killed] BlockStatement
src/reputation/domain/review-scores.ts:26:51
 
   static create(
     input: PartnerReviewScoresInput,
-  ): Result<PartnerReviewScores, ReputationError> {
-    const communication = StarRating.create(input.communication);
-    if (communication.isErr) return err(communication.error);
-    const packaging = StarRating.create(input.packaging);
-    if (packaging.isErr) return err(packaging.error);
-    const condition = StarRating.create(input.condition);
-    if (condition.isErr) return err(condition.error);
-    const timeliness = StarRating.create(input.timeliness);
-    if (timeliness.isErr) return err(timeliness.error);
-
-    return ok(
-      new PartnerReviewScores(
-        communication.value,
-        packaging.value,
-        condition.value,
-        timeliness.value,
-      ),
-    );
-  }
+  ): Result<PartnerReviewScores, ReputationError> {}
 }
 
killedBy: PartnerReview.submit creates a review and records PartnerReviewSubmitted with the rating
statusReason: Cannot read properties of undefined (reading 'isErr')

[Killed] ConditionalExpression
src/reputation/domain/review-scores.ts:28:9
     input: PartnerReviewScoresInput,
   ): Result<PartnerReviewScores, ReputationError> {
     const communication = StarRating.create(input.communication);
-    if (communication.isErr) return err(communication.error);
+    if (true) return err(communication.error);
     const packaging = StarRating.create(input.packaging);
     if (packaging.isErr) return err(packaging.error);
killedBy: makeSubmitPartnerReview submits a review: saves it, recomputes the reviewee profile, and publishes both events
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/reputation/domain/review-scores.ts:28:9
     input: PartnerReviewScoresInput,
   ): Result<PartnerReviewScores, ReputationError> {
     const communication = StarRating.create(input.communication);
-    if (communication.isErr) return err(communication.error);
+    if (false) return err(communication.error);
     const packaging = StarRating.create(input.packaging);
     if (packaging.isErr) return err(packaging.error);
killedBy: PartnerReview.submit rejects an out-of-bounds category sub-score
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/reputation/domain/review-scores.ts:30:9
     const communication = StarRating.create(input.communication);
     if (communication.isErr) return err(communication.error);
     const packaging = StarRating.create(input.packaging);
-    if (packaging.isErr) return err(packaging.error);
+    if (false) return err(packaging.error);
     const condition = StarRating.create(input.condition);
     if (condition.isErr) return err(condition.error);
killedBy: PartnerReviewScores rejects when packaging is out of range
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/reputation/domain/review-scores.ts:30:9
     const communication = StarRating.create(input.communication);
     if (communication.isErr) return err(communication.error);
     const packaging = StarRating.create(input.packaging);
-    if (packaging.isErr) return err(packaging.error);
+    if (true) return err(packaging.error);
     const condition = StarRating.create(input.condition);
     if (condition.isErr) return err(condition.error);
killedBy: ReputationProfile recomputes the average across multiple applied reviews
statusReason: setup

[Killed] ConditionalExpression
src/reputation/domain/review-scores.ts:32:9
     const packaging = StarRating.create(input.packaging);
     if (packaging.isErr) return err(packaging.error);
     const condition = StarRating.create(input.condition);
-    if (condition.isErr) return err(condition.error);
+    if (true) return err(condition.error);
     const timeliness = StarRating.create(input.timeliness);
     if (timeliness.isErr) return err(timeliness.error);
killedBy: makeSubmitPartnerReview submits a review: saves it, recomputes the reviewee profile, and publishes both events
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/reputation/domain/review-scores.ts:32:9
     const packaging = StarRating.create(input.packaging);
     if (packaging.isErr) return err(packaging.error);
     const condition = StarRating.create(input.condition);
-    if (condition.isErr) return err(condition.error);
+    if (false) return err(condition.error);
     const timeliness = StarRating.create(input.timeliness);
     if (timeliness.isErr) return err(timeliness.error);
killedBy: PartnerReviewScores rejects when condition is out of range
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/reputation/domain/review-scores.ts:34:9
     const condition = StarRating.create(input.condition);
     if (condition.isErr) return err(condition.error);
     const timeliness = StarRating.create(input.timeliness);
-    if (timeliness.isErr) return err(timeliness.error);
+    if (true) return err(timeliness.error);
 
     return ok(
killedBy: ReputationProfile recomputes the average across multiple applied reviews
statusReason: setup

[Killed] ConditionalExpression
src/reputation/domain/review-scores.ts:34:9
     const condition = StarRating.create(input.condition);
     if (condition.isErr) return err(condition.error);
     const timeliness = StarRating.create(input.timeliness);
-    if (timeliness.isErr) return err(timeliness.error);
+    if (false) return err(timeliness.error);
 
     return ok(
killedBy: PartnerReviewScores rejects when timeliness is out of range
statusReason: expected false to be true // Object.is equality
