[Killed] ArrowFunction
sharing/application/use-cases/remove-member.ts:17:3
 // Transaction script: load the circle (CircleNotFound if missing), delegate the admin-gated removal
 // (which also refuses to remove the owner) to the aggregate, persist. Removal records no event.
 export const makeRemoveMember =
-  (deps: RemoveMemberDeps): RemoveMember =>
-  async (cmd: RemoveMemberCommand) => {
-    const circle = await deps.circles.findById(cmd.circleId);
-    if (!circle)
-      return err(SharingApplicationError.circleNotFound(cmd.circleId));
-
-    const result = circle.removeMember(cmd.actorId, cmd.memberId);
-    if (result.isErr) return err(result.error);
-
-    await deps.circles.save(circle);
-    await deps.events.publish(circle.pullEvents());
-    return ok(undefined);
-  };
+  () => undefined;
 
killedBy: Sharing circle use cases makeRemoveMember removes a member by an admin
statusReason: removeMember is not a function

[Killed] BlockStatement
sharing/application/use-cases/remove-member.ts:18:39
 // (which also refuses to remove the owner) to the aggregate, persist. Removal records no event.
 export const makeRemoveMember =
   (deps: RemoveMemberDeps): RemoveMember =>
-  async (cmd: RemoveMemberCommand) => {
-    const circle = await deps.circles.findById(cmd.circleId);
-    if (!circle)
-      return err(SharingApplicationError.circleNotFound(cmd.circleId));
-
-    const result = circle.removeMember(cmd.actorId, cmd.memberId);
-    if (result.isErr) return err(result.error);
-
-    await deps.circles.save(circle);
-    await deps.events.publish(circle.pullEvents());
-    return ok(undefined);
-  };
+  async (cmd: RemoveMemberCommand) => {};
 
killedBy: Sharing circle use cases makeRemoveMember removes a member by an admin
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] ConditionalExpression
sharing/application/use-cases/remove-member.ts:20:9
   (deps: RemoveMemberDeps): RemoveMember =>
   async (cmd: RemoveMemberCommand) => {
     const circle = await deps.circles.findById(cmd.circleId);
-    if (!circle)
+    if (false)
       return err(SharingApplicationError.circleNotFound(cmd.circleId));
 
killedBy: Sharing circle use cases makeRemoveMember returns CircleNotFound for an unknown circle
statusReason: Cannot read properties of null (reading 'removeMember')

[Killed] BooleanLiteral
sharing/application/use-cases/remove-member.ts:20:9
   (deps: RemoveMemberDeps): RemoveMember =>
   async (cmd: RemoveMemberCommand) => {
     const circle = await deps.circles.findById(cmd.circleId);
-    if (!circle)
+    if (circle)
       return err(SharingApplicationError.circleNotFound(cmd.circleId));
 
killedBy: Sharing circle use cases makeRemoveMember removes a member by an admin
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
sharing/application/use-cases/remove-member.ts:24:9
       return err(SharingApplicationError.circleNotFound(cmd.circleId));
 
     const result = circle.removeMember(cmd.actorId, cmd.memberId);
-    if (result.isErr) return err(result.error);
+    if (true) return err(result.error);
 
     await deps.circles.save(circle);
killedBy: Sharing circle use cases makeRemoveMember removes a member by an admin
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
sharing/application/use-cases/remove-member.ts:24:9
       return err(SharingApplicationError.circleNotFound(cmd.circleId));
 
     const result = circle.removeMember(cmd.actorId, cmd.memberId);
-    if (result.isErr) return err(result.error);
+    if (false) return err(result.error);
 
     await deps.circles.save(circle);
killedBy: Sharing circle use cases makeRemoveMember refuses to remove the owner
statusReason: expected false to be true // Object.is equality
