[Killed] BlockStatement
src/sharing/domain/membership.ts:20:26
 export class Membership {
   private constructor(private readonly state: MembershipState) {}
 
-  get id(): MembershipId {
-    return this.state.id;
-  }
+  get id(): MembershipId {}
 
   get memberId(): MemberId {
killedBy: Circle opens with the owner as its only member, implicitly Admin
statusReason: expected undefined to be 'membership-1' // Object.is equality

[Killed] BlockStatement
src/sharing/domain/membership.ts:28:37
     return this.state.memberId;
   }
 
-  get permission(): PermissionLevel {
-    return this.state.permission;
-  }
+  get permission(): PermissionLevel {}
 
   get joinedAt(): Date {
killedBy: Circle opens with the owner as its only member, implicitly Admin
statusReason: expected undefined to be 'Admin' // Object.is equality

[Killed] BlockStatement
src/sharing/domain/membership.ts:32:24
     return this.state.permission;
   }
 
-  get joinedAt(): Date {
-    return this.state.joinedAt;
-  }
+  get joinedAt(): Date {}
 
   static create(
killedBy: Circle opens with the owner as its only member, implicitly Admin
statusReason: expected undefined to be 2026-06-08T10:00:00.000Z // Object.is equality

[Killed] BlockStatement
src/sharing/domain/membership.ts:41:17
     memberId: MemberId,
     permission: PermissionLevel,
     joinedAt: Date,
-  ): Membership {
-    return new Membership({ id, memberId, permission, joinedAt });
-  }
+  ): Membership {}
 
   // A copy of this membership at a new permission level, preserving identity and join time.
killedBy: Circle opens with the owner as its only member, implicitly Admin
statusReason: Cannot read properties of undefined (reading 'toState')

[Killed] ObjectLiteral
src/sharing/domain/membership.ts:42:27
     permission: PermissionLevel,
     joinedAt: Date,
   ): Membership {
-    return new Membership({ id, memberId, permission, joinedAt });
+    return new Membership({});
   }
 
killedBy: Circle opens with the owner as its only member, implicitly Admin
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/sharing/domain/membership.ts:46:59
   }
 
   // A copy of this membership at a new permission level, preserving identity and join time.
-  withPermission(permission: PermissionLevel): Membership {
-    return new Membership({ ...this.state, permission });
-  }
+  withPermission(permission: PermissionLevel): Membership {}
 
   static rehydrate(state: MembershipState): Membership {
killedBy: Circle changePermission lets an admin change a member's permission
statusReason: Cannot read properties of undefined (reading 'memberId')

[Killed] ObjectLiteral
src/sharing/domain/membership.ts:47:27
 
   // A copy of this membership at a new permission level, preserving identity and join time.
   withPermission(permission: PermissionLevel): Membership {
-    return new Membership({ ...this.state, permission });
+    return new Membership({});
   }
 
killedBy: Circle changePermission lets an admin change a member's permission
statusReason: expected undefined to be 'Exchange' // Object.is equality

[Killed] BlockStatement
src/sharing/domain/membership.ts:50:56
     return new Membership({ ...this.state, permission });
   }
 
-  static rehydrate(state: MembershipState): Membership {
-    return new Membership(state);
-  }
+  static rehydrate(state: MembershipState): Membership {}
 
   toState(): MembershipState {
killedBy: Circle round-trips through toState/rehydrate preserving memberships
statusReason: Cannot read properties of undefined (reading 'memberId')

[Killed] BlockStatement
src/sharing/domain/membership.ts:54:30
     return new Membership(state);
   }
 
-  toState(): MembershipState {
-    return this.state;
-  }
+  toState(): MembershipState {}
 }
 
killedBy: Circle round-trips through toState/rehydrate preserving memberships
statusReason: Cannot read properties of undefined (reading 'memberId')
