[Killed] BlockStatement
src/sharing/domain/visibility-policy.ts:32:14
     ownerId: MemberId,
     scope: VisibilityScope,
     sharedCircles: readonly CircleId[],
-  ): boolean {
-    if (viewer === ownerId) return true;
-    if (scope === "private") return false;
-    if (scope === "friendCircle") return sharedCircles.length > 0;
-    return isPubliclyViewable(scope);
-  },
+  ): boolean {},
 
   canTransact(
killedBy: VisibilityPolicy.canView always lets the owner view their own content, at every scope
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
src/sharing/domain/visibility-policy.ts:33:9
     scope: VisibilityScope,
     sharedCircles: readonly CircleId[],
   ): boolean {
-    if (viewer === ownerId) return true;
+    if (viewer !== ownerId) return true;
     if (scope === "private") return false;
     if (scope === "friendCircle") return sharedCircles.length > 0;
killedBy: VisibilityPolicy.canView always lets the owner view their own content, at every scope
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/sharing/domain/visibility-policy.ts:33:9
     scope: VisibilityScope,
     sharedCircles: readonly CircleId[],
   ): boolean {
-    if (viewer === ownerId) return true;
+    if (true) return true;
     if (scope === "private") return false;
     if (scope === "friendCircle") return sharedCircles.length > 0;
killedBy: VisibilityPolicy.canView private hides from a circle peer and a stranger
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/sharing/domain/visibility-policy.ts:34:37
     sharedCircles: readonly CircleId[],
   ): boolean {
     if (viewer === ownerId) return true;
-    if (scope === "private") return false;
+    if (scope === "private") return true;
     if (scope === "friendCircle") return sharedCircles.length > 0;
     return isPubliclyViewable(scope);
killedBy: VisibilityPolicy.canView private hides from a circle peer and a stranger
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/sharing/domain/visibility-policy.ts:34:9
     sharedCircles: readonly CircleId[],
   ): boolean {
     if (viewer === ownerId) return true;
-    if (scope === "private") return false;
+    if (true) return false;
     if (scope === "friendCircle") return sharedCircles.length > 0;
     return isPubliclyViewable(scope);
killedBy: VisibilityPolicy.canView friendCircle shows to a viewer who shares a circle with the owner
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/sharing/domain/visibility-policy.ts:35:9
   ): boolean {
     if (viewer === ownerId) return true;
     if (scope === "private") return false;
-    if (scope === "friendCircle") return sharedCircles.length > 0;
+    if (false) return sharedCircles.length > 0;
     return isPubliclyViewable(scope);
   },
killedBy: VisibilityPolicy.canView friendCircle shows to a viewer who shares a circle with the owner
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/sharing/domain/visibility-policy.ts:35:42
   ): boolean {
     if (viewer === ownerId) return true;
     if (scope === "private") return false;
-    if (scope === "friendCircle") return sharedCircles.length > 0;
+    if (scope === "friendCircle") return false;
     return isPubliclyViewable(scope);
   },
killedBy: VisibilityPolicy.canView friendCircle shows to a viewer who shares a circle with the owner
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/sharing/domain/visibility-policy.ts:45:14
     scope: VisibilityScope,
     sharedCircles: readonly CircleId[],
     kind: TransactionKind,
-  ): boolean {
-    if (viewer === ownerId) return true;
-    // A transaction always presupposes the right to view; private/friendCircle/visible never
-    // grant a public transaction (a friendCircle copy is shareable, not tradeable, by this policy).
-    if (!this.canView(viewer, ownerId, scope, sharedCircles)) return false;
-    return permitsTransaction(scope, kind);
-  },
+  ): boolean {},
 };
 
killedBy: VisibilityPolicy.canTransact always lets the owner transact on their own content, any scope and kind
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/sharing/domain/visibility-policy.ts:46:9
     sharedCircles: readonly CircleId[],
     kind: TransactionKind,
   ): boolean {
-    if (viewer === ownerId) return true;
+    if (false) return true;
     // A transaction always presupposes the right to view; private/friendCircle/visible never
     // grant a public transaction (a friendCircle copy is shareable, not tradeable, by this policy).
killedBy: VisibilityPolicy.canTransact always lets the owner transact on their own content, any scope and kind
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/sharing/domain/visibility-policy.ts:49:9
     if (viewer === ownerId) return true;
     // A transaction always presupposes the right to view; private/friendCircle/visible never
     // grant a public transaction (a friendCircle copy is shareable, not tradeable, by this policy).
-    if (!this.canView(viewer, ownerId, scope, sharedCircles)) return false;
+    if (true) return false;
     return permitsTransaction(scope, kind);
   },
killedBy: VisibilityPolicy.canTransact lendable permits only lend allows lend for a stranger (public)
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/sharing/domain/visibility-policy.ts:49:70
     if (viewer === ownerId) return true;
     // A transaction always presupposes the right to view; private/friendCircle/visible never
     // grant a public transaction (a friendCircle copy is shareable, not tradeable, by this policy).
-    if (!this.canView(viewer, ownerId, scope, sharedCircles)) return false;
+    if (!this.canView(viewer, ownerId, scope, sharedCircles)) return true;
     return permitsTransaction(scope, kind);
   },
killedBy: VisibilityPolicy.canTransact private never permits a public transaction denies lend for a peer and a stranger
statusReason: expected true to be false // Object.is equality
