[Killed] ObjectLiteral
src/sharing/domain/visibility-scope.ts:37:5
 // transaction, so it (and the non-public scopes) are absent.
 const TRANSACTABLE: Readonly<
   Partial<Record<VisibilityScope, TransactionKind>>
-> = {
-  lendable: "lend",
-  swappable: "swap",
-  tradeable: "trade",
-};
+> = {};
 
 // True for any scope that lets a non-owner, non-circle viewer see the content.
killedBy: VisibilityPolicy.canTransact lendable permits only lend allows lend for a stranger (public)
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/sharing/domain/visibility-scope.ts:38:13
 const TRANSACTABLE: Readonly<
   Partial<Record<VisibilityScope, TransactionKind>>
 > = {
-  lendable: "lend",
+  lendable: "",
   swappable: "swap",
   tradeable: "trade",
killedBy: VisibilityPolicy.canTransact lendable permits only lend allows lend for a stranger (public)
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/sharing/domain/visibility-scope.ts:44:35
 };
 
 // True for any scope that lets a non-owner, non-circle viewer see the content.
-export const isPubliclyViewable = (scope: VisibilityScope): boolean =>
-  PUBLICLY_VIEWABLE.has(scope);
+export const isPubliclyViewable = () => undefined;
 
 // True iff the scope permits the given transaction kind for anyone allowed to transact. `visible`
killedBy: VisibilityPolicy.canView visible (public view) shows to both a circle peer and a stranger
statusReason: expected undefined to be true // Object.is equality

[Killed] ArrowFunction
src/sharing/domain/visibility-scope.ts:49:35
 
 // True iff the scope permits the given transaction kind for anyone allowed to transact. `visible`
 // and the non-public scopes never permit a transaction.
-export const permitsTransaction = (
-  scope: VisibilityScope,
-  kind: TransactionKind,
-): boolean => TRANSACTABLE[scope] === kind;
+export const permitsTransaction = () => undefined;
 
killedBy: VisibilityPolicy.canTransact friendCircle never permits a public transaction denies lend for a peer and a stranger
statusReason: expected undefined to be false // Object.is equality

[Killed] ConditionalExpression
src/sharing/domain/visibility-scope.ts:52:15
 export const permitsTransaction = (
   scope: VisibilityScope,
   kind: TransactionKind,
-): boolean => TRANSACTABLE[scope] === kind;
+): boolean => false;
 
killedBy: VisibilityPolicy.canTransact lendable permits only lend allows lend for a stranger (public)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/sharing/domain/visibility-scope.ts:52:15
 export const permitsTransaction = (
   scope: VisibilityScope,
   kind: TransactionKind,
-): boolean => TRANSACTABLE[scope] === kind;
+): boolean => true;
 
killedBy: VisibilityPolicy.canTransact friendCircle never permits a public transaction denies lend for a peer and a stranger
statusReason: expected true to be false // Object.is equality
