[Killed] ConditionalExpression
social/application/use-cases/approve-follow-request.ts:40:9
     Result<ApproveFollowRequestResult, SocialError | SocialApplicationError>
   > => {
     const request = await deps.requests.findById(cmd.requestId);
-    if (!request) return err(SocialApplicationError.requestNotFound());
+    if (true) return err(SocialApplicationError.requestNotFound());
     if (request.targetId !== cmd.actorId) {
       return err(SocialApplicationError.notRequestTarget());
killedBy: resolving follow requests approve: creates the requester→target edge and publishes both events
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
social/application/use-cases/approve-follow-request.ts:40:9
     Result<ApproveFollowRequestResult, SocialError | SocialApplicationError>
   > => {
     const request = await deps.requests.findById(cmd.requestId);
-    if (!request) return err(SocialApplicationError.requestNotFound());
+    if (request) return err(SocialApplicationError.requestNotFound());
     if (request.targetId !== cmd.actorId) {
       return err(SocialApplicationError.notRequestTarget());
killedBy: resolving follow requests approve: creates the requester→target edge and publishes both events
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
social/application/use-cases/approve-follow-request.ts:41:9
   > => {
     const request = await deps.requests.findById(cmd.requestId);
     if (!request) return err(SocialApplicationError.requestNotFound());
-    if (request.targetId !== cmd.actorId) {
+    if (true) {
       return err(SocialApplicationError.notRequestTarget());
     }
killedBy: resolving follow requests approve: creates the requester→target edge and publishes both events
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
social/application/use-cases/approve-follow-request.ts:41:9
   > => {
     const request = await deps.requests.findById(cmd.requestId);
     if (!request) return err(SocialApplicationError.requestNotFound());
-    if (request.targetId !== cmd.actorId) {
+    if (false) {
       return err(SocialApplicationError.notRequestTarget());
     }
killedBy: resolving follow requests approve: only the target may approve
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
social/application/use-cases/approve-follow-request.ts:47:9
 
     const now = deps.clock.now();
     const approved = request.approve(now);
-    if (approved.isErr) return err(approved.error);
+    if (false) return err(approved.error);
 
     // Establish the edge unless a stray one already exists (duplicate-tolerant).
killedBy: resolving follow requests approve after decline fails (RequestNotPending)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
social/application/use-cases/approve-follow-request.ts:47:9
 
     const now = deps.clock.now();
     const approved = request.approve(now);
-    if (approved.isErr) return err(approved.error);
+    if (true) return err(approved.error);
 
     // Establish the edge unless a stray one already exists (duplicate-tolerant).
killedBy: resolving follow requests approve: creates the requester→target edge and publishes both events
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
social/application/use-cases/approve-follow-request.ts:55:9
       request.targetId,
     );
     let edgeEvents: readonly DomainEvent[] = [];
-    if (!existingEdge) {
+    if (existingEdge) {
       const edge = Follow.establish({
         id: deps.followIds.next(),
killedBy: resolving follow requests approve: creates the requester→target edge and publishes both events
statusReason: expected null not to be null

[Killed] ConditionalExpression
social/application/use-cases/approve-follow-request.ts:55:9
       request.targetId,
     );
     let edgeEvents: readonly DomainEvent[] = [];
-    if (!existingEdge) {
+    if (false) {
       const edge = Follow.establish({
         id: deps.followIds.next(),
killedBy: resolving follow requests approve: creates the requester→target edge and publishes both events
statusReason: expected null not to be null

[Killed] ObjectLiteral
social/application/use-cases/approve-follow-request.ts:56:37
     );
     let edgeEvents: readonly DomainEvent[] = [];
     if (!existingEdge) {
-      const edge = Follow.establish({
-        id: deps.followIds.next(),
-        followerId: request.requesterId,
-        followeeId: request.targetId,
-        now,
-      });
+      const edge = Follow.establish({});
       if (edge.isErr) return err(edge.error);
       await deps.follows.save(edge.value);
killedBy: resolving follow requests approve: creates the requester→target edge and publishes both events
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
social/application/use-cases/approve-follow-request.ts:62:11
         followeeId: request.targetId,
         now,
       });
-      if (edge.isErr) return err(edge.error);
+      if (false) return err(edge.error);
       await deps.follows.save(edge.value);
       edgeEvents = edge.value.pullEvents();
killedBy: resolving follow requests approve: surfaces a SelfFollow error if the loaded request is (invalidly) self-targeted
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
social/application/use-cases/approve-follow-request.ts:62:11
         followeeId: request.targetId,
         now,
       });
-      if (edge.isErr) return err(edge.error);
+      if (true) return err(edge.error);
       await deps.follows.save(edge.value);
       edgeEvents = edge.value.pullEvents();
killedBy: resolving follow requests approve: creates the requester→target edge and publishes both events
statusReason: expected false to be true // Object.is equality

[Killed] ArrayDeclaration
social/application/use-cases/approve-follow-request.ts:68:31
     }
 
     await deps.requests.save(request);
-    await deps.events.publish([...request.pullEvents(), ...edgeEvents]);
+    await deps.events.publish([]);
 
     const alreadyFollowsBack =
killedBy: resolving follow requests approve: creates the requester→target edge and publishes both events
statusReason: expected [] to deeply equal [ 'FollowRequestApproved', …(1) ]

[Killed] ConditionalExpression
social/application/use-cases/approve-follow-request.ts:71:7
     await deps.events.publish([...request.pullEvents(), ...edgeEvents]);
 
     const alreadyFollowsBack =
-      (await deps.follows.find(request.targetId, request.requesterId)) !== null;
+      true;
     return ok({ requesterId: request.requesterId, alreadyFollowsBack });
   };
killedBy: resolving follow requests approve: creates the requester→target edge and publishes both events
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
social/application/use-cases/approve-follow-request.ts:71:7
     await deps.events.publish([...request.pullEvents(), ...edgeEvents]);
 
     const alreadyFollowsBack =
-      (await deps.follows.find(request.targetId, request.requesterId)) !== null;
+      (await deps.follows.find(request.targetId, request.requesterId)) === null;
     return ok({ requesterId: request.requesterId, alreadyFollowsBack });
   };
killedBy: resolving follow requests approve: creates the requester→target edge and publishes both events
statusReason: expected true to be false // Object.is equality
