[Killed] ArrowFunction
social/application/use-cases/arrange-shelf.ts:26:3
 // shelf-arrangement to Profile.arrangeShelf, save, then publish ProfileShelfArranged. Creating
 // a profile is a separate flow; this use case only curates an existing one.
 export const makeArrangeShelf =
-  (deps: ArrangeShelfDeps): ArrangeShelf =>
-  async (
-    cmd: ArrangeShelfCommand,
-  ): Promise<Result<void, SocialError | SocialApplicationError>> => {
-    const profile = await deps.profiles.findByMember(cmd.memberId);
-    if (!profile) {
-      return err(SocialApplicationError.profileNotFound(cmd.memberId));
-    }
-
-    // arrangeShelf always succeeds — no domain validation can fail beyond type safety.
-    profile.arrangeShelf(cmd.copyIds, deps.clock.now());
-
-    await deps.profiles.save(profile);
-    await deps.events.publish(profile.pullEvents());
-
-    return ok(undefined);
-  };
+  () => undefined;
 
killedBy: makeArrangeShelf saves the ordered featuredCopyIds and publishes ProfileShelfArranged
statusReason: arrangeShelf is not a function

[Killed] BlockStatement
social/application/use-cases/arrange-shelf.ts:29:69
   (deps: ArrangeShelfDeps): ArrangeShelf =>
   async (
     cmd: ArrangeShelfCommand,
-  ): Promise<Result<void, SocialError | SocialApplicationError>> => {
-    const profile = await deps.profiles.findByMember(cmd.memberId);
-    if (!profile) {
-      return err(SocialApplicationError.profileNotFound(cmd.memberId));
-    }
-
-    // arrangeShelf always succeeds — no domain validation can fail beyond type safety.
-    profile.arrangeShelf(cmd.copyIds, deps.clock.now());
-
-    await deps.profiles.save(profile);
-    await deps.events.publish(profile.pullEvents());
-
-    return ok(undefined);
-  };
+  ): Promise<Result<void, SocialError | SocialApplicationError>> => {};
 
killedBy: makeArrangeShelf saves the ordered featuredCopyIds and publishes ProfileShelfArranged
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] BooleanLiteral
social/application/use-cases/arrange-shelf.ts:31:9
     cmd: ArrangeShelfCommand,
   ): Promise<Result<void, SocialError | SocialApplicationError>> => {
     const profile = await deps.profiles.findByMember(cmd.memberId);
-    if (!profile) {
+    if (profile) {
       return err(SocialApplicationError.profileNotFound(cmd.memberId));
     }
killedBy: makeArrangeShelf saves the ordered featuredCopyIds and publishes ProfileShelfArranged
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
social/application/use-cases/arrange-shelf.ts:31:19
     cmd: ArrangeShelfCommand,
   ): Promise<Result<void, SocialError | SocialApplicationError>> => {
     const profile = await deps.profiles.findByMember(cmd.memberId);
-    if (!profile) {
-      return err(SocialApplicationError.profileNotFound(cmd.memberId));
-    }
+    if (!profile) {}
 
     // arrangeShelf always succeeds — no domain validation can fail beyond type safety.
killedBy: makeArrangeShelf rejects arranging a shelf for a member without a profile (ProfileNotFound)
statusReason: Cannot read properties of null (reading 'arrangeShelf')
