[Killed] ArrowFunction
social/application/use-cases/decline-follow-request.ts:26:3
 // Notifications subscriber deliberately has no case for it and the read side keeps
 // presenting the request as pending until the cooldown lapses.
 export const makeDeclineFollowRequest =
-  (deps: DeclineFollowRequestDeps): DeclineFollowRequest =>
-  async (
-    cmd: DeclineFollowRequestCommand,
-  ): Promise<Result<void, SocialError | SocialApplicationError>> => {
-    const request = await deps.requests.findById(cmd.requestId);
-    if (!request) return err(SocialApplicationError.requestNotFound());
-    if (request.targetId !== cmd.actorId) {
-      return err(SocialApplicationError.notRequestTarget());
-    }
-
-    const declined = request.decline(deps.clock.now());
-    if (declined.isErr) return err(declined.error);
-
-    await deps.requests.save(request);
-    await deps.events.publish(request.pullEvents());
-    return ok(undefined);
-  };
+  () => undefined;
 
killedBy: resolving follow requests decline: marks declined, publishes FollowRequestDeclined, creates no edge
statusReason: decline is not a function

[Killed] BlockStatement
social/application/use-cases/decline-follow-request.ts:29:69
   (deps: DeclineFollowRequestDeps): DeclineFollowRequest =>
   async (
     cmd: DeclineFollowRequestCommand,
-  ): Promise<Result<void, SocialError | SocialApplicationError>> => {
-    const request = await deps.requests.findById(cmd.requestId);
-    if (!request) return err(SocialApplicationError.requestNotFound());
-    if (request.targetId !== cmd.actorId) {
-      return err(SocialApplicationError.notRequestTarget());
-    }
-
-    const declined = request.decline(deps.clock.now());
-    if (declined.isErr) return err(declined.error);
-
-    await deps.requests.save(request);
-    await deps.events.publish(request.pullEvents());
-    return ok(undefined);
-  };
+  ): Promise<Result<void, SocialError | SocialApplicationError>> => {};
 
killedBy: resolving follow requests decline: marks declined, publishes FollowRequestDeclined, creates no edge
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] ConditionalExpression
social/application/use-cases/decline-follow-request.ts:31:9
     cmd: DeclineFollowRequestCommand,
   ): Promise<Result<void, SocialError | SocialApplicationError>> => {
     const request = await deps.requests.findById(cmd.requestId);
-    if (!request) return err(SocialApplicationError.requestNotFound());
+    if (false) return err(SocialApplicationError.requestNotFound());
     if (request.targetId !== cmd.actorId) {
       return err(SocialApplicationError.notRequestTarget());
killedBy: resolving follow requests decline: unknown request id
statusReason: Cannot read properties of null (reading 'targetId')

[Killed] BlockStatement
social/application/use-cases/decline-follow-request.ts:32:43
   ): Promise<Result<void, SocialError | SocialApplicationError>> => {
     const request = await deps.requests.findById(cmd.requestId);
     if (!request) return err(SocialApplicationError.requestNotFound());
-    if (request.targetId !== cmd.actorId) {
-      return err(SocialApplicationError.notRequestTarget());
-    }
+    if (request.targetId !== cmd.actorId) {}
 
     const declined = request.decline(deps.clock.now());
killedBy: resolving follow requests decline: only the target may decline
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
social/application/use-cases/decline-follow-request.ts:37:9
     }
 
     const declined = request.decline(deps.clock.now());
-    if (declined.isErr) return err(declined.error);
+    if (true) return err(declined.error);
 
     await deps.requests.save(request);
killedBy: resolving follow requests decline: marks declined, publishes FollowRequestDeclined, creates no edge
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
social/application/use-cases/decline-follow-request.ts:37:9
     }
 
     const declined = request.decline(deps.clock.now());
-    if (declined.isErr) return err(declined.error);
+    if (false) return err(declined.error);
 
     await deps.requests.save(request);
killedBy: resolving follow requests decline: declining an already-resolved request fails (RequestNotPending)
statusReason: expected false to be true // Object.is equality
