[Killed] ArrowFunction
social/application/use-cases/edit-profile.ts:23:3
 // display-name validation to Profile.edit, save, then publish ProfileUpdated. Creating a profile
 // is a separate flow; this use case only edits an existing one.
 export const makeEditProfile =
-  (deps: EditProfileDeps): EditProfile =>
-  async (
-    cmd: EditProfileCommand,
-  ): Promise<Result<void, SocialError | SocialApplicationError>> => {
-    const profile = await deps.profiles.findByMember(cmd.memberId);
-    if (!profile) {
-      return err(SocialApplicationError.profileNotFound(cmd.memberId));
-    }
-
-    const edited = profile.edit({
-      displayName: cmd.displayName,
-      bio: cmd.bio,
-      now: deps.clock.now(),
-    });
-    if (edited.isErr) return err(edited.error);
-
-    await deps.profiles.save(profile);
-    await deps.events.publish(profile.pullEvents());
-
-    return ok(undefined);
-  };
+  () => undefined;
 
killedBy: makeEditProfile edits an existing profile: saves it and publishes ProfileUpdated
statusReason: edit is not a function

[Killed] BlockStatement
social/application/use-cases/edit-profile.ts:26:69
   (deps: EditProfileDeps): EditProfile =>
   async (
     cmd: EditProfileCommand,
-  ): Promise<Result<void, SocialError | SocialApplicationError>> => {
-    const profile = await deps.profiles.findByMember(cmd.memberId);
-    if (!profile) {
-      return err(SocialApplicationError.profileNotFound(cmd.memberId));
-    }
-
-    const edited = profile.edit({
-      displayName: cmd.displayName,
-      bio: cmd.bio,
-      now: deps.clock.now(),
-    });
-    if (edited.isErr) return err(edited.error);
-
-    await deps.profiles.save(profile);
-    await deps.events.publish(profile.pullEvents());
-
-    return ok(undefined);
-  };
+  ): Promise<Result<void, SocialError | SocialApplicationError>> => {};
 
killedBy: makeEditProfile edits an existing profile: saves it and publishes ProfileUpdated
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] ConditionalExpression
social/application/use-cases/edit-profile.ts:28:9
     cmd: EditProfileCommand,
   ): Promise<Result<void, SocialError | SocialApplicationError>> => {
     const profile = await deps.profiles.findByMember(cmd.memberId);
-    if (!profile) {
+    if (false) {
       return err(SocialApplicationError.profileNotFound(cmd.memberId));
     }
killedBy: makeEditProfile rejects editing a profile that does not exist (ProfileNotFound)
statusReason: Cannot read properties of null (reading 'edit')

[Killed] ObjectLiteral
social/application/use-cases/edit-profile.ts:32:33
       return err(SocialApplicationError.profileNotFound(cmd.memberId));
     }
 
-    const edited = profile.edit({
-      displayName: cmd.displayName,
-      bio: cmd.bio,
-      now: deps.clock.now(),
-    });
+    const edited = profile.edit({});
     if (edited.isErr) return err(edited.error);
 
killedBy: makeEditProfile edits an existing profile: saves it and publishes ProfileUpdated
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] ConditionalExpression
social/application/use-cases/edit-profile.ts:37:9
       bio: cmd.bio,
       now: deps.clock.now(),
     });
-    if (edited.isErr) return err(edited.error);
+    if (true) return err(edited.error);
 
     await deps.profiles.save(profile);
killedBy: makeEditProfile edits an existing profile: saves it and publishes ProfileUpdated
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
social/application/use-cases/edit-profile.ts:37:9
       bio: cmd.bio,
       now: deps.clock.now(),
     });
-    if (edited.isErr) return err(edited.error);
+    if (false) return err(edited.error);
 
     await deps.profiles.save(profile);
killedBy: makeEditProfile rejects an invalid display name and leaves the stored profile unchanged
statusReason: expected false to be true // Object.is equality
