[Killed] BlockStatement
social/application/use-cases/follow-member.ts:32:73
   (deps: FollowMemberDeps): FollowMember =>
   async (
     cmd: FollowMemberCommand,
-  ): Promise<Result<FollowId, SocialError | SocialApplicationError>> => {
-    // One edge per (follower, followee): reject a re-follow before minting anything.
-    const existing = await deps.follows.find(cmd.followerId, cmd.followeeId);
-    if (existing) {
-      return err(
-        SocialApplicationError.alreadyFollowing(cmd.followerId, cmd.followeeId),
-      );
-    }
-
-    // Entity rule: a member cannot follow themselves.
-    const follow = Follow.establish({
-      id: deps.followIds.next(),
-      followerId: cmd.followerId,
-      followeeId: cmd.followeeId,
-      now: deps.clock.now(),
-    });
-    if (follow.isErr) return err(follow.error);
-
-    await deps.follows.save(follow.value);
-    await deps.events.publish(follow.value.pullEvents());
-
-    return ok(follow.value.id);
-  };
+  ): Promise<Result<FollowId, SocialError | SocialApplicationError>> => {};
 
killedBy: makeFollowMember follows a member: saves the edge and publishes MemberFollowed
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] BlockStatement
social/application/use-cases/follow-member.ts:35:19
   ): Promise<Result<FollowId, SocialError | SocialApplicationError>> => {
     // One edge per (follower, followee): reject a re-follow before minting anything.
     const existing = await deps.follows.find(cmd.followerId, cmd.followeeId);
-    if (existing) {
-      return err(
-        SocialApplicationError.alreadyFollowing(cmd.followerId, cmd.followeeId),
-      );
-    }
+    if (existing) {}
 
     // Entity rule: a member cannot follow themselves.
killedBy: makeFollowMember rejects a duplicate follow (pair-uniqueness) without writing a second edge
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
social/application/use-cases/follow-member.ts:35:9
   ): Promise<Result<FollowId, SocialError | SocialApplicationError>> => {
     // One edge per (follower, followee): reject a re-follow before minting anything.
     const existing = await deps.follows.find(cmd.followerId, cmd.followeeId);
-    if (existing) {
+    if (false) {
       return err(
         SocialApplicationError.alreadyFollowing(cmd.followerId, cmd.followeeId),
killedBy: makeFollowMember rejects a duplicate follow (pair-uniqueness) without writing a second edge
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
social/application/use-cases/follow-member.ts:42:37
     }
 
     // Entity rule: a member cannot follow themselves.
-    const follow = Follow.establish({
-      id: deps.followIds.next(),
-      followerId: cmd.followerId,
-      followeeId: cmd.followeeId,
-      now: deps.clock.now(),
-    });
+    const follow = Follow.establish({});
     if (follow.isErr) return err(follow.error);
 
killedBy: makeFollowMember follows a member: saves the edge and publishes MemberFollowed
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
social/application/use-cases/follow-member.ts:48:9
       followeeId: cmd.followeeId,
       now: deps.clock.now(),
     });
-    if (follow.isErr) return err(follow.error);
+    if (false) return err(follow.error);
 
     await deps.follows.save(follow.value);
killedBy: makeFollowMember rejects a self-follow and writes nothing
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
social/application/use-cases/follow-member.ts:48:9
       followeeId: cmd.followeeId,
       now: deps.clock.now(),
     });
-    if (follow.isErr) return err(follow.error);
+    if (true) return err(follow.error);
 
     await deps.follows.save(follow.value);
killedBy: makeFollowMember follows a member: saves the edge and publishes MemberFollowed
statusReason: expected false to be true // Object.is equality
