[Killed] ArrowFunction
social/application/use-cases/post-comment.ts:24:3
 // then publish CommentPosted. There is no cross-aggregate rule (comments are append-only and may
 // repeat), so every decision lives in the aggregate; the use case only wires id + clock + I/O.
 export const makePostComment =
-  (deps: PostCommentDeps): PostComment =>
-  async (cmd: PostCommentCommand): Promise<Result<CommentId, SocialError>> => {
-    const comment = Comment.post({
-      id: deps.commentIds.next(),
-      puzzleId: cmd.puzzleId,
-      authorId: cmd.authorId,
-      text: cmd.text,
-      rating: cmd.rating,
-      copyId: cmd.copyId,
-      now: deps.clock.now(),
-    });
-    if (comment.isErr) return err(comment.error);
-
-    await deps.comments.save(comment.value);
-    await deps.events.publish(comment.value.pullEvents());
-
-    return ok(comment.value.id);
-  };
+  () => undefined;
 
killedBy: makePostComment posts a comment without a rating: saves it and publishes CommentPosted
statusReason: post is not a function

[Killed] BlockStatement
social/application/use-cases/post-comment.ts:25:79
 // repeat), so every decision lives in the aggregate; the use case only wires id + clock + I/O.
 export const makePostComment =
   (deps: PostCommentDeps): PostComment =>
-  async (cmd: PostCommentCommand): Promise<Result<CommentId, SocialError>> => {
-    const comment = Comment.post({
-      id: deps.commentIds.next(),
-      puzzleId: cmd.puzzleId,
-      authorId: cmd.authorId,
-      text: cmd.text,
-      rating: cmd.rating,
-      copyId: cmd.copyId,
-      now: deps.clock.now(),
-    });
-    if (comment.isErr) return err(comment.error);
-
-    await deps.comments.save(comment.value);
-    await deps.events.publish(comment.value.pullEvents());
-
-    return ok(comment.value.id);
-  };
+  async (cmd: PostCommentCommand): Promise<Result<CommentId, SocialError>> => {};
 
killedBy: makePostComment posts a comment without a rating: saves it and publishes CommentPosted
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] ConditionalExpression
social/application/use-cases/post-comment.ts:35:9
       copyId: cmd.copyId,
       now: deps.clock.now(),
     });
-    if (comment.isErr) return err(comment.error);
+    if (true) return err(comment.error);
 
     await deps.comments.save(comment.value);
killedBy: makePostComment posts a comment without a rating: saves it and publishes CommentPosted
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
social/application/use-cases/post-comment.ts:35:9
       copyId: cmd.copyId,
       now: deps.clock.now(),
     });
-    if (comment.isErr) return err(comment.error);
+    if (false) return err(comment.error);
 
     await deps.comments.save(comment.value);
killedBy: makePostComment rejects empty text, persists nothing, and publishes nothing
statusReason: Cannot read properties of undefined (reading 'toState')
