[Killed] ArrowFunction
social/application/use-cases/post-photo-comment.ts:28:3
 // append-only and may repeat), so every decision lives in the aggregate; the use case only wires
 // id + clock + I/O.
 export const makePostPhotoComment =
-  (deps: PostPhotoCommentDeps): PostPhotoComment =>
-  async (
-    cmd: PostPhotoCommentCommand,
-  ): Promise<Result<PhotoCommentId, SocialError>> => {
-    const comment = PhotoComment.post({
-      id: deps.commentIds.next(),
-      photoId: cmd.photoId,
-      authorId: cmd.authorId,
-      text: cmd.text,
-      now: deps.clock.now(),
-    });
-    if (comment.isErr) return err(comment.error);
-
-    await deps.comments.save(comment.value);
-    await deps.events.publish(comment.value.pullEvents());
-
-    return ok(comment.value.id);
-  };
+  () => undefined;
 
killedBy: makePostPhotoComment posts a comment: saves it and publishes PhotoCommentPosted
statusReason: post is not a function

[Killed] BlockStatement
social/application/use-cases/post-photo-comment.ts:31:54
   (deps: PostPhotoCommentDeps): PostPhotoComment =>
   async (
     cmd: PostPhotoCommentCommand,
-  ): Promise<Result<PhotoCommentId, SocialError>> => {
-    const comment = PhotoComment.post({
-      id: deps.commentIds.next(),
-      photoId: cmd.photoId,
-      authorId: cmd.authorId,
-      text: cmd.text,
-      now: deps.clock.now(),
-    });
-    if (comment.isErr) return err(comment.error);
-
-    await deps.comments.save(comment.value);
-    await deps.events.publish(comment.value.pullEvents());
-
-    return ok(comment.value.id);
-  };
+  ): Promise<Result<PhotoCommentId, SocialError>> => {};
 
killedBy: makePostPhotoComment posts a comment: saves it and publishes PhotoCommentPosted
statusReason: Cannot read properties of undefined (reading 'isOk')
