[Killed] ArithmeticOperator
social/application/use-cases/request-follow.ts:20:28
 
 // How long after a (silent) decline the requester's next attempt is swallowed. Chosen in the
 // spec: 7 days. Exported so the read side presents "declined but cooling down" as pending.
-export const COOLDOWN_MS = 7 * 24 * 60 * 60 * 1000;
+export const COOLDOWN_MS = 7 * 24 / 60 * 60 * 1000;
 
 export interface RequestFollowDeps {
killedBy: makeRequestFollow pins the cooldown constant at exactly 7 days
statusReason: expected 168000 to be 604800000 // Object.is equality

[Killed] ArithmeticOperator
social/application/use-cases/request-follow.ts:20:28
 
 // How long after a (silent) decline the requester's next attempt is swallowed. Chosen in the
 // spec: 7 days. Exported so the read side presents "declined but cooling down" as pending.
-export const COOLDOWN_MS = 7 * 24 * 60 * 60 * 1000;
+export const COOLDOWN_MS = 7 / 24 * 60 * 60 * 1000;
 
 export interface RequestFollowDeps {
killedBy: makeRequestFollow pins the cooldown constant at exactly 7 days
statusReason: expected 1050000 to be 604800000 // Object.is equality

[Killed] ConditionalExpression
social/application/use-cases/request-follow.ts:39:9
     cmd: RequestFollowCommand,
   ): Promise<Result<FollowRequestId, SocialError | SocialApplicationError>> => {
     const edge = await deps.follows.find(cmd.requesterId, cmd.targetId);
-    if (edge) {
+    if (false) {
       return err(
         SocialApplicationError.alreadyFollowing(cmd.requesterId, cmd.targetId),
killedBy: makeRequestFollow rejects when the requester already follows the target
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
social/application/use-cases/request-follow.ts:39:9
     cmd: RequestFollowCommand,
   ): Promise<Result<FollowRequestId, SocialError | SocialApplicationError>> => {
     const edge = await deps.follows.find(cmd.requesterId, cmd.targetId);
-    if (edge) {
+    if (true) {
       return err(
         SocialApplicationError.alreadyFollowing(cmd.requesterId, cmd.targetId),
killedBy: resolving follow requests approve: creates the requester→target edge and publishes both events
statusReason: setup

[Killed] BlockStatement
social/application/use-cases/request-follow.ts:50:19
       cmd.requesterId,
       cmd.targetId,
     );
-    if (existing) {
-      const state = existing.toState();
-      if (state.status === "pending") return ok(existing.id);
-      if (
-        state.status === "declined" &&
-        state.respondedAt &&
-        now.getTime() - state.respondedAt.getTime() < COOLDOWN_MS
-      ) {
-        // Silent decline: inside the cooldown a re-request is swallowed and the old id
-        // returned, exactly as if the target simply hadn't answered yet.
-        if (state.cancelledAt !== undefined) {
-          // The requester had cancelled during the cooldown (which un-masked the row on the
-          // read side). Re-requesting resumes the mask: clear the cancel, no event, same id.
-          existing.reopenAfterCancel();
-          await deps.requests.save(existing);
-        }
-        return ok(existing.id);
-      }
-      // Cooldown passed, or a stale approved row whose edge was later unfollowed: replace.
-      await deps.requests.remove(existing);
-    }
+    if (existing) {}
 
     const request = FollowRequest.request({
killedBy: makeRequestFollow is idempotent while a request is pending: returns the same id, no new row/event
statusReason: expected 'follow-request-2' to be 'follow-request-1' // Object.is equality

[Killed] EqualityOperator
social/application/use-cases/request-follow.ts:52:11
     );
     if (existing) {
       const state = existing.toState();
-      if (state.status === "pending") return ok(existing.id);
+      if (state.status !== "pending") return ok(existing.id);
       if (
         state.status === "declined" &&
killedBy: makeRequestFollow is idempotent while a request is pending: returns the same id, no new row/event
statusReason: expected 'follow-request-2' to be 'follow-request-1' // Object.is equality

[Killed] ConditionalExpression
social/application/use-cases/request-follow.ts:52:11
     );
     if (existing) {
       const state = existing.toState();
-      if (state.status === "pending") return ok(existing.id);
+      if (true) return ok(existing.id);
       if (
         state.status === "declined" &&
killedBy: makeRequestFollow re-request inside the cooldown after a cancel resumes the mask: same id, no new row, cancelledAt cleared, no event
statusReason: expected 2026-07-11T10:00:00.000Z to be undefined

[Killed] ConditionalExpression
social/application/use-cases/request-follow.ts:54:9
       const state = existing.toState();
       if (state.status === "pending") return ok(existing.id);
       if (
-        state.status === "declined" &&
-        state.respondedAt &&
-        now.getTime() - state.respondedAt.getTime() < COOLDOWN_MS
+        true
       ) {
         // Silent decline: inside the cooldown a re-request is swallowed and the old id
killedBy: makeRequestFollow re-request after the cooldown expires on a cancelled decline creates a fresh request
statusReason: expected 'follow-request-1' not to be 'follow-request-1' // Object.is equality

[Killed] ConditionalExpression
social/application/use-cases/request-follow.ts:54:9
       const state = existing.toState();
       if (state.status === "pending") return ok(existing.id);
       if (
-        state.status === "declined" &&
-        state.respondedAt &&
+        true &&
         now.getTime() - state.respondedAt.getTime() < COOLDOWN_MS
       ) {
killedBy: makeRequestFollow replaces a stale approved row immediately (cooldown applies only to declines)
statusReason: expected 'follow-request-1' not to be 'follow-request-1' // Object.is equality

[Killed] ArithmeticOperator
social/application/use-cases/request-follow.ts:56:9
       if (
         state.status === "declined" &&
         state.respondedAt &&
-        now.getTime() - state.respondedAt.getTime() < COOLDOWN_MS
+        now.getTime() + state.respondedAt.getTime() < COOLDOWN_MS
       ) {
         // Silent decline: inside the cooldown a re-request is swallowed and the old id
killedBy: makeRequestFollow silently no-ops during the decline cooldown (indistinguishable from pending)
statusReason: expected 'follow-request-2' to be 'follow-request-1' // Object.is equality

[Killed] ConditionalExpression
social/application/use-cases/request-follow.ts:56:9
       if (
         state.status === "declined" &&
         state.respondedAt &&
-        now.getTime() - state.respondedAt.getTime() < COOLDOWN_MS
+        true
       ) {
         // Silent decline: inside the cooldown a re-request is swallowed and the old id
killedBy: makeRequestFollow re-request after the cooldown expires on a cancelled decline creates a fresh request
statusReason: expected 'follow-request-1' not to be 'follow-request-1' // Object.is equality

[Killed] BlockStatement
social/application/use-cases/request-follow.ts:57:9
         state.status === "declined" &&
         state.respondedAt &&
         now.getTime() - state.respondedAt.getTime() < COOLDOWN_MS
-      ) {
-        // Silent decline: inside the cooldown a re-request is swallowed and the old id
-        // returned, exactly as if the target simply hadn't answered yet.
-        if (state.cancelledAt !== undefined) {
-          // The requester had cancelled during the cooldown (which un-masked the row on the
-          // read side). Re-requesting resumes the mask: clear the cancel, no event, same id.
-          existing.reopenAfterCancel();
-          await deps.requests.save(existing);
-        }
-        return ok(existing.id);
-      }
+      ) {}
       // Cooldown passed, or a stale approved row whose edge was later unfollowed: replace.
       await deps.requests.remove(existing);
killedBy: makeRequestFollow silently no-ops during the decline cooldown (indistinguishable from pending)
statusReason: expected 'follow-request-2' to be 'follow-request-1' // Object.is equality

[Killed] BlockStatement
social/application/use-cases/request-follow.ts:60:46
       ) {
         // Silent decline: inside the cooldown a re-request is swallowed and the old id
         // returned, exactly as if the target simply hadn't answered yet.
-        if (state.cancelledAt !== undefined) {
-          // The requester had cancelled during the cooldown (which un-masked the row on the
-          // read side). Re-requesting resumes the mask: clear the cancel, no event, same id.
-          existing.reopenAfterCancel();
-          await deps.requests.save(existing);
-        }
+        if (state.cancelledAt !== undefined) {}
         return ok(existing.id);
       }
killedBy: makeRequestFollow re-request inside the cooldown after a cancel resumes the mask: same id, no new row, cancelledAt cleared, no event
statusReason: expected 2026-07-11T10:00:00.000Z to be undefined

[Killed] EqualityOperator
social/application/use-cases/request-follow.ts:60:13
       ) {
         // Silent decline: inside the cooldown a re-request is swallowed and the old id
         // returned, exactly as if the target simply hadn't answered yet.
-        if (state.cancelledAt !== undefined) {
+        if (state.cancelledAt === undefined) {
           // The requester had cancelled during the cooldown (which un-masked the row on the
           // read side). Re-requesting resumes the mask: clear the cancel, no event, same id.
killedBy: makeRequestFollow silently no-ops during the decline cooldown (indistinguishable from pending)
statusReason: expected "save" to not be called at all, but actually been called 1 times

Received:

  1st save call:

    Array [
      FollowRequest {

[Killed] ConditionalExpression
social/application/use-cases/request-follow.ts:78:9
       targetId: cmd.targetId,
       now,
     });
-    if (request.isErr) return err(request.error);
+    if (false) return err(request.error);
 
     await deps.requests.save(request.value);
killedBy: makeRequestFollow rejects a self-request
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
social/application/use-cases/request-follow.ts:78:9
       targetId: cmd.targetId,
       now,
     });
-    if (request.isErr) return err(request.error);
+    if (true) return err(request.error);
 
     await deps.requests.save(request.value);
killedBy: makeRequestFollow creates a pending request and publishes FollowRequested
statusReason: expected false to be true // Object.is equality
