[Killed] ArrowFunction
social/application/use-cases/set-profile-visibility.ts:26:3
 // state change to Profile.changeVisibility, save, then publish ProfileVisibilityChanged. Creating
 // a profile is a separate flow; this use case only changes an existing one.
 export const makeSetProfileVisibility =
-  (deps: SetProfileVisibilityDeps): SetProfileVisibility =>
-  async (
-    cmd: SetProfileVisibilityCommand,
-  ): Promise<Result<void, SocialError | SocialApplicationError>> => {
-    const profile = await deps.profiles.findByMember(cmd.memberId);
-    if (!profile) {
-      return err(SocialApplicationError.profileNotFound(cmd.memberId));
-    }
-
-    // changeVisibility validates nothing beyond the union type, so it always succeeds; we
-    // intentionally do not branch on an impossible error here (unlike edit, whose display-name
-    // validation can fail). The use case still returns a Result for a uniform call site.
-    profile.changeVisibility(cmd.visibility, deps.clock.now());
-
-    await deps.profiles.save(profile);
-    await deps.events.publish(profile.pullEvents());
-
-    return ok(undefined);
-  };
+  () => undefined;
 
killedBy: makeSetProfileVisibility sets an existing profile to private: saves it and publishes ProfileVisibilityChanged
statusReason: setVisibility is not a function

[Killed] BlockStatement
social/application/use-cases/set-profile-visibility.ts:29:69
   (deps: SetProfileVisibilityDeps): SetProfileVisibility =>
   async (
     cmd: SetProfileVisibilityCommand,
-  ): Promise<Result<void, SocialError | SocialApplicationError>> => {
-    const profile = await deps.profiles.findByMember(cmd.memberId);
-    if (!profile) {
-      return err(SocialApplicationError.profileNotFound(cmd.memberId));
-    }
-
-    // changeVisibility validates nothing beyond the union type, so it always succeeds; we
-    // intentionally do not branch on an impossible error here (unlike edit, whose display-name
-    // validation can fail). The use case still returns a Result for a uniform call site.
-    profile.changeVisibility(cmd.visibility, deps.clock.now());
-
-    await deps.profiles.save(profile);
-    await deps.events.publish(profile.pullEvents());
-
-    return ok(undefined);
-  };
+  ): Promise<Result<void, SocialError | SocialApplicationError>> => {};
 
killedBy: makeSetProfileVisibility sets an existing profile to private: saves it and publishes ProfileVisibilityChanged
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] ConditionalExpression
social/application/use-cases/set-profile-visibility.ts:31:9
     cmd: SetProfileVisibilityCommand,
   ): Promise<Result<void, SocialError | SocialApplicationError>> => {
     const profile = await deps.profiles.findByMember(cmd.memberId);
-    if (!profile) {
+    if (true) {
       return err(SocialApplicationError.profileNotFound(cmd.memberId));
     }
killedBy: makeSetProfileVisibility sets an existing profile to private: saves it and publishes ProfileVisibilityChanged
statusReason: expected false to be true // Object.is equality
