[Killed] ArrowFunction
social/application/use-cases/unfollow-member.ts:24:3
 // Transaction script: look up the existing edge (NotFollowing if absent), record the severing on
 // the aggregate so it emits MemberUnfollowed, remove it from the repository, then publish.
 export const makeUnfollowMember =
-  (deps: UnfollowMemberDeps): UnfollowMember =>
-  async (
-    cmd: UnfollowMemberCommand,
-  ): Promise<Result<void, SocialApplicationError>> => {
-    const follow = await deps.follows.find(cmd.followerId, cmd.followeeId);
-    if (!follow) {
-      return err(
-        SocialApplicationError.notFollowing(cmd.followerId, cmd.followeeId),
-      );
-    }
-
-    follow.unfollow(deps.clock.now());
-    await deps.follows.remove(follow);
-    await deps.events.publish(follow.pullEvents());
-
-    return ok(undefined);
-  };
+  () => undefined;
 
killedBy: makeUnfollowMember unfollows an existing edge: removes it and publishes MemberUnfollowed
statusReason: unfollow is not a function

[Killed] BlockStatement
social/application/use-cases/unfollow-member.ts:27:55
   (deps: UnfollowMemberDeps): UnfollowMember =>
   async (
     cmd: UnfollowMemberCommand,
-  ): Promise<Result<void, SocialApplicationError>> => {
-    const follow = await deps.follows.find(cmd.followerId, cmd.followeeId);
-    if (!follow) {
-      return err(
-        SocialApplicationError.notFollowing(cmd.followerId, cmd.followeeId),
-      );
-    }
-
-    follow.unfollow(deps.clock.now());
-    await deps.follows.remove(follow);
-    await deps.events.publish(follow.pullEvents());
-
-    return ok(undefined);
-  };
+  ): Promise<Result<void, SocialApplicationError>> => {};
 
killedBy: makeUnfollowMember unfollows an existing edge: removes it and publishes MemberUnfollowed
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] ConditionalExpression
social/application/use-cases/unfollow-member.ts:29:9
     cmd: UnfollowMemberCommand,
   ): Promise<Result<void, SocialApplicationError>> => {
     const follow = await deps.follows.find(cmd.followerId, cmd.followeeId);
-    if (!follow) {
+    if (true) {
       return err(
         SocialApplicationError.notFollowing(cmd.followerId, cmd.followeeId),
killedBy: makeUnfollowMember unfollows an existing edge: removes it and publishes MemberUnfollowed
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
social/application/use-cases/unfollow-member.ts:29:9
     cmd: UnfollowMemberCommand,
   ): Promise<Result<void, SocialApplicationError>> => {
     const follow = await deps.follows.find(cmd.followerId, cmd.followeeId);
-    if (!follow) {
+    if (false) {
       return err(
         SocialApplicationError.notFollowing(cmd.followerId, cmd.followeeId),
killedBy: makeUnfollowMember rejects unfollowing when no edge exists (NotFollowing)
statusReason: Cannot read properties of null (reading 'unfollow')
