[Killed] BlockStatement
src/social/domain/comment-rating.ts:14:68
 export class CommentRating {
   private constructor(readonly value: number) {}
 
-  static create(value: number): Result<CommentRating, SocialError> {
-    if (!Number.isInteger(value) || value < MIN_STARS || value > MAX_STARS) {
-      return err(SocialError.invalidCommentRating(value));
-    }
-    return ok(new CommentRating(value));
-  }
+  static create(value: number): Result<CommentRating, SocialError> {}
 
   // Rehydrate a persisted value that was already validated when first stored.
killedBy: makePostComment posts a comment with a rating and carries it on the event
statusReason: Cannot read properties of undefined (reading 'isErr')

[Killed] EqualityOperator
src/social/domain/comment-rating.ts:15:37
   private constructor(readonly value: number) {}
 
   static create(value: number): Result<CommentRating, SocialError> {
-    if (!Number.isInteger(value) || value < MIN_STARS || value > MAX_STARS) {
+    if (!Number.isInteger(value) || value >= MIN_STARS || value > MAX_STARS) {
       return err(SocialError.invalidCommentRating(value));
     }
killedBy: Comment.post posts a comment with a rating and records it in the event payload
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/social/domain/comment-rating.ts:15:9
   private constructor(readonly value: number) {}
 
   static create(value: number): Result<CommentRating, SocialError> {
-    if (!Number.isInteger(value) || value < MIN_STARS || value > MAX_STARS) {
+    if (false) {
       return err(SocialError.invalidCommentRating(value));
     }
killedBy: Comment.post rejects a rating below 1
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/social/domain/comment-rating.ts:22:50
   }
 
   // Rehydrate a persisted value that was already validated when first stored.
-  static fromState(value: number): CommentRating {
-    return new CommentRating(value);
-  }
+  static fromState(value: number): CommentRating {}
 
   equals(other: CommentRating): boolean {
killedBy: CommentRating fromState rehydrates without re-validating
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] BlockStatement
src/social/domain/comment-rating.ts:26:41
     return new CommentRating(value);
   }
 
-  equals(other: CommentRating): boolean {
-    return this.value === other.value;
-  }
+  equals(other: CommentRating): boolean {}
 }
 
killedBy: CommentRating equals compares by value
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/social/domain/comment-rating.ts:27:12
   }
 
   equals(other: CommentRating): boolean {
-    return this.value === other.value;
+    return true;
   }
 }
killedBy: CommentRating equals compares by value
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/social/domain/comment-rating.ts:27:12
   }
 
   equals(other: CommentRating): boolean {
-    return this.value === other.value;
+    return false;
   }
 }
killedBy: CommentRating equals compares by value
statusReason: expected false to be true // Object.is equality
