[Killed] BlockStatement
src/social/domain/comment-text.ts:10:66
 export class CommentText {
   private constructor(readonly value: string) {}
 
-  static create(value: string): Result<CommentText, SocialError> {
-    const trimmed = value.trim();
-    if (trimmed.length === 0) {
-      return err(SocialError.emptyCommentText());
-    }
-    return ok(new CommentText(trimmed));
-  }
+  static create(value: string): Result<CommentText, SocialError> {}
 
   // Rehydrate a persisted value that was already validated when first stored.
killedBy: Comment.post posts a comment without a rating and records CommentPosted with rating null
statusReason: Cannot read properties of undefined (reading 'isErr')

[Killed] MethodExpression
src/social/domain/comment-text.ts:11:21
   private constructor(readonly value: string) {}
 
   static create(value: string): Result<CommentText, SocialError> {
-    const trimmed = value.trim();
+    const trimmed = value;
     if (trimmed.length === 0) {
       return err(SocialError.emptyCommentText());
killedBy: Comment.post trims surrounding whitespace from the text before storing and emitting
statusReason: expected '  spaced out  ' to be 'spaced out' // Object.is equality

[Killed] EqualityOperator
src/social/domain/comment-text.ts:12:9
 
   static create(value: string): Result<CommentText, SocialError> {
     const trimmed = value.trim();
-    if (trimmed.length === 0) {
+    if (trimmed.length !== 0) {
       return err(SocialError.emptyCommentText());
     }
killedBy: Comment.post posts a comment without a rating and records CommentPosted with rating null
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/social/domain/comment-text.ts:19:48
   }
 
   // Rehydrate a persisted value that was already validated when first stored.
-  static fromState(value: string): CommentText {
-    return new CommentText(value);
-  }
+  static fromState(value: string): CommentText {}
 }
 
killedBy: CommentText fromState rehydrates without re-validating
statusReason: Cannot read properties of undefined (reading 'value')
