[Killed] BlockStatement
src/social/domain/display-name.ts:10:66
 export class DisplayName {
   private constructor(readonly value: string) {}
 
-  static create(value: string): Result<DisplayName, SocialError> {
-    const trimmed = value.trim();
-    if (trimmed.length === 0) {
-      return err(SocialError.invalidDisplayName());
-    }
-    return ok(new DisplayName(trimmed));
-  }
+  static create(value: string): Result<DisplayName, SocialError> {}
 }
 
killedBy: makeSetProfileVisibility sets an existing profile to private: saves it and publishes ProfileVisibilityChanged
statusReason: Cannot read properties of undefined (reading 'isErr')

[Killed] MethodExpression
src/social/domain/display-name.ts:11:21
   private constructor(readonly value: string) {}
 
   static create(value: string): Result<DisplayName, SocialError> {
-    const trimmed = value.trim();
+    const trimmed = value;
     if (trimmed.length === 0) {
       return err(SocialError.invalidDisplayName());
killedBy: makeEditProfile rejects an invalid display name and leaves the stored profile unchanged
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/social/domain/display-name.ts:12:9
 
   static create(value: string): Result<DisplayName, SocialError> {
     const trimmed = value.trim();
-    if (trimmed.length === 0) {
+    if (false) {
       return err(SocialError.invalidDisplayName());
     }
killedBy: Profile.create rejects an empty/whitespace display name
statusReason: expected false to be true // Object.is equality
