[Killed] StringLiteral
src/social/domain/events.ts:29:19
 
 // A previously established follow relationship was severed.
 export class MemberUnfollowed implements DomainEvent {
-  readonly name = "MemberUnfollowed";
+  readonly name = "";
   constructor(
     readonly followerId: MemberId,
killedBy: Follow.establish records MemberUnfollowed when severed
statusReason: expected [ '' ] to deeply equal [ 'MemberUnfollowed' ]

[Killed] StringLiteral
src/social/domain/events.ts:39:19
 
 // A member asked to follow a private-profile member; the target must approve.
 export class FollowRequested implements DomainEvent {
-  readonly name = "FollowRequested";
+  readonly name = "";
   constructor(
     readonly requestId: FollowRequestId,
killedBy: makeRequestFollow creates a pending request and publishes FollowRequested
statusReason: expected [ '' ] to deeply equal [ 'FollowRequested' ]

[Killed] StringLiteral
src/social/domain/events.ts:112:19
 // rating). Carries the PhotoId so subscribers (future Notifications) can react without resolving the
 // comment back through persistence.
 export class PhotoCommentPosted implements DomainEvent {
-  readonly name = "PhotoCommentPosted";
+  readonly name = "";
   constructor(
     readonly commentId: PhotoCommentId,
killedBy: makePostPhotoComment posts a comment: saves it and publishes PhotoCommentPosted
statusReason: expected [ '' ] to deeply equal [ 'PhotoCommentPosted' ]

[Killed] StringLiteral
src/social/domain/events.ts:125:19
 // A member re-arranged their profile display shelf (the ordered, curated set of owned copies
 // shown on their profile). copyIds is the new ordered list (deduped, capped); empty clears it.
 export class ProfileShelfArranged implements DomainEvent {
-  readonly name = "ProfileShelfArranged";
+  readonly name = "";
   constructor(
     readonly profileId: ProfileId,
killedBy: makeArrangeShelf saves the ordered featuredCopyIds and publishes ProfileShelfArranged
statusReason: expected [ '' ] to deeply equal [ 'ProfileShelfArranged' ]
