[Killed] BlockStatement
src/social/domain/follow-request.ts:46:29
 
   private constructor(private state: FollowRequestState) {}
 
-  get id(): FollowRequestId {
-    return this.state.id;
-  }
+  get id(): FollowRequestId {}
 
   get requesterId(): MemberId {
killedBy: makeRequestFollow re-request after the cooldown expires on a cancelled decline creates a fresh request
statusReason: expected undefined not to be undefined // Object.is equality

[Killed] BlockStatement
src/social/domain/follow-request.ts:50:31
     return this.state.id;
   }
 
-  get requesterId(): MemberId {
-    return this.state.requesterId;
-  }
+  get requesterId(): MemberId {}
 
   get targetId(): MemberId {
killedBy: resolving follow requests approve: creates the requester→target edge and publishes both events
statusReason: expected undefined to be 'alice' // Object.is equality

[Killed] BlockStatement
src/social/domain/follow-request.ts:54:28
     return this.state.requesterId;
   }
 
-  get targetId(): MemberId {
-    return this.state.targetId;
-  }
+  get targetId(): MemberId {}
 
   get status(): FollowRequestStatus {
killedBy: resolving follow requests approve: creates the requester→target edge and publishes both events
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/social/domain/follow-request.ts:58:37
     return this.state.targetId;
   }
 
-  get status(): FollowRequestStatus {
-    return this.state.status;
-  }
+  get status(): FollowRequestStatus {}
 
   // Create a brand-new pending request. Rejects a self-request; pair-uniqueness is gated
killedBy: resolving follow requests decline: marks declined, publishes FollowRequestDeclined, creates no edge
statusReason: expected undefined to be 'declined' // Object.is equality

[Killed] BlockStatement
src/social/domain/follow-request.ts:64:75
 
   // Create a brand-new pending request. Rejects a self-request; pair-uniqueness is gated
   // upstream by the application layer via the repository.
-  static request(props: RequestProps): Result<FollowRequest, SocialError> {
-    if (props.requesterId === props.targetId) {
-      return err(SocialError.selfFollow());
-    }
-    const request = new FollowRequest({
-      id: props.id,
-      requesterId: props.requesterId,
-      targetId: props.targetId,
-      status: "pending",
-      createdAt: props.now,
-    });
-    request.record(
-      new FollowRequested(
-        props.id,
-        props.requesterId,
-        props.targetId,
-        props.now,
-      ),
-    );
-    return ok(request);
-  }
+  static request(props: RequestProps): Result<FollowRequest, SocialError> {}
 
   // Target accepts: pending → approved. The application layer establishes the Follow edge
killedBy: makeRequestFollow creates a pending request and publishes FollowRequested
statusReason: Cannot read properties of undefined (reading 'isErr')

[Killed] ConditionalExpression
src/social/domain/follow-request.ts:65:9
   // Create a brand-new pending request. Rejects a self-request; pair-uniqueness is gated
   // upstream by the application layer via the repository.
   static request(props: RequestProps): Result<FollowRequest, SocialError> {
-    if (props.requesterId === props.targetId) {
+    if (false) {
       return err(SocialError.selfFollow());
     }
killedBy: makeRequestFollow rejects a self-request
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/social/domain/follow-request.ts:65:47
   // Create a brand-new pending request. Rejects a self-request; pair-uniqueness is gated
   // upstream by the application layer via the repository.
   static request(props: RequestProps): Result<FollowRequest, SocialError> {
-    if (props.requesterId === props.targetId) {
-      return err(SocialError.selfFollow());
-    }
+    if (props.requesterId === props.targetId) {}
     const request = new FollowRequest({
       id: props.id,
killedBy: makeRequestFollow rejects a self-request
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/social/domain/follow-request.ts:88:49
 
   // Target accepts: pending → approved. The application layer establishes the Follow edge
   // in the same transaction; the aggregate only records the approval.
-  approve(now: Date): Result<void, SocialError> {
-    if (this.state.status !== "pending") {
-      return err(SocialError.requestNotPending());
-    }
-    this.state = { ...this.state, status: "approved", respondedAt: now };
-    this.record(
-      new FollowRequestApproved(
-        this.state.id,
-        this.state.requesterId,
-        this.state.targetId,
-        now,
-      ),
-    );
-    return ok(undefined);
-  }
+  approve(now: Date): Result<void, SocialError> {}
 
   // Target declines: pending → declined. Deliberately silent downstream — no notification
killedBy: resolving follow requests approve: creates the requester→target edge and publishes both events
statusReason: Cannot read properties of undefined (reading 'isErr')

[Killed] BlockStatement
src/social/domain/follow-request.ts:89:42
   // Target accepts: pending → approved. The application layer establishes the Follow edge
   // in the same transaction; the aggregate only records the approval.
   approve(now: Date): Result<void, SocialError> {
-    if (this.state.status !== "pending") {
-      return err(SocialError.requestNotPending());
-    }
+    if (this.state.status !== "pending") {}
     this.state = { ...this.state, status: "approved", respondedAt: now };
     this.record(
killedBy: resolving follow requests approve after decline fails (RequestNotPending)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/social/domain/follow-request.ts:89:9
   // Target accepts: pending → approved. The application layer establishes the Follow edge
   // in the same transaction; the aggregate only records the approval.
   approve(now: Date): Result<void, SocialError> {
-    if (this.state.status !== "pending") {
+    if (true) {
       return err(SocialError.requestNotPending());
     }
killedBy: makeRequestFollow replaces a stale approved row immediately (cooldown applies only to declines)
statusReason: setup

[Killed] StringLiteral
src/social/domain/follow-request.ts:92:43
     if (this.state.status !== "pending") {
       return err(SocialError.requestNotPending());
     }
-    this.state = { ...this.state, status: "approved", respondedAt: now };
+    this.state = { ...this.state, status: "", respondedAt: now };
     this.record(
       new FollowRequestApproved(
killedBy: FollowRequest.approve moves pending → approved, stamps respondedAt, records FollowRequestApproved
statusReason: expected '' to be 'approved' // Object.is equality

[Killed] BlockStatement
src/social/domain/follow-request.ts:106:49
 
   // Target declines: pending → declined. Deliberately silent downstream — no notification
   // subscriber case exists for FollowRequestDeclined; respondedAt starts the re-request cooldown.
-  decline(now: Date): Result<void, SocialError> {
-    if (this.state.status !== "pending") {
-      return err(SocialError.requestNotPending());
-    }
-    this.state = { ...this.state, status: "declined", respondedAt: now };
-    this.record(
-      new FollowRequestDeclined(
-        this.state.id,
-        this.state.requesterId,
-        this.state.targetId,
-        now,
-      ),
-    );
-    return ok(undefined);
-  }
+  decline(now: Date): Result<void, SocialError> {}
 
   // Requester cancels while the request is still a declined-in-cooldown record. Retains the row
killedBy: resolving follow requests decline: marks declined, publishes FollowRequestDeclined, creates no edge
statusReason: Cannot read properties of undefined (reading 'isErr')

[Killed] EqualityOperator
src/social/domain/follow-request.ts:107:9
   // Target declines: pending → declined. Deliberately silent downstream — no notification
   // subscriber case exists for FollowRequestDeclined; respondedAt starts the re-request cooldown.
   decline(now: Date): Result<void, SocialError> {
-    if (this.state.status !== "pending") {
+    if (this.state.status === "pending") {
       return err(SocialError.requestNotPending());
     }
killedBy: makeRequestFollow re-request inside the cooldown after a cancel resumes the mask: same id, no new row, cancelledAt cleared, no event
statusReason: setup

[Killed] ConditionalExpression
src/social/domain/follow-request.ts:107:9
   // Target declines: pending → declined. Deliberately silent downstream — no notification
   // subscriber case exists for FollowRequestDeclined; respondedAt starts the re-request cooldown.
   decline(now: Date): Result<void, SocialError> {
-    if (this.state.status !== "pending") {
+    if (false) {
       return err(SocialError.requestNotPending());
     }
killedBy: resolving follow requests decline: declining an already-resolved request fails (RequestNotPending)
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/social/domain/follow-request.ts:110:43
     if (this.state.status !== "pending") {
       return err(SocialError.requestNotPending());
     }
-    this.state = { ...this.state, status: "declined", respondedAt: now };
+    this.state = { ...this.state, status: "", respondedAt: now };
     this.record(
       new FollowRequestDeclined(
killedBy: resolving follow requests decline: marks declined, publishes FollowRequestDeclined, creates no edge
statusReason: expected '' to be 'declined' // Object.is equality

[Killed] BlockStatement
src/social/domain/follow-request.ts:126:68
   // (the cooldown must survive a cancel) but stamps cancelledAt so the read side stops masking it
   // as pending. Records NO event — nothing subscribes to a cancel. Only valid on a declined
   // request; any other status is a caller error surfaced as RequestNotPending.
-  markCancelledWhileDeclined(now: Date): Result<void, SocialError> {
-    if (this.state.status !== "declined") {
-      return err(SocialError.requestNotPending());
-    }
-    this.state = { ...this.state, cancelledAt: now };
-    return ok(undefined);
-  }
+  markCancelledWhileDeclined(now: Date): Result<void, SocialError> {}
 
   // Clears the cancelled mark so a re-request inside the cooldown silently resumes the pending
killedBy: FollowRequest.markCancelledWhileDeclined stamps cancelledAt on a declined request, keeps it declined, records no event
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] ConditionalExpression
src/social/domain/follow-request.ts:127:9
   // as pending. Records NO event — nothing subscribes to a cancel. Only valid on a declined
   // request; any other status is a caller error surfaced as RequestNotPending.
   markCancelledWhileDeclined(now: Date): Result<void, SocialError> {
-    if (this.state.status !== "declined") {
+    if (false) {
       return err(SocialError.requestNotPending());
     }
killedBy: resolving follow requests cancel: the requester withdraws their pending request (row removed, no events)
statusReason: expected FollowRequest{ state: { …(6) }, …(1) } to be null

[Killed] BlockStatement
src/social/domain/follow-request.ts:127:43
   // as pending. Records NO event — nothing subscribes to a cancel. Only valid on a declined
   // request; any other status is a caller error surfaced as RequestNotPending.
   markCancelledWhileDeclined(now: Date): Result<void, SocialError> {
-    if (this.state.status !== "declined") {
-      return err(SocialError.requestNotPending());
-    }
+    if (this.state.status !== "declined") {}
     this.state = { ...this.state, cancelledAt: now };
     return ok(undefined);
killedBy: resolving follow requests cancel: the requester withdraws their pending request (row removed, no events)
statusReason: expected FollowRequest{ state: { …(6) }, …(1) } to be null

[Killed] BlockStatement
src/social/domain/follow-request.ts:136:29
 
   // Clears the cancelled mark so a re-request inside the cooldown silently resumes the pending
   // mask. Records no event. The caller only ever invokes this on a cancelled declined request.
-  reopenAfterCancel(): void {
-    this.state = { ...this.state, cancelledAt: undefined };
-  }
+  reopenAfterCancel(): void {}
 
   // Drain recorded events for the publisher; clears the buffer so a save can't double-emit.
killedBy: FollowRequest.reopenAfterCancel clears cancelledAt, keeps the request declined, records no event
statusReason: expected 2026-07-13T10:00:00.000Z to be undefined

[Killed] BlockStatement
src/social/domain/follow-request.ts:147:62
     return drained;
   }
 
-  static rehydrate(state: FollowRequestState): FollowRequest {
-    return new FollowRequest(state);
-  }
+  static rehydrate(state: FollowRequestState): FollowRequest {}
 
   toState(): FollowRequestState {
killedBy: FollowRequest rehydration round-trips through toState/rehydrate without re-emitting events
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] BlockStatement
src/social/domain/follow-request.ts:151:33
     return new FollowRequest(state);
   }
 
-  toState(): FollowRequestState {
-    return this.state;
-  }
+  toState(): FollowRequestState {}
 
   private record(event: DomainEvent): void {
killedBy: resolving follow requests approve: creates the requester→target edge and publishes both events
statusReason: expected false to be true // Object.is equality
