[Killed] BlockStatement
src/social/domain/follow.ts:33:22
 
   private constructor(private readonly state: FollowState) {}
 
-  get id(): FollowId {
-    return this.state.id;
-  }
+  get id(): FollowId {}
 
   get followerId(): MemberId {
killedBy: resolving follow requests approve: reports alreadyFollowsBack when the target already follows the requester
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/social/domain/follow.ts:37:30
     return this.state.id;
   }
 
-  get followerId(): MemberId {
-    return this.state.followerId;
-  }
+  get followerId(): MemberId {}
 
   get followeeId(): MemberId {
killedBy: Follow.establish creates an edge and records MemberFollowed with the two parties
statusReason: expected undefined to be 'alice' // Object.is equality

[Killed] BlockStatement
src/social/domain/follow.ts:41:30
     return this.state.followerId;
   }
 
-  get followeeId(): MemberId {
-    return this.state.followeeId;
-  }
+  get followeeId(): MemberId {}
 
   // Create a brand-new follow edge. Rejects a self-follow; pair-uniqueness is gated upstream by
killedBy: Follow.establish creates an edge and records MemberFollowed with the two parties
statusReason: expected undefined to be 'bob' // Object.is equality

[Killed] BlockStatement
src/social/domain/follow.ts:47:72
 
   // Create a brand-new follow edge. Rejects a self-follow; pair-uniqueness is gated upstream by
   // the application layer via the repository. Records MemberFollowed on success.
-  static establish(props: EstablishProps): Result<Follow, SocialError> {
-    if (props.followerId === props.followeeId) {
-      return err(SocialError.selfFollow());
-    }
-
-    const follow = new Follow({
-      id: props.id,
-      followerId: props.followerId,
-      followeeId: props.followeeId,
-      createdAt: props.now,
-    });
-    follow.record(
-      new MemberFollowed(props.followerId, props.followeeId, props.now),
-    );
-    return ok(follow);
-  }
+  static establish(props: EstablishProps): Result<Follow, SocialError> {}
 
   // Record the severing of this relationship. The application layer deletes the edge from the
killedBy: resolving follow requests approve: creates the requester→target edge and publishes both events
statusReason: Cannot read properties of undefined (reading 'isErr')

[Killed] ConditionalExpression
src/social/domain/follow.ts:48:9
   // Create a brand-new follow edge. Rejects a self-follow; pair-uniqueness is gated upstream by
   // the application layer via the repository. Records MemberFollowed on success.
   static establish(props: EstablishProps): Result<Follow, SocialError> {
-    if (props.followerId === props.followeeId) {
+    if (true) {
       return err(SocialError.selfFollow());
     }
killedBy: makeFollowMember follows a member: saves the edge and publishes MemberFollowed
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/social/domain/follow.ts:48:9
   // Create a brand-new follow edge. Rejects a self-follow; pair-uniqueness is gated upstream by
   // the application layer via the repository. Records MemberFollowed on success.
   static establish(props: EstablishProps): Result<Follow, SocialError> {
-    if (props.followerId === props.followeeId) {
+    if (props.followerId !== props.followeeId) {
       return err(SocialError.selfFollow());
     }
killedBy: Follow.establish creates an edge and records MemberFollowed with the two parties
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/social/domain/follow.ts:66:29
 
   // Record the severing of this relationship. The application layer deletes the edge from the
   // repository; the aggregate only emits MemberUnfollowed so feeds and Notifications can react.
-  unfollow(now: Date): void {
-    this.record(
-      new MemberUnfollowed(this.state.followerId, this.state.followeeId, now),
-    );
-  }
+  unfollow(now: Date): void {}
 
   // Drain recorded events for the publisher; clears the buffer so a save can't double-emit.
killedBy: Follow.establish records MemberUnfollowed when severed
statusReason: expected [] to deeply equal [ 'MemberUnfollowed' ]

[Killed] BlockStatement
src/social/domain/follow.ts:80:48
   }
 
   // Map to/from persistence without the aggregate knowing about any storage technology.
-  static rehydrate(state: FollowState): Follow {
-    return new Follow(state);
-  }
+  static rehydrate(state: FollowState): Follow {}
 
   toState(): FollowState {
killedBy: makeFollowMember rejects a duplicate follow (pair-uniqueness) without writing a second edge
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/social/domain/follow.ts:84:26
     return new Follow(state);
   }
 
-  toState(): FollowState {
-    return this.state;
-  }
+  toState(): FollowState {}
 
   private record(event: DomainEvent): void {
killedBy: makeFollowMember rejects a duplicate follow (pair-uniqueness) without writing a second edge
statusReason: Cannot read properties of undefined (reading 'followerId')
