[Killed] BlockStatement
src/social/domain/photo-comment.ts:40:28
 
   private constructor(private readonly state: PhotoCommentState) {}
 
-  get id(): PhotoCommentId {
-    return this.state.id;
-  }
+  get id(): PhotoCommentId {}
 
   get photoId(): PhotoId {
killedBy: PhotoComment.post posts a comment and records PhotoCommentPosted with the trimmed text
statusReason: expected undefined to be 'photo-comment-1' // Object.is equality

[Killed] BlockStatement
src/social/domain/photo-comment.ts:44:26
     return this.state.id;
   }
 
-  get photoId(): PhotoId {
-    return this.state.photoId;
-  }
+  get photoId(): PhotoId {}
 
   get authorId(): MemberId {
killedBy: makePostPhotoComment posts a comment: saves it and publishes PhotoCommentPosted
statusReason: expected undefined to be 'photo-1' // Object.is equality

[Killed] BlockStatement
src/social/domain/photo-comment.ts:62:80
 
   // Post a brand-new photo comment. Validates the text (non-empty after trim); failure fails the
   // whole post. Records PhotoCommentPosted on success.
-  static post(props: PostPhotoCommentProps): Result<PhotoComment, SocialError> {
-    const text = CommentText.create(props.text);
-    if (text.isErr) return err(text.error);
-
-    const comment = new PhotoComment({
-      id: props.id,
-      photoId: props.photoId,
-      authorId: props.authorId,
-      text: text.value,
-      createdAt: props.now,
-    });
-    comment.record(
-      new PhotoCommentPosted(
-        props.id,
-        props.photoId,
-        props.authorId,
-        text.value.value,
-        props.now,
-      ),
-    );
-    return ok(comment);
-  }
+  static post(props: PostPhotoCommentProps): Result<PhotoComment, SocialError> {}
 
   // Drain recorded events for the publisher; clears the buffer so a save can't double-emit.
killedBy: makePostPhotoComment posts a comment: saves it and publishes PhotoCommentPosted
statusReason: Cannot read properties of undefined (reading 'isErr')

[Killed] ObjectLiteral
src/social/domain/photo-comment.ts:66:38
     const text = CommentText.create(props.text);
     if (text.isErr) return err(text.error);
 
-    const comment = new PhotoComment({
-      id: props.id,
-      photoId: props.photoId,
-      authorId: props.authorId,
-      text: text.value,
-      createdAt: props.now,
-    });
+    const comment = new PhotoComment({});
     comment.record(
       new PhotoCommentPosted(
killedBy: makePostPhotoComment posts a comment: saves it and publishes PhotoCommentPosted
statusReason: expected undefined to be 'photo-comment-1' // Object.is equality

[Killed] BlockStatement
src/social/domain/photo-comment.ts:93:60
   }
 
   // Map to/from persistence without the aggregate knowing about any storage technology.
-  static rehydrate(state: PhotoCommentState): PhotoComment {
-    return new PhotoComment(state);
-  }
+  static rehydrate(state: PhotoCommentState): PhotoComment {}
 
   toState(): PhotoCommentState {
killedBy: makePostPhotoComment posts a comment: saves it and publishes PhotoCommentPosted
statusReason: Cannot read properties of undefined (reading 'text')

[Killed] BlockStatement
src/social/domain/photo-comment.ts:97:32
     return new PhotoComment(state);
   }
 
-  toState(): PhotoCommentState {
-    return this.state;
-  }
+  toState(): PhotoCommentState {}
 
   private record(event: DomainEvent): void {
killedBy: makePostPhotoComment posts a comment: saves it and publishes PhotoCommentPosted
statusReason: Cannot read properties of undefined (reading 'text')
