[Killed] ArrowFunction
solving/application/use-cases/delete-completion.ts:19:3
 // Transaction script: load (→ CompletionNotFound), guard ownership (→ NotCompletionOwner), delete,
 // publish CompletionDeleted so the goal-progress reactor recomputes the member's derived progress.
 export const makeDeleteCompletion =
-  (deps: DeleteCompletionDeps): DeleteCompletion =>
-  async (cmd: DeleteCompletionCommand) => {
-    const completion = await deps.completions.findById(cmd.completionId);
-    if (!completion) {
-      return err(SolvingApplicationError.completionNotFound(cmd.completionId));
-    }
-
-    if (completion.userId !== cmd.actingMemberId) {
-      return err(SolvingError.notCompletionOwner());
-    }
-
-    await deps.completions.delete(cmd.completionId);
-    await deps.events.publish([
-      new CompletionDeleted(
-        cmd.completionId,
-        completion.userId,
-        deps.clock.now(),
-      ),
-    ]);
-    return ok(undefined);
-  };
+  () => undefined;
 
killedBy: Completion use cases deleteCompletion owner deletes their completion: repo.delete called, CompletionDeleted published
statusReason: del is not a function

[Killed] BlockStatement
solving/application/use-cases/delete-completion.ts:20:43
 // publish CompletionDeleted so the goal-progress reactor recomputes the member's derived progress.
 export const makeDeleteCompletion =
   (deps: DeleteCompletionDeps): DeleteCompletion =>
-  async (cmd: DeleteCompletionCommand) => {
-    const completion = await deps.completions.findById(cmd.completionId);
-    if (!completion) {
-      return err(SolvingApplicationError.completionNotFound(cmd.completionId));
-    }
-
-    if (completion.userId !== cmd.actingMemberId) {
-      return err(SolvingError.notCompletionOwner());
-    }
-
-    await deps.completions.delete(cmd.completionId);
-    await deps.events.publish([
-      new CompletionDeleted(
-        cmd.completionId,
-        completion.userId,
-        deps.clock.now(),
-      ),
-    ]);
-    return ok(undefined);
-  };
+  async (cmd: DeleteCompletionCommand) => {};
 
killedBy: Completion use cases deleteCompletion owner deletes their completion: repo.delete called, CompletionDeleted published
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] BooleanLiteral
solving/application/use-cases/delete-completion.ts:22:9
   (deps: DeleteCompletionDeps): DeleteCompletion =>
   async (cmd: DeleteCompletionCommand) => {
     const completion = await deps.completions.findById(cmd.completionId);
-    if (!completion) {
+    if (completion) {
       return err(SolvingApplicationError.completionNotFound(cmd.completionId));
     }
killedBy: Completion use cases deleteCompletion owner deletes their completion: repo.delete called, CompletionDeleted published
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
solving/application/use-cases/delete-completion.ts:26:9
       return err(SolvingApplicationError.completionNotFound(cmd.completionId));
     }
 
-    if (completion.userId !== cmd.actingMemberId) {
+    if (true) {
       return err(SolvingError.notCompletionOwner());
     }
killedBy: Completion use cases deleteCompletion owner deletes their completion: repo.delete called, CompletionDeleted published
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
solving/application/use-cases/delete-completion.ts:26:9
       return err(SolvingApplicationError.completionNotFound(cmd.completionId));
     }
 
-    if (completion.userId !== cmd.actingMemberId) {
+    if (false) {
       return err(SolvingError.notCompletionOwner());
     }
killedBy: Completion use cases deleteCompletion non-owner gets NotCompletionOwner and completion remains
statusReason: expected false to be true // Object.is equality
