[Killed] ArrowFunction
solving/application/use-cases/finish-completion.ts:19:3
 // Transaction script: load (→ CompletionNotFound), check ownership, finish the in-progress
 // completion (→ CompletionRecorded), persist, publish.
 export const makeFinishCompletion =
-  (deps: FinishCompletionDeps): FinishCompletion =>
-  async (cmd: FinishCompletionCommand) => {
-    const completion = await deps.completions.findById(cmd.completionId);
-    if (!completion) {
-      return err(SolvingApplicationError.completionNotFound(cmd.completionId));
-    }
-    if (completion.userId !== cmd.actingMemberId) {
-      return err(SolvingError.notCompletionOwner());
-    }
-
-    const outcome = completion.finish(
-      cmd.endDate,
-      deps.clock.now(),
-      cmd.completionTimeMinutes,
-      cmd.allPiecesPresent,
-    );
-    if (outcome.isErr) return err(outcome.error);
-
-    await deps.completions.save(completion);
-    await deps.events.publish(completion.pullEvents());
-    return ok(undefined);
-  };
+  () => undefined;
 
killedBy: Completion use cases finishCompletion finishes an in-progress completion owned by the member
statusReason: finish is not a function

[Killed] BlockStatement
solving/application/use-cases/finish-completion.ts:20:43
 // completion (→ CompletionRecorded), persist, publish.
 export const makeFinishCompletion =
   (deps: FinishCompletionDeps): FinishCompletion =>
-  async (cmd: FinishCompletionCommand) => {
-    const completion = await deps.completions.findById(cmd.completionId);
-    if (!completion) {
-      return err(SolvingApplicationError.completionNotFound(cmd.completionId));
-    }
-    if (completion.userId !== cmd.actingMemberId) {
-      return err(SolvingError.notCompletionOwner());
-    }
-
-    const outcome = completion.finish(
-      cmd.endDate,
-      deps.clock.now(),
-      cmd.completionTimeMinutes,
-      cmd.allPiecesPresent,
-    );
-    if (outcome.isErr) return err(outcome.error);
-
-    await deps.completions.save(completion);
-    await deps.events.publish(completion.pullEvents());
-    return ok(undefined);
-  };
+  async (cmd: FinishCompletionCommand) => {};
 
killedBy: Completion use cases finishCompletion finishes an in-progress completion owned by the member
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] ConditionalExpression
solving/application/use-cases/finish-completion.ts:25:9
     if (!completion) {
       return err(SolvingApplicationError.completionNotFound(cmd.completionId));
     }
-    if (completion.userId !== cmd.actingMemberId) {
+    if (true) {
       return err(SolvingError.notCompletionOwner());
     }
killedBy: Completion use cases finishCompletion finishes an in-progress completion owned by the member
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
solving/application/use-cases/finish-completion.ts:25:9
     if (!completion) {
       return err(SolvingApplicationError.completionNotFound(cmd.completionId));
     }
-    if (completion.userId !== cmd.actingMemberId) {
+    if (false) {
       return err(SolvingError.notCompletionOwner());
     }
killedBy: Completion use cases finishCompletion rejects a non-owner with NotCompletionOwner
statusReason: expected false to be true // Object.is equality
