[Killed] ArrowFunction
solving/application/use-cases/recompute-goal-progress.ts:21:3
 // always derived here). Each goal emits GoalProgressed on a change and GoalAchieved once on the
 // crossing. Publishes the union of every touched goal's events.
 export const makeRecomputeGoalProgress =
-  (deps: RecomputeGoalProgressDeps): RecomputeGoalProgress =>
-  async (cmd: RecomputeGoalProgressCommand) => {
-    const count = await deps.completions.countCompletedByUser(cmd.userId);
-    const goals = await deps.goals.listByUser(cmd.userId);
-
-    const now = deps.clock.now();
-    for (const goal of goals) {
-      if (!goal.isActive) continue;
-      const outcome = goal.progressTo(count, now);
-      if (outcome.isErr) return err(outcome.error);
-
-      const events = goal.pullEvents();
-      if (events.length > 0) {
-        await deps.goals.save(goal);
-        await deps.events.publish(events);
-      }
-    }
-    return ok(undefined);
-  };
+  () => undefined;
 
killedBy: Goal use cases recomputeGoalProgress (derived from completions) derives current progress from the completion count and publishes GoalProgressed
statusReason: recompute is not a function

[Killed] BlockStatement
solving/application/use-cases/recompute-goal-progress.ts:22:48
 // crossing. Publishes the union of every touched goal's events.
 export const makeRecomputeGoalProgress =
   (deps: RecomputeGoalProgressDeps): RecomputeGoalProgress =>
-  async (cmd: RecomputeGoalProgressCommand) => {
-    const count = await deps.completions.countCompletedByUser(cmd.userId);
-    const goals = await deps.goals.listByUser(cmd.userId);
-
-    const now = deps.clock.now();
-    for (const goal of goals) {
-      if (!goal.isActive) continue;
-      const outcome = goal.progressTo(count, now);
-      if (outcome.isErr) return err(outcome.error);
-
-      const events = goal.pullEvents();
-      if (events.length > 0) {
-        await deps.goals.save(goal);
-        await deps.events.publish(events);
-      }
-    }
-    return ok(undefined);
-  };
+  async (cmd: RecomputeGoalProgressCommand) => {};
 
killedBy: Goal use cases recomputeGoalProgress (derived from completions) derives current progress from the completion count and publishes GoalProgressed
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] BlockStatement
solving/application/use-cases/recompute-goal-progress.ts:27:31
     const goals = await deps.goals.listByUser(cmd.userId);
 
     const now = deps.clock.now();
-    for (const goal of goals) {
-      if (!goal.isActive) continue;
-      const outcome = goal.progressTo(count, now);
-      if (outcome.isErr) return err(outcome.error);
-
-      const events = goal.pullEvents();
-      if (events.length > 0) {
-        await deps.goals.save(goal);
-        await deps.events.publish(events);
-      }
-    }
+    for (const goal of goals) {}
     return ok(undefined);
   };
killedBy: Goal use cases recomputeGoalProgress (derived from completions) derives current progress from the completion count and publishes GoalProgressed
statusReason: expected [] to deeply equal [ 'GoalProgressed' ]

[Killed] BooleanLiteral
solving/application/use-cases/recompute-goal-progress.ts:28:11
 
     const now = deps.clock.now();
     for (const goal of goals) {
-      if (!goal.isActive) continue;
+      if (goal.isActive) continue;
       const outcome = goal.progressTo(count, now);
       if (outcome.isErr) return err(outcome.error);
killedBy: Goal use cases recomputeGoalProgress (derived from completions) derives current progress from the completion count and publishes GoalProgressed
statusReason: expected [] to deeply equal [ 'GoalProgressed' ]

[Killed] ConditionalExpression
solving/application/use-cases/recompute-goal-progress.ts:28:11
 
     const now = deps.clock.now();
     for (const goal of goals) {
-      if (!goal.isActive) continue;
+      if (true) continue;
       const outcome = goal.progressTo(count, now);
       if (outcome.isErr) return err(outcome.error);
killedBy: Goal use cases recomputeGoalProgress (derived from completions) derives current progress from the completion count and publishes GoalProgressed
statusReason: expected [] to deeply equal [ 'GoalProgressed' ]

[Killed] ConditionalExpression
solving/application/use-cases/recompute-goal-progress.ts:30:11
     for (const goal of goals) {
       if (!goal.isActive) continue;
       const outcome = goal.progressTo(count, now);
-      if (outcome.isErr) return err(outcome.error);
+      if (true) return err(outcome.error);
 
       const events = goal.pullEvents();
killedBy: Goal use cases recomputeGoalProgress (derived from completions) derives current progress from the completion count and publishes GoalProgressed
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
solving/application/use-cases/recompute-goal-progress.ts:30:11
     for (const goal of goals) {
       if (!goal.isActive) continue;
       const outcome = goal.progressTo(count, now);
-      if (outcome.isErr) return err(outcome.error);
+      if (false) return err(outcome.error);
 
       const events = goal.pullEvents();
killedBy: Goal use cases recomputeGoalProgress (derived from completions) propagates a progressTo error (defensive: a negative authoritative count)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
solving/application/use-cases/recompute-goal-progress.ts:33:11
       if (outcome.isErr) return err(outcome.error);
 
       const events = goal.pullEvents();
-      if (events.length > 0) {
+      if (false) {
         await deps.goals.save(goal);
         await deps.events.publish(events);
killedBy: Goal use cases recomputeGoalProgress (derived from completions) derives current progress from the completion count and publishes GoalProgressed
statusReason: expected [] to deeply equal [ 'GoalProgressed' ]

[Killed] BlockStatement
solving/application/use-cases/recompute-goal-progress.ts:33:30
       if (outcome.isErr) return err(outcome.error);
 
       const events = goal.pullEvents();
-      if (events.length > 0) {
-        await deps.goals.save(goal);
-        await deps.events.publish(events);
-      }
+      if (events.length > 0) {}
     }
     return ok(undefined);
killedBy: Goal use cases recomputeGoalProgress (derived from completions) derives current progress from the completion count and publishes GoalProgressed
statusReason: expected [] to deeply equal [ 'GoalProgressed' ]
