[Killed] BlockStatement
solving/application/use-cases/record-completion.ts:23:35
   (deps: RecordCompletionDeps): RecordCompletion =>
   async (cmd: RecordCompletionCommand) => {
     let review: PuzzleReview | undefined;
-    if (cmd.rating !== undefined) {
-      const rating = StarRating.create(cmd.rating);
-      if (rating.isErr) return err(rating.error);
-      review = PuzzleReview.create(rating.value, cmd.reviewText);
-    }
+    if (cmd.rating !== undefined) {}
 
     const completion = Completion.record({
killedBy: Completion use cases recordCompletion attaches a review and publishes PuzzleReviewed when a rating is supplied
statusReason: expected [ 'CompletionRecorded' ] to deeply equal [ 'CompletionRecorded', …(1) ]

[Killed] ConditionalExpression
solving/application/use-cases/record-completion.ts:23:9
   (deps: RecordCompletionDeps): RecordCompletion =>
   async (cmd: RecordCompletionCommand) => {
     let review: PuzzleReview | undefined;
-    if (cmd.rating !== undefined) {
+    if (true) {
       const rating = StarRating.create(cmd.rating);
       if (rating.isErr) return err(rating.error);
killedBy: Goal use cases recomputeGoalProgress (derived from completions) derives current progress from the completion count and publishes GoalProgressed
statusReason: setup failed

[Killed] ConditionalExpression
solving/application/use-cases/record-completion.ts:25:11
     let review: PuzzleReview | undefined;
     if (cmd.rating !== undefined) {
       const rating = StarRating.create(cmd.rating);
-      if (rating.isErr) return err(rating.error);
+      if (false) return err(rating.error);
       review = PuzzleReview.create(rating.value, cmd.reviewText);
     }
killedBy: Completion use cases recordCompletion rejects an invalid rating with InvalidRating
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] ConditionalExpression
solving/application/use-cases/record-completion.ts:25:11
     let review: PuzzleReview | undefined;
     if (cmd.rating !== undefined) {
       const rating = StarRating.create(cmd.rating);
-      if (rating.isErr) return err(rating.error);
+      if (true) return err(rating.error);
       review = PuzzleReview.create(rating.value, cmd.reviewText);
     }
killedBy: Completion use cases recordCompletion attaches a review and publishes PuzzleReviewed when a rating is supplied
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
solving/application/use-cases/record-completion.ts:43:9
       allPiecesPresent: cmd.allPiecesPresent,
       now: deps.clock.now(),
     });
-    if (completion.isErr) return err(completion.error);
+    if (false) return err(completion.error);
 
     await deps.completions.save(completion.value);
killedBy: Completion use cases recordCompletion rejects an end before start with InvalidTimeRange
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
solving/application/use-cases/record-completion.ts:43:9
       allPiecesPresent: cmd.allPiecesPresent,
       now: deps.clock.now(),
     });
-    if (completion.isErr) return err(completion.error);
+    if (true) return err(completion.error);
 
     await deps.completions.save(completion.value);
killedBy: Completion use cases recordCompletion persists a finished completion and publishes CompletionRecorded
statusReason: expected false to be true // Object.is equality
