[Killed] ArrowFunction
solving/application/use-cases/set-track-completion-duration.ts:16:3
 
 // Upsert the member's duration-tracking choice: load or default, mutate, save.
 export const makeSetTrackCompletionDuration =
-  (deps: SetTrackCompletionDurationDeps): SetTrackCompletionDuration =>
-  async (cmd: SetTrackCompletionDurationCommand) => {
-    const now = deps.clock.now();
-    const existing = await deps.preferences.findByMember(cmd.memberId);
-    const prefs =
-      existing ?? SolvingPreferences.createDefault(cmd.memberId, now);
-    prefs.setTrackCompletionDuration(cmd.enabled, now);
-    await deps.preferences.save(prefs);
-  };
+  () => undefined;
 
killedBy: setShareInProgress does not disturb an existing trackCompletionDuration preference
statusReason: setTrackUseCase is not a function

[Killed] BlockStatement
solving/application/use-cases/set-track-completion-duration.ts:17:53
 // Upsert the member's duration-tracking choice: load or default, mutate, save.
 export const makeSetTrackCompletionDuration =
   (deps: SetTrackCompletionDurationDeps): SetTrackCompletionDuration =>
-  async (cmd: SetTrackCompletionDurationCommand) => {
-    const now = deps.clock.now();
-    const existing = await deps.preferences.findByMember(cmd.memberId);
-    const prefs =
-      existing ?? SolvingPreferences.createDefault(cmd.memberId, now);
-    prefs.setTrackCompletionDuration(cmd.enabled, now);
-    await deps.preferences.save(prefs);
-  };
+  async (cmd: SetTrackCompletionDurationCommand) => {};
 
killedBy: setShareInProgress does not disturb an existing trackCompletionDuration preference
statusReason: expected undefined to be true // Object.is equality
