[Killed] ArithmeticOperator
src/solving/domain/completion.ts:19:31
 export const MAX_PHOTOS = 5;
 
 // Edits are only allowed within this window after the completion was recorded (documented rule).
-export const EDIT_WINDOW_MS = 24 * 60 * 60 * 1000;
+export const EDIT_WINDOW_MS = 24 * 60 * 60 / 1000;
 
 // A date-only same-day completion (start == end, no explicit duration) counts as one day.
killedBy: Completion.edit treats the edit window as exactly 24 hours from the end (inclusive)
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
src/solving/domain/completion.ts:19:31
 export const MAX_PHOTOS = 5;
 
 // Edits are only allowed within this window after the completion was recorded (documented rule).
-export const EDIT_WINDOW_MS = 24 * 60 * 60 * 1000;
+export const EDIT_WINDOW_MS = 24 / 60 * 60 * 1000;
 
 // A date-only same-day completion (start == end, no explicit duration) counts as one day.
killedBy: Completion.edit treats the edit window as exactly 24 hours from the end (inclusive)
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/solving/domain/completion.ts:97:26
 
   private constructor(private state: CompletionState) {}
 
-  get id(): CompletionId {
-    return this.state.id;
-  }
+  get id(): CompletionId {}
 
   get userId(): MemberId {
killedBy: Goal use cases recomputeGoalProgress (derived from completions) fires GoalAchieved once when the count crosses the target
statusReason: expected [ 'GoalProgressed' ] to deeply equal [ 'GoalProgressed', 'GoalAchieved' ]

[Killed] BlockStatement
src/solving/domain/completion.ts:105:30
     return this.state.userId;
   }
 
-  get isCompleted(): boolean {
-    return this.state.isCompleted;
-  }
+  get isCompleted(): boolean {}
 
   get puzzleReview(): PuzzleReview | undefined {
killedBy: Completion.start starts an in-progress completion and records CompletionStarted
statusReason: expected undefined to be false // Object.is equality

[Killed] BlockStatement
src/solving/domain/completion.ts:109:48
     return this.state.isCompleted;
   }
 
-  get puzzleReview(): PuzzleReview | undefined {
-    return this.state.review;
-  }
+  get puzzleReview(): PuzzleReview | undefined {}
 
   get photos(): readonly Photo[] {
killedBy: Completion.review attaches a PuzzleReview with rating and text and records PuzzleReviewed
statusReason: expected undefined to be 4 // Object.is equality

[Killed] BlockStatement
src/solving/domain/completion.ts:113:34
     return this.state.review;
   }
 
-  get photos(): readonly Photo[] {
-    return this.state.photos;
-  }
+  get photos(): readonly Photo[] {}
 
   // Begin an in-progress solve. No end/duration yet; records CompletionStarted.
killedBy: Completion.start starts an in-progress completion and records CompletionStarted
statusReason: expected undefined to deeply equal []

[Killed] LogicalOperator
src/solving/domain/completion.ts:119:20
 
   // Begin an in-progress solve. No end/duration yet; records CompletionStarted.
   static start(props: StartCompletionProps): Result<Completion, SolvingError> {
-    const photos = props.photos ?? [];
+    const photos = props.photos && [];
     if (photos.length > MAX_PHOTOS) {
       return err(SolvingError.tooManyPhotos(MAX_PHOTOS));
killedBy: Completion.start starts an in-progress completion and records CompletionStarted
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ArrayDeclaration
src/solving/domain/completion.ts:119:36
 
   // Begin an in-progress solve. No end/duration yet; records CompletionStarted.
   static start(props: StartCompletionProps): Result<Completion, SolvingError> {
-    const photos = props.photos ?? [];
+    const photos = props.photos ?? ["Stryker was here"];
     if (photos.length > MAX_PHOTOS) {
       return err(SolvingError.tooManyPhotos(MAX_PHOTOS));
killedBy: Completion.start starts an in-progress completion and records CompletionStarted
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] ConditionalExpression
src/solving/domain/completion.ts:120:9
   // Begin an in-progress solve. No end/duration yet; records CompletionStarted.
   static start(props: StartCompletionProps): Result<Completion, SolvingError> {
     const photos = props.photos ?? [];
-    if (photos.length > MAX_PHOTOS) {
+    if (false) {
       return err(SolvingError.tooManyPhotos(MAX_PHOTOS));
     }
killedBy: Completion use cases startCompletion propagates the photo-cap error
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/solving/domain/completion.ts:120:9
   // Begin an in-progress solve. No end/duration yet; records CompletionStarted.
   static start(props: StartCompletionProps): Result<Completion, SolvingError> {
     const photos = props.photos ?? [];
-    if (photos.length > MAX_PHOTOS) {
+    if (true) {
       return err(SolvingError.tooManyPhotos(MAX_PHOTOS));
     }
killedBy: Completion.start starts an in-progress completion and records CompletionStarted
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/solving/domain/completion.ts:133:20
       notes: props.notes,
       photos,
       allPiecesPresent: props.allPiecesPresent,
-      isCompleted: false,
+      isCompleted: true,
       createdAt: props.now,
       updatedAt: props.now,
killedBy: Completion.start starts an in-progress completion and records CompletionStarted
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/solving/domain/completion.ts:156:9
   static record(
     props: RecordCompletionProps,
   ): Result<Completion, SolvingError> {
-    if (props.endDate.getTime() < props.startDate.getTime()) {
+    if (true) {
       return err(SolvingError.invalidTimeRange());
     }
killedBy: Completion use cases recordCompletion persists a finished completion and publishes CompletionRecorded
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/solving/domain/completion.ts:156:9
   static record(
     props: RecordCompletionProps,
   ): Result<Completion, SolvingError> {
-    if (props.endDate.getTime() < props.startDate.getTime()) {
+    if (props.endDate.getTime() >= props.startDate.getTime()) {
       return err(SolvingError.invalidTimeRange());
     }
killedBy: Completion.record records a finished completion and derives the duration
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/solving/domain/completion.ts:159:20
     if (props.endDate.getTime() < props.startDate.getTime()) {
       return err(SolvingError.invalidTimeRange());
     }
-    const photos = props.photos ?? [];
+    const photos = props.photos && [];
     if (photos.length > MAX_PHOTOS) {
       return err(SolvingError.tooManyPhotos(MAX_PHOTOS));
killedBy: Completion.record records a finished completion and derives the duration
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ArrayDeclaration
src/solving/domain/completion.ts:159:36
     if (props.endDate.getTime() < props.startDate.getTime()) {
       return err(SolvingError.invalidTimeRange());
     }
-    const photos = props.photos ?? [];
+    const photos = props.photos ?? ["Stryker was here"];
     if (photos.length > MAX_PHOTOS) {
       return err(SolvingError.tooManyPhotos(MAX_PHOTOS));
killedBy: Completion.record records a finished completion and derives the duration
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] EqualityOperator
src/solving/domain/completion.ts:160:9
       return err(SolvingError.invalidTimeRange());
     }
     const photos = props.photos ?? [];
-    if (photos.length > MAX_PHOTOS) {
+    if (photos.length >= MAX_PHOTOS) {
       return err(SolvingError.tooManyPhotos(MAX_PHOTOS));
     }
killedBy: Completion.record allows exactly five photos
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/solving/domain/completion.ts:160:9
       return err(SolvingError.invalidTimeRange());
     }
     const photos = props.photos ?? [];
-    if (photos.length > MAX_PHOTOS) {
+    if (photos.length <= MAX_PHOTOS) {
       return err(SolvingError.tooManyPhotos(MAX_PHOTOS));
     }
killedBy: Completion.record records a finished completion and derives the duration
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/solving/domain/completion.ts:169:9
       props.endDate,
       props.completionTimeMinutes,
     );
-    if (duration.isErr) return err(duration.error);
+    if (false) return err(duration.error);
 
     const completion = new Completion({
killedBy: Completion.record rejects an explicit negative completionTimeMinutes with InvalidDuration
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/solving/domain/completion.ts:169:9
       props.endDate,
       props.completionTimeMinutes,
     );
-    if (duration.isErr) return err(duration.error);
+    if (true) return err(duration.error);
 
     const completion = new Completion({
killedBy: Completion.record records a finished completion and derives the duration
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/solving/domain/completion.ts:171:39
     );
     if (duration.isErr) return err(duration.error);
 
-    const completion = new Completion({
-      id: props.id,
-      userId: props.userId,
-      puzzleDefinitionId: props.puzzleDefinitionId,
-      copyId: props.copyId,
-      startDate: props.startDate,
-      endDate: props.endDate,
-      completionTimeMinutes: duration.value,
-      notes: props.notes,
-      photos,
-      review: props.review,
-      allPiecesPresent: props.allPiecesPresent,
-      isCompleted: true,
-      createdAt: props.now,
-      updatedAt: props.now,
-    });
+    const completion = new Completion({});
     completion.record(
       new CompletionRecorded(
killedBy: Completion.record records a finished completion and derives the duration
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
src/solving/domain/completion.ts:183:20
       photos,
       review: props.review,
       allPiecesPresent: props.allPiecesPresent,
-      isCompleted: true,
+      isCompleted: false,
       createdAt: props.now,
       updatedAt: props.now,
killedBy: Completion.record records a finished completion and derives the duration
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/solving/domain/completion.ts:199:23
         props.now,
       ),
     );
-    if (props.review) {
-      completion.record(
-        new PuzzleReviewed(
-          props.id,
-          props.userId,
-          props.puzzleDefinitionId,
-          props.review.rating.value,
-          props.now,
-        ),
-      );
-    }
+    if (props.review) {}
     return ok(completion);
   }
killedBy: Completion.record records PuzzleReviewed when a review is supplied
statusReason: expected [ 'CompletionRecorded' ] to deeply equal [ 'CompletionRecorded', …(1) ]

[Killed] ConditionalExpression
src/solving/domain/completion.ts:199:9
         props.now,
       ),
     );
-    if (props.review) {
+    if (false) {
       completion.record(
         new PuzzleReviewed(
killedBy: Completion.record records PuzzleReviewed when a review is supplied
statusReason: expected [ 'CompletionRecorded' ] to deeply equal [ 'CompletionRecorded', …(1) ]

[Killed] ConditionalExpression
src/solving/domain/completion.ts:221:9
     completionTimeMinutes?: number,
     allPiecesPresent?: boolean,
   ): Result<void, SolvingError> {
-    if (this.state.isCompleted) return ok(undefined);
+    if (false) return ok(undefined);
     if (endDate.getTime() < this.state.startDate.getTime()) {
       return err(SolvingError.invalidTimeRange());
killedBy: Completion.finish is a no-op when already completed (no double CompletionRecorded)
statusReason: expected [ 'CompletionRecorded' ] to deeply equal []

[Killed] ConditionalExpression
src/solving/domain/completion.ts:221:9
     completionTimeMinutes?: number,
     allPiecesPresent?: boolean,
   ): Result<void, SolvingError> {
-    if (this.state.isCompleted) return ok(undefined);
+    if (true) return ok(undefined);
     if (endDate.getTime() < this.state.startDate.getTime()) {
       return err(SolvingError.invalidTimeRange());
killedBy: Completion.finish finishes an in-progress completion and records CompletionRecorded
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/solving/domain/completion.ts:222:9
     allPiecesPresent?: boolean,
   ): Result<void, SolvingError> {
     if (this.state.isCompleted) return ok(undefined);
-    if (endDate.getTime() < this.state.startDate.getTime()) {
+    if (endDate.getTime() >= this.state.startDate.getTime()) {
       return err(SolvingError.invalidTimeRange());
     }
killedBy: Completion.finish finishes an in-progress completion and records CompletionRecorded
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/solving/domain/completion.ts:222:61
     allPiecesPresent?: boolean,
   ): Result<void, SolvingError> {
     if (this.state.isCompleted) return ok(undefined);
-    if (endDate.getTime() < this.state.startDate.getTime()) {
-      return err(SolvingError.invalidTimeRange());
-    }
+    if (endDate.getTime() < this.state.startDate.getTime()) {}
     const duration = Completion.resolveDuration(
       this.state.startDate,
killedBy: Completion.finish rejects an end before start
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/solving/domain/completion.ts:232:18
     );
     if (duration.isErr) return err(duration.error);
 
-    this.state = {
-      ...this.state,
-      endDate,
-      completionTimeMinutes: duration.value,
-      allPiecesPresent: allPiecesPresent ?? this.state.allPiecesPresent,
-      isCompleted: true,
-      updatedAt: now,
-    };
+    this.state = {};
     this.record(
       new CompletionRecorded(
killedBy: Completion.finish finishes an in-progress completion and records CompletionRecorded
statusReason: expected undefined to be true // Object.is equality

[Killed] LogicalOperator
src/solving/domain/completion.ts:236:25
       ...this.state,
       endDate,
       completionTimeMinutes: duration.value,
-      allPiecesPresent: allPiecesPresent ?? this.state.allPiecesPresent,
+      allPiecesPresent: allPiecesPresent && this.state.allPiecesPresent,
       isCompleted: true,
       updatedAt: now,
killedBy: Completion.allPiecesPresent finish() sets allPiecesPresent when provided and leaves it otherwise
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
src/solving/domain/completion.ts:237:20
       endDate,
       completionTimeMinutes: duration.value,
       allPiecesPresent: allPiecesPresent ?? this.state.allPiecesPresent,
-      isCompleted: true,
+      isCompleted: false,
       updatedAt: now,
     };
killedBy: Completion.finish finishes an in-progress completion and records CompletionRecorded
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/solving/domain/completion.ts:263:9
     changes: CompletionChanges,
     now: Date,
   ): Result<void, SolvingError> {
-    if (actingMemberId !== this.state.userId) {
+    if (false) {
       return err(SolvingError.notCompletionOwner());
     }
killedBy: Completion.edit rejects an edit by a non-owner with NotCompletionOwner
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/solving/domain/completion.ts:263:9
     changes: CompletionChanges,
     now: Date,
   ): Result<void, SolvingError> {
-    if (actingMemberId !== this.state.userId) {
+    if (actingMemberId === this.state.userId) {
       return err(SolvingError.notCompletionOwner());
     }
killedBy: Completion.edit rejects an edit by a non-owner with NotCompletionOwner
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/solving/domain/completion.ts:268:33
     }
     // The edit window is anchored on the recorded completion. An in-progress completion has no
     // completion instant yet, so it is always editable.
-    if (this.state.isCompleted) {
-      const reference = this.state.endDate ?? this.state.updatedAt;
-      if (now.getTime() - reference.getTime() > EDIT_WINDOW_MS) {
-        return err(SolvingError.editWindowClosed());
-      }
-    }
+    if (this.state.isCompleted) {}
 
     const nextStart = changes.startDate ?? this.state.startDate;
killedBy: Completion.edit rejects an edit after the 24h window with EditWindowClosed
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/solving/domain/completion.ts:268:9
     }
     // The edit window is anchored on the recorded completion. An in-progress completion has no
     // completion instant yet, so it is always editable.
-    if (this.state.isCompleted) {
+    if (false) {
       const reference = this.state.endDate ?? this.state.updatedAt;
       if (now.getTime() - reference.getTime() > EDIT_WINDOW_MS) {
killedBy: Completion.edit rejects an edit after the 24h window with EditWindowClosed
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/solving/domain/completion.ts:269:25
     // The edit window is anchored on the recorded completion. An in-progress completion has no
     // completion instant yet, so it is always editable.
     if (this.state.isCompleted) {
-      const reference = this.state.endDate ?? this.state.updatedAt;
+      const reference = this.state.endDate && this.state.updatedAt;
       if (now.getTime() - reference.getTime() > EDIT_WINDOW_MS) {
         return err(SolvingError.editWindowClosed());
killedBy: Completion.edit anchors the edit window on the completion's end, not its updatedAt
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/solving/domain/completion.ts:270:65
     // completion instant yet, so it is always editable.
     if (this.state.isCompleted) {
       const reference = this.state.endDate ?? this.state.updatedAt;
-      if (now.getTime() - reference.getTime() > EDIT_WINDOW_MS) {
-        return err(SolvingError.editWindowClosed());
-      }
+      if (now.getTime() - reference.getTime() > EDIT_WINDOW_MS) {}
     }
 
killedBy: Completion.edit rejects an edit after the 24h window with EditWindowClosed
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/solving/domain/completion.ts:270:11
     // completion instant yet, so it is always editable.
     if (this.state.isCompleted) {
       const reference = this.state.endDate ?? this.state.updatedAt;
-      if (now.getTime() - reference.getTime() > EDIT_WINDOW_MS) {
+      if (false) {
         return err(SolvingError.editWindowClosed());
       }
killedBy: Completion.edit rejects an edit after the 24h window with EditWindowClosed
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/solving/domain/completion.ts:275:23
       }
     }
 
-    const nextStart = changes.startDate ?? this.state.startDate;
+    const nextStart = changes.startDate && this.state.startDate;
     const nextEnd =
       changes.endDate !== undefined ? changes.endDate : this.state.endDate;
killedBy: Completion.edit allows an edit within the 24h window
statusReason: Cannot read properties of undefined (reading 'getTime')

[Killed] EqualityOperator
src/solving/domain/completion.ts:277:7
 
     const nextStart = changes.startDate ?? this.state.startDate;
     const nextEnd =
-      changes.endDate !== undefined ? changes.endDate : this.state.endDate;
+      changes.endDate === undefined ? changes.endDate : this.state.endDate;
     if (nextEnd && nextEnd.getTime() < nextStart.getTime()) {
       return err(SolvingError.invalidTimeRange());
killedBy: Completion.edit rejects an edit that makes end precede start
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/solving/domain/completion.ts:277:7
 
     const nextStart = changes.startDate ?? this.state.startDate;
     const nextEnd =
-      changes.endDate !== undefined ? changes.endDate : this.state.endDate;
+      false ? changes.endDate : this.state.endDate;
     if (nextEnd && nextEnd.getTime() < nextStart.getTime()) {
       return err(SolvingError.invalidTimeRange());
killedBy: Completion.edit rejects an edit that makes end precede start
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/solving/domain/completion.ts:278:20
     const nextStart = changes.startDate ?? this.state.startDate;
     const nextEnd =
       changes.endDate !== undefined ? changes.endDate : this.state.endDate;
-    if (nextEnd && nextEnd.getTime() < nextStart.getTime()) {
+    if (nextEnd && nextEnd.getTime() >= nextStart.getTime()) {
       return err(SolvingError.invalidTimeRange());
     }
killedBy: Completion.edit allows an edit within the 24h window
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/solving/domain/completion.ts:278:9
     const nextStart = changes.startDate ?? this.state.startDate;
     const nextEnd =
       changes.endDate !== undefined ? changes.endDate : this.state.endDate;
-    if (nextEnd && nextEnd.getTime() < nextStart.getTime()) {
+    if (false) {
       return err(SolvingError.invalidTimeRange());
     }
killedBy: Completion.edit rejects an edit that makes end precede start
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/solving/domain/completion.ts:282:24
       return err(SolvingError.invalidTimeRange());
     }
 
-    const nextPhotos = changes.photos ?? this.state.photos;
+    const nextPhotos = changes.photos && this.state.photos;
     if (nextPhotos.length > MAX_PHOTOS) {
       return err(SolvingError.tooManyPhotos(MAX_PHOTOS));
killedBy: Completion.edit allows an edit within the 24h window
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/solving/domain/completion.ts:283:41
     }
 
     const nextPhotos = changes.photos ?? this.state.photos;
-    if (nextPhotos.length > MAX_PHOTOS) {
-      return err(SolvingError.tooManyPhotos(MAX_PHOTOS));
-    }
+    if (nextPhotos.length > MAX_PHOTOS) {}
 
     let nextDuration = this.state.completionTimeMinutes;
killedBy: Completion.edit rejects an edit that pushes photos over five
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/solving/domain/completion.ts:283:9
     }
 
     const nextPhotos = changes.photos ?? this.state.photos;
-    if (nextPhotos.length > MAX_PHOTOS) {
+    if (nextPhotos.length <= MAX_PHOTOS) {
       return err(SolvingError.tooManyPhotos(MAX_PHOTOS));
     }
killedBy: Completion.edit allows an edit within the 24h window
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/solving/domain/completion.ts:289:7
 
     let nextDuration = this.state.completionTimeMinutes;
     if (
-      changes.completionTimeMinutes !== undefined ||
-      changes.startDate !== undefined ||
+      changes.completionTimeMinutes !== undefined && changes.startDate !== undefined ||
       changes.endDate !== undefined
     ) {
killedBy: Completion.edit recomputes duration when only the explicit minutes change
statusReason: expected 90 to be 20 // Object.is equality

[Killed] LogicalOperator
src/solving/domain/completion.ts:289:7
 
     let nextDuration = this.state.completionTimeMinutes;
     if (
-      changes.completionTimeMinutes !== undefined ||
-      changes.startDate !== undefined ||
-      changes.endDate !== undefined
+      (changes.completionTimeMinutes !== undefined || changes.startDate !== undefined) && changes.endDate !== undefined
     ) {
       if (nextEnd) {
killedBy: Completion.edit recomputes duration when the dates change
statusReason: expected 90 to be 30 // Object.is equality

[Killed] EqualityOperator
src/solving/domain/completion.ts:290:7
     let nextDuration = this.state.completionTimeMinutes;
     if (
       changes.completionTimeMinutes !== undefined ||
-      changes.startDate !== undefined ||
+      changes.startDate === undefined ||
       changes.endDate !== undefined
     ) {
killedBy: Completion.edit leaves the end and duration untouched when neither is edited
statusReason: expected 90 to be 45 // Object.is equality

[Killed] ConditionalExpression
src/solving/domain/completion.ts:290:7
     let nextDuration = this.state.completionTimeMinutes;
     if (
       changes.completionTimeMinutes !== undefined ||
-      changes.startDate !== undefined ||
+      false ||
       changes.endDate !== undefined
     ) {
killedBy: Completion.edit recomputes duration when only the start date changes
statusReason: expected 90 to be 60 // Object.is equality

[Killed] EqualityOperator
src/solving/domain/completion.ts:291:7
     if (
       changes.completionTimeMinutes !== undefined ||
       changes.startDate !== undefined ||
-      changes.endDate !== undefined
+      changes.endDate === undefined
     ) {
       if (nextEnd) {
killedBy: Completion.edit recomputes duration when the dates change
statusReason: expected 90 to be 30 // Object.is equality

[Killed] ConditionalExpression
src/solving/domain/completion.ts:291:7
     if (
       changes.completionTimeMinutes !== undefined ||
       changes.startDate !== undefined ||
-      changes.endDate !== undefined
+      false
     ) {
       if (nextEnd) {
killedBy: Completion.edit recomputes duration when the dates change
statusReason: expected 90 to be 30 // Object.is equality

[Killed] BlockStatement
src/solving/domain/completion.ts:292:7
       changes.completionTimeMinutes !== undefined ||
       changes.startDate !== undefined ||
       changes.endDate !== undefined
-    ) {
-      if (nextEnd) {
-        const duration = Completion.resolveDuration(
-          nextStart,
-          nextEnd,
-          changes.completionTimeMinutes,
-        );
-        if (duration.isErr) return err(duration.error);
-        nextDuration = duration.value;
-      } else if (changes.completionTimeMinutes !== undefined) {
-        const duration = SolveDuration.ofMinutes(changes.completionTimeMinutes);
-        if (duration.isErr) return err(duration.error);
-        nextDuration = duration.value.minutes;
-      }
-    }
+    ) {}
 
     this.state = {
killedBy: Completion.edit recomputes duration when the dates change
statusReason: expected 90 to be 30 // Object.is equality

[Killed] ConditionalExpression
src/solving/domain/completion.ts:293:11
       changes.startDate !== undefined ||
       changes.endDate !== undefined
     ) {
-      if (nextEnd) {
+      if (true) {
         const duration = Completion.resolveDuration(
           nextStart,
killedBy: Completion.edit editing an in-progress completion moves the start date without deriving a duration from a missing end
statusReason: Cannot read properties of undefined (reading 'getTime')

[Killed] BlockStatement
src/solving/domain/completion.ts:293:20
       changes.startDate !== undefined ||
       changes.endDate !== undefined
     ) {
-      if (nextEnd) {
-        const duration = Completion.resolveDuration(
-          nextStart,
-          nextEnd,
-          changes.completionTimeMinutes,
-        );
-        if (duration.isErr) return err(duration.error);
-        nextDuration = duration.value;
-      } else if (changes.completionTimeMinutes !== undefined) {
+      if (nextEnd) {} else if (changes.completionTimeMinutes !== undefined) {
         const duration = SolveDuration.ofMinutes(changes.completionTimeMinutes);
         if (duration.isErr) return err(duration.error);
killedBy: Completion.edit recomputes duration when the dates change
statusReason: expected 90 to be 30 // Object.is equality

[Killed] ConditionalExpression
src/solving/domain/completion.ts:301:18
         );
         if (duration.isErr) return err(duration.error);
         nextDuration = duration.value;
-      } else if (changes.completionTimeMinutes !== undefined) {
+      } else if (true) {
         const duration = SolveDuration.ofMinutes(changes.completionTimeMinutes);
         if (duration.isErr) return err(duration.error);
killedBy: Completion.edit editing an in-progress completion moves the start date without deriving a duration from a missing end
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/solving/domain/completion.ts:301:18
         );
         if (duration.isErr) return err(duration.error);
         nextDuration = duration.value;
-      } else if (changes.completionTimeMinutes !== undefined) {
+      } else if (false) {
         const duration = SolveDuration.ofMinutes(changes.completionTimeMinutes);
         if (duration.isErr) return err(duration.error);
killedBy: Completion.edit editing an in-progress completion sets the duration directly from explicit minutes (no end yet)
statusReason: expected undefined to be 30 // Object.is equality

[Killed] ConditionalExpression
src/solving/domain/completion.ts:303:13
         nextDuration = duration.value;
       } else if (changes.completionTimeMinutes !== undefined) {
         const duration = SolveDuration.ofMinutes(changes.completionTimeMinutes);
-        if (duration.isErr) return err(duration.error);
+        if (true) return err(duration.error);
         nextDuration = duration.value.minutes;
       }
killedBy: Completion.edit editing an in-progress completion sets the duration directly from explicit minutes (no end yet)
statusReason: expected false to be true // Object.is equality
