[Killed] ConditionalExpression
src/solving/domain/completion.ts:303:13
         nextDuration = duration.value;
       } else if (changes.completionTimeMinutes !== undefined) {
         const duration = SolveDuration.ofMinutes(changes.completionTimeMinutes);
-        if (duration.isErr) return err(duration.error);
+        if (false) return err(duration.error);
         nextDuration = duration.value.minutes;
       }
killedBy: Completion.edit editing an in-progress completion rejects invalid explicit minutes (no end yet)
statusReason: Cannot read properties of undefined (reading 'minutes')

[Killed] LogicalOperator
src/solving/domain/completion.ts:310:14
 
     this.state = {
       ...this.state,
-      notes: changes.notes ?? this.state.notes,
+      notes: changes.notes && this.state.notes,
       photos: nextPhotos,
       startDate: nextStart,
killedBy: Completion.edit allows an edit within the 24h window
statusReason: expected undefined to be 'tweaked' // Object.is equality

[Killed] BlockStatement
src/solving/domain/completion.ts:328:33
     actingMemberId: MemberId,
     photos: readonly Photo[],
     now: Date,
-  ): Result<void, SolvingError> {
-    if (actingMemberId !== this.state.userId) {
-      return err(SolvingError.notCompletionOwner());
-    }
-    const combined = [...this.state.photos, ...photos];
-    if (combined.length > MAX_PHOTOS) {
-      return err(SolvingError.tooManyPhotos(MAX_PHOTOS));
-    }
-    this.state = { ...this.state, photos: combined, updatedAt: now };
-    // Reuse CompletionEdited (verified consumer-safe: no feed/notification/goal reactions);
-    // recorded exactly the way edit() records it (see edit()).
-    this.record(new CompletionEdited(this.state.id, now));
-    return ok(undefined);
-  }
+  ): Result<void, SolvingError> {}
 
   // Attach a PuzzleReview (opinion of the puzzle). Records PuzzleReviewed. Re-reviewing replaces
killedBy: Completion.attachPhotos appends photos to the existing set and bumps updatedAt
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] BlockStatement
src/solving/domain/completion.ts:329:47
     photos: readonly Photo[],
     now: Date,
   ): Result<void, SolvingError> {
-    if (actingMemberId !== this.state.userId) {
-      return err(SolvingError.notCompletionOwner());
-    }
+    if (actingMemberId !== this.state.userId) {}
     const combined = [...this.state.photos, ...photos];
     if (combined.length > MAX_PHOTOS) {
killedBy: Completion.attachPhotos rejects a non-owner with NotCompletionOwner
statusReason: expected false to be true // Object.is equality

[Killed] ArrayDeclaration
src/solving/domain/completion.ts:332:22
     if (actingMemberId !== this.state.userId) {
       return err(SolvingError.notCompletionOwner());
     }
-    const combined = [...this.state.photos, ...photos];
+    const combined = [];
     if (combined.length > MAX_PHOTOS) {
       return err(SolvingError.tooManyPhotos(MAX_PHOTOS));
killedBy: Completion.attachPhotos appends photos to the existing set and bumps updatedAt
statusReason: expected [] to have a length of 3 but got +0

[Killed] BlockStatement
src/solving/domain/completion.ts:333:39
       return err(SolvingError.notCompletionOwner());
     }
     const combined = [...this.state.photos, ...photos];
-    if (combined.length > MAX_PHOTOS) {
-      return err(SolvingError.tooManyPhotos(MAX_PHOTOS));
-    }
+    if (combined.length > MAX_PHOTOS) {}
     this.state = { ...this.state, photos: combined, updatedAt: now };
     // Reuse CompletionEdited (verified consumer-safe: no feed/notification/goal reactions);
killedBy: Completion.attachPhotos rejects when existing plus new photos exceed five with TooManyPhotos
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/solving/domain/completion.ts:333:9
       return err(SolvingError.notCompletionOwner());
     }
     const combined = [...this.state.photos, ...photos];
-    if (combined.length > MAX_PHOTOS) {
+    if (combined.length <= MAX_PHOTOS) {
       return err(SolvingError.tooManyPhotos(MAX_PHOTOS));
     }
killedBy: Completion.attachPhotos appends photos to the existing set and bumps updatedAt
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/solving/domain/completion.ts:349:33
     rating: StarRating,
     now: Date,
     text?: string,
-  ): Result<void, SolvingError> {
-    const puzzleReview = PuzzleReview.create(rating, text);
-    this.state = { ...this.state, review: puzzleReview, updatedAt: now };
-    this.record(
-      new PuzzleReviewed(
-        this.state.id,
-        this.state.userId,
-        this.state.puzzleDefinitionId,
-        rating.value,
-        now,
-      ),
-    );
-    return ok(undefined);
-  }
+  ): Result<void, SolvingError> {}
 
   // Drain recorded events for the publisher; clears the buffer so a save can't double-emit.
killedBy: Completion.review attaches a PuzzleReview with rating and text and records PuzzleReviewed
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] BlockStatement
src/solving/domain/completion.ts:372:56
   }
 
   // Map to/from persistence without the aggregate knowing about any storage technology.
-  static rehydrate(state: CompletionState): Completion {
-    return new Completion(state);
-  }
+  static rehydrate(state: CompletionState): Completion {}
 
   toState(): CompletionState {
killedBy: Completion use cases startCompletion maps photo file ids onto the started completion
statusReason: expected undefined to deeply equal [ 'p-1', 'p-2' ]

[Killed] BlockStatement
src/solving/domain/completion.ts:376:30
     return new Completion(state);
   }
 
-  toState(): CompletionState {
-    return this.state;
-  }
+  toState(): CompletionState {}
 
   // --- internals ---
killedBy: Completion.record records a finished completion and derives the duration
statusReason: Cannot read properties of undefined (reading 'completionTimeMinutes')

[Killed] BlockStatement
src/solving/domain/completion.ts:390:47
     start: Date,
     end: Date,
     minutes?: number,
-  ): Result<number | undefined, SolvingError> {
-    if (minutes !== undefined) {
-      const duration = SolveDuration.ofMinutes(minutes);
-      if (duration.isErr) return err(duration.error);
-      return ok(duration.value.minutes);
-    }
-    if (end.getTime() > start.getTime()) {
-      const duration = SolveDuration.between(start, end);
-      if (duration.isErr) return err(duration.error);
-      return ok(duration.value.minutes);
-    }
-    // start == end: date-only same-day completions count as one day (product decision,
-    // spec 2026-07-14 Fix 4).
-    return ok(MINUTES_PER_DAY);
-  }
+  ): Result<number | undefined, SolvingError> {}
 
   private record(event: DomainEvent): void {
killedBy: Goal use cases recomputeGoalProgress (derived from completions) derives current progress from the completion count and publishes GoalProgressed
statusReason: Cannot read properties of undefined (reading 'isErr')

[Killed] ConditionalExpression
src/solving/domain/completion.ts:391:9
     end: Date,
     minutes?: number,
   ): Result<number | undefined, SolvingError> {
-    if (minutes !== undefined) {
+    if (false) {
       const duration = SolveDuration.ofMinutes(minutes);
       if (duration.isErr) return err(duration.error);
killedBy: Completion.record allows equal start/end with an explicit positive time and stores that time
statusReason: expected 1440 to be 45 // Object.is equality

[Killed] BlockStatement
src/solving/domain/completion.ts:391:32
     end: Date,
     minutes?: number,
   ): Result<number | undefined, SolvingError> {
-    if (minutes !== undefined) {
-      const duration = SolveDuration.ofMinutes(minutes);
-      if (duration.isErr) return err(duration.error);
-      return ok(duration.value.minutes);
-    }
+    if (minutes !== undefined) {}
     if (end.getTime() > start.getTime()) {
       const duration = SolveDuration.between(start, end);
killedBy: Completion.record allows equal start/end with an explicit positive time and stores that time
statusReason: expected 1440 to be 45 // Object.is equality

[Killed] ConditionalExpression
src/solving/domain/completion.ts:393:11
   ): Result<number | undefined, SolvingError> {
     if (minutes !== undefined) {
       const duration = SolveDuration.ofMinutes(minutes);
-      if (duration.isErr) return err(duration.error);
+      if (false) return err(duration.error);
       return ok(duration.value.minutes);
     }
killedBy: Completion.record rejects an explicit negative completionTimeMinutes with InvalidDuration
statusReason: Cannot read properties of undefined (reading 'minutes')

[Killed] ConditionalExpression
src/solving/domain/completion.ts:393:11
   ): Result<number | undefined, SolvingError> {
     if (minutes !== undefined) {
       const duration = SolveDuration.ofMinutes(minutes);
-      if (duration.isErr) return err(duration.error);
+      if (true) return err(duration.error);
       return ok(duration.value.minutes);
     }
killedBy: Completion.record allows equal start/end with an explicit positive time and stores that time
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/solving/domain/completion.ts:396:9
       if (duration.isErr) return err(duration.error);
       return ok(duration.value.minutes);
     }
-    if (end.getTime() > start.getTime()) {
+    if (true) {
       const duration = SolveDuration.between(start, end);
       if (duration.isErr) return err(duration.error);
killedBy: Completion.record allows equal start/end (same-day) and counts one day (1440 minutes)
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/solving/domain/completion.ts:396:42
       if (duration.isErr) return err(duration.error);
       return ok(duration.value.minutes);
     }
-    if (end.getTime() > start.getTime()) {
-      const duration = SolveDuration.between(start, end);
-      if (duration.isErr) return err(duration.error);
-      return ok(duration.value.minutes);
-    }
+    if (end.getTime() > start.getTime()) {}
     // start == end: date-only same-day completions count as one day (product decision,
     // spec 2026-07-14 Fix 4).
killedBy: Completion.record records a finished completion and derives the duration
statusReason: expected 1440 to be 90 // Object.is equality

[Killed] ConditionalExpression
src/solving/domain/completion.ts:398:11
     }
     if (end.getTime() > start.getTime()) {
       const duration = SolveDuration.between(start, end);
-      if (duration.isErr) return err(duration.error);
+      if (false) return err(duration.error);
       return ok(duration.value.minutes);
     }
killedBy: Completion.record rejects a derived sub-30-second span with InvalidDuration
statusReason: Cannot read properties of undefined (reading 'minutes')

[Killed] ConditionalExpression
src/solving/domain/completion.ts:398:11
     }
     if (end.getTime() > start.getTime()) {
       const duration = SolveDuration.between(start, end);
-      if (duration.isErr) return err(duration.error);
+      if (true) return err(duration.error);
       return ok(duration.value.minutes);
     }
killedBy: Completion.record records a finished completion and derives the duration
statusReason: expected false to be true // Object.is equality
