[Killed] BlockStatement
src/solving/domain/goal.ts:45:20
 
   private constructor(private state: GoalState) {}
 
-  get id(): GoalId {
-    return this.state.id;
-  }
+  get id(): GoalId {}
 
   get userId(): MemberId {
killedBy: Goal use cases recomputeGoalProgress (derived from completions) skips inactive goals (no progress derived for them)
statusReason: expected undefined to be +0 // Object.is equality

[Killed] BlockStatement
src/solving/domain/goal.ts:53:36
     return this.state.userId;
   }
 
-  get currentCompletions(): number {
-    return this.state.currentCompletions;
-  }
+  get currentCompletions(): number {}
 
   get targetCompletions(): number {
killedBy: Goal use cases recomputeGoalProgress (derived from completions) derives current progress from the completion count and publishes GoalProgressed
statusReason: expected undefined to be 1 // Object.is equality

[Killed] BlockStatement
src/solving/domain/goal.ts:57:35
     return this.state.currentCompletions;
   }
 
-  get targetCompletions(): number {
-    return this.state.targetCompletions;
-  }
+  get targetCompletions(): number {}
 
   // True once progress reaches the target — a computed property, never a stored flag.
killedBy: Goal.create creates an active goal at zero progress and records GoalCreated
statusReason: expected undefined to be 3 // Object.is equality

[Killed] BlockStatement
src/solving/domain/goal.ts:62:29
   }
 
   // True once progress reaches the target — a computed property, never a stored flag.
-  get isAchieved(): boolean {
-    return this.state.currentCompletions >= this.state.targetCompletions;
-  }
+  get isAchieved(): boolean {}
 
   get isActive(): boolean {
killedBy: Goal use cases recomputeGoalProgress (derived from completions) derives current progress from the completion count and publishes GoalProgressed
statusReason: expected undefined to be false // Object.is equality

[Killed] EqualityOperator
src/solving/domain/goal.ts:63:12
 
   // True once progress reaches the target — a computed property, never a stored flag.
   get isAchieved(): boolean {
-    return this.state.currentCompletions >= this.state.targetCompletions;
+    return this.state.currentCompletions < this.state.targetCompletions;
   }
 
killedBy: Goal use cases recomputeGoalProgress (derived from completions) derives current progress from the completion count and publishes GoalProgressed
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/solving/domain/goal.ts:63:12
 
   // True once progress reaches the target — a computed property, never a stored flag.
   get isAchieved(): boolean {
-    return this.state.currentCompletions >= this.state.targetCompletions;
+    return true;
   }
 
killedBy: Goal use cases recomputeGoalProgress (derived from completions) derives current progress from the completion count and publishes GoalProgressed
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/solving/domain/goal.ts:72:7
 
   static create(props: CreateGoalProps): Result<Goal, SolvingError> {
     if (
-      !Number.isInteger(props.targetCompletions) ||
-      props.targetCompletions <= 0
+      !Number.isInteger(props.targetCompletions) && props.targetCompletions <= 0
     ) {
       return err(SolvingError.invalidGoalTarget());
killedBy: Goal.create rejects target %p with InvalidGoalTarget
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/solving/domain/goal.ts:72:7
 
   static create(props: CreateGoalProps): Result<Goal, SolvingError> {
     if (
-      !Number.isInteger(props.targetCompletions) ||
-      props.targetCompletions <= 0
+      false
     ) {
       return err(SolvingError.invalidGoalTarget());
killedBy: Goal.create rejects target %p with InvalidGoalTarget
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/solving/domain/goal.ts:73:7
   static create(props: CreateGoalProps): Result<Goal, SolvingError> {
     if (
       !Number.isInteger(props.targetCompletions) ||
-      props.targetCompletions <= 0
+      props.targetCompletions < 0
     ) {
       return err(SolvingError.invalidGoalTarget());
killedBy: Goal.create rejects target %p with InvalidGoalTarget
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/solving/domain/goal.ts:73:7
   static create(props: CreateGoalProps): Result<Goal, SolvingError> {
     if (
       !Number.isInteger(props.targetCompletions) ||
-      props.targetCompletions <= 0
+      false
     ) {
       return err(SolvingError.invalidGoalTarget());
killedBy: Goal.create rejects target %p with InvalidGoalTarget
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/solving/domain/goal.ts:74:7
     if (
       !Number.isInteger(props.targetCompletions) ||
       props.targetCompletions <= 0
-    ) {
-      return err(SolvingError.invalidGoalTarget());
-    }
+    ) {}
 
     const goal = new Goal({
killedBy: Goal use cases createGoal rejects a non-positive target with InvalidGoalTarget
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/solving/domain/goal.ts:86:17
       targetCompletions: props.targetCompletions,
       currentCompletions: 0,
       targetDate: props.targetDate,
-      isActive: true,
+      isActive: false,
       createdAt: props.now,
       updatedAt: props.now,
killedBy: Goal.create creates an active goal at zero progress and records GoalCreated
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/solving/domain/goal.ts:106:9
   // GoalAchieved exactly once — only on the transition that first crosses the target (so a later
   // recompute that stays at/above the target does NOT re-fire it).
   progressTo(count: number, now: Date): Result<void, SolvingError> {
-    if (!Number.isInteger(count) || count < 0) {
+    if (true) {
       return err(SolvingError.invalidGoalTarget());
     }
killedBy: Goal use cases recomputeGoalProgress (derived from completions) derives current progress from the completion count and publishes GoalProgressed
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/solving/domain/goal.ts:106:48
   // GoalAchieved exactly once — only on the transition that first crosses the target (so a later
   // recompute that stays at/above the target does NOT re-fire it).
   progressTo(count: number, now: Date): Result<void, SolvingError> {
-    if (!Number.isInteger(count) || count < 0) {
-      return err(SolvingError.invalidGoalTarget());
-    }
+    if (!Number.isInteger(count) || count < 0) {}
     const previous = this.state.currentCompletions;
     if (count === previous) return ok(undefined);
killedBy: Goal.progressTo rejects a negative count with InvalidGoalTarget
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/solving/domain/goal.ts:110:9
       return err(SolvingError.invalidGoalTarget());
     }
     const previous = this.state.currentCompletions;
-    if (count === previous) return ok(undefined);
+    if (false) return ok(undefined);
 
     const wasAchieved = previous >= this.state.targetCompletions;
killedBy: Goal.progressTo is a no-op (no event) when the count is unchanged
statusReason: expected [ 'GoalProgressed' ] to deeply equal []

[Killed] EqualityOperator
src/solving/domain/goal.ts:110:9
       return err(SolvingError.invalidGoalTarget());
     }
     const previous = this.state.currentCompletions;
-    if (count === previous) return ok(undefined);
+    if (count !== previous) return ok(undefined);
 
     const wasAchieved = previous >= this.state.targetCompletions;
killedBy: Goal.progressTo records GoalProgressed on a change below target
statusReason: expected +0 to be 2 // Object.is equality

[Killed] EqualityOperator
src/solving/domain/goal.ts:112:25
     const previous = this.state.currentCompletions;
     if (count === previous) return ok(undefined);
 
-    const wasAchieved = previous >= this.state.targetCompletions;
+    const wasAchieved = previous > this.state.targetCompletions;
     this.state = {
       ...this.state,
killedBy: Goal.progressTo does not re-fire GoalAchieved on a later progress past the target
statusReason: expected [ 'GoalProgressed', 'GoalAchieved' ] to deeply equal [ 'GoalProgressed' ]

[Killed] ConditionalExpression
src/solving/domain/goal.ts:112:25
     const previous = this.state.currentCompletions;
     if (count === previous) return ok(undefined);
 
-    const wasAchieved = previous >= this.state.targetCompletions;
+    const wasAchieved = true;
     this.state = {
       ...this.state,
killedBy: Goal use cases recomputeGoalProgress (derived from completions) fires GoalAchieved once when the count crosses the target
statusReason: expected [ 'GoalProgressed' ] to deeply equal [ 'GoalProgressed', 'GoalAchieved' ]

[Killed] ConditionalExpression
src/solving/domain/goal.ts:128:25
       ),
     );
 
-    const nowAchieved = count >= this.state.targetCompletions;
+    const nowAchieved = true;
     if (nowAchieved && !wasAchieved) {
       this.record(
killedBy: Goal use cases recomputeGoalProgress (derived from completions) derives current progress from the completion count and publishes GoalProgressed
statusReason: expected [ 'GoalProgressed', 'GoalAchieved' ] to deeply equal [ 'GoalProgressed' ]

[Killed] EqualityOperator
src/solving/domain/goal.ts:128:25
       ),
     );
 
-    const nowAchieved = count >= this.state.targetCompletions;
+    const nowAchieved = count < this.state.targetCompletions;
     if (nowAchieved && !wasAchieved) {
       this.record(
killedBy: Goal.progressTo records GoalProgressed on a change below target
statusReason: expected [ 'GoalProgressed', 'GoalAchieved' ] to deeply equal [ 'GoalProgressed' ]

[Killed] BooleanLiteral
src/solving/domain/goal.ts:129:24
     );
 
     const nowAchieved = count >= this.state.targetCompletions;
-    if (nowAchieved && !wasAchieved) {
+    if (nowAchieved && wasAchieved) {
       this.record(
         new GoalAchieved(
killedBy: Goal.progressTo fires GoalAchieved exactly once on crossing the target
statusReason: expected [ 'GoalProgressed' ] to deeply equal [ 'GoalProgressed', 'GoalAchieved' ]

[Killed] LogicalOperator
src/solving/domain/goal.ts:129:9
     );
 
     const nowAchieved = count >= this.state.targetCompletions;
-    if (nowAchieved && !wasAchieved) {
+    if (nowAchieved || !wasAchieved) {
       this.record(
         new GoalAchieved(
killedBy: Goal.progressTo records GoalProgressed on a change below target
statusReason: expected [ 'GoalProgressed', 'GoalAchieved' ] to deeply equal [ 'GoalProgressed' ]

[Killed] BlockStatement
src/solving/domain/goal.ts:150:44
   }
 
   // Map to/from persistence without the aggregate knowing about any storage technology.
-  static rehydrate(state: GoalState): Goal {
-    return new Goal(state);
-  }
+  static rehydrate(state: GoalState): Goal {}
 
   toState(): GoalState {
killedBy: Goal round-trip rehydrates from state without re-emitting events
statusReason: Cannot read properties of undefined (reading 'toState')

[Killed] BlockStatement
src/solving/domain/goal.ts:154:24
     return new Goal(state);
   }
 
-  toState(): GoalState {
-    return this.state;
-  }
+  toState(): GoalState {}
 
   // --- internals ---
killedBy: Goal use cases recomputeGoalProgress (derived from completions) derives current progress from the completion count and publishes GoalProgressed
statusReason: Cannot read properties of undefined (reading 'userId')
