[Killed] BlockStatement
src/solving/domain/photo.ts:13:36
 export class Photo {
   private constructor(readonly fileId: FileId) {}
 
-  static of(fileId: FileId): Photo {
-    return new Photo(fileId);
-  }
+  static of(fileId: FileId): Photo {}
 
   equals(other: Photo): boolean {
killedBy: Completion use cases startCompletion maps photo file ids onto the started completion
statusReason: Cannot read properties of undefined (reading 'fileId')

[Killed] BlockStatement
src/solving/domain/photo.ts:17:33
     return new Photo(fileId);
   }
 
-  equals(other: Photo): boolean {
-    return this.fileId === other.fileId;
-  }
+  equals(other: Photo): boolean {}
 }
 
killedBy: Photo compares by file id
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/solving/domain/photo.ts:18:12
   }
 
   equals(other: Photo): boolean {
-    return this.fileId === other.fileId;
+    return false;
   }
 }
killedBy: Photo compares by file id
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/solving/domain/photo.ts:18:12
   }
 
   equals(other: Photo): boolean {
-    return this.fileId === other.fileId;
+    return true;
   }
 }
killedBy: Photo compares by file id
statusReason: expected true to be false // Object.is equality
