[Killed] BlockStatement
src/solving/domain/puzzle-review.ts:22:66
     readonly text?: string,
   ) {}
 
-  static create(rating: StarRating, text?: string): PuzzleReview {
-    // Normalise an empty/whitespace-only text to undefined so persistence never stores "".
-    const trimmed = text?.trim();
-    return new PuzzleReview(
-      rating,
-      trimmed && trimmed.length > 0 ? trimmed : undefined,
-    );
-  }
+  static create(rating: StarRating, text?: string): PuzzleReview {}
 
   // Rehydrate from persisted (already-validated) columns.
killedBy: Completion.record records PuzzleReviewed when a review is supplied
statusReason: expected [ 'CompletionRecorded' ] to deeply equal [ 'CompletionRecorded', …(1) ]

[Killed] MethodExpression
src/solving/domain/puzzle-review.ts:24:21
 
   static create(rating: StarRating, text?: string): PuzzleReview {
     // Normalise an empty/whitespace-only text to undefined so persistence never stores "".
-    const trimmed = text?.trim();
+    const trimmed = text;
     return new PuzzleReview(
       rating,
killedBy: PuzzleReview carries the rating and trimmed text
statusReason: expected '  loved it  ' to be 'loved it' // Object.is equality

[Killed] OptionalChaining
src/solving/domain/puzzle-review.ts:24:21
 
   static create(rating: StarRating, text?: string): PuzzleReview {
     // Normalise an empty/whitespace-only text to undefined so persistence never stores "".
-    const trimmed = text?.trim();
+    const trimmed = text.trim();
     return new PuzzleReview(
       rating,
killedBy: PuzzleReview normalises empty/whitespace text to undefined
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] ConditionalExpression
src/solving/domain/puzzle-review.ts:27:7
     const trimmed = text?.trim();
     return new PuzzleReview(
       rating,
-      trimmed && trimmed.length > 0 ? trimmed : undefined,
+      true ? trimmed : undefined,
     );
   }
killedBy: PuzzleReview normalises empty/whitespace text to undefined
statusReason: expected '' to be undefined

[Killed] LogicalOperator
src/solving/domain/puzzle-review.ts:27:7
     const trimmed = text?.trim();
     return new PuzzleReview(
       rating,
-      trimmed && trimmed.length > 0 ? trimmed : undefined,
+      trimmed || trimmed.length > 0 ? trimmed : undefined,
     );
   }
killedBy: PuzzleReview normalises empty/whitespace text to undefined
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/solving/domain/puzzle-review.ts:32:60
   }
 
   // Rehydrate from persisted (already-validated) columns.
-  static fromState(state: PuzzleReviewState): PuzzleReview {
-    return new PuzzleReview(StarRating.fromState(state.rating), state.text);
-  }
+  static fromState(state: PuzzleReviewState): PuzzleReview {}
 
   toState(): PuzzleReviewState {
killedBy: PuzzleReview round-trips through state
statusReason: Cannot read properties of undefined (reading 'rating')

[Killed] BlockStatement
src/solving/domain/puzzle-review.ts:36:32
     return new PuzzleReview(StarRating.fromState(state.rating), state.text);
   }
 
-  toState(): PuzzleReviewState {
-    return { rating: this.rating.value, text: this.text };
-  }
+  toState(): PuzzleReviewState {}
 }
 
killedBy: PuzzleReview round-trips through state
statusReason: expected undefined to deeply equal { rating: 4, text: 'nice' }
