[Killed] StringLiteral
src/catalog/domain/proposal-status.ts:9:37
 export const ALLOWED_PROPOSAL_TRANSITIONS: Readonly<
   Record<ProposalStatus, readonly ProposalStatus[]>
 > = {
-  pending: ["approved", "rejected", "withdrawn"],
+  pending: ["approved", "rejected", ""],
   approved: [],
   rejected: [],
killedBy: edit cannot edit a decided or withdrawn proposal
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/catalog/domain/proposal-status.ts:9:25
 export const ALLOWED_PROPOSAL_TRANSITIONS: Readonly<
   Record<ProposalStatus, readonly ProposalStatus[]>
 > = {
-  pending: ["approved", "rejected", "withdrawn"],
+  pending: ["approved", "", "withdrawn"],
   approved: [],
   rejected: [],
killedBy: decision lifecycle reject stores the reason, stamps decidedAt, records ChangeProposalRejected carrying it
statusReason: expected false to be true // Object.is equality
