[Killed] StringLiteral
src/exchange/domain/exchange-kind.ts:15:73
 //   lend <-> "loan"
 export type LegacyExchangeKind = "trade" | "sale" | "loan";
 
-export const EXCHANGE_KINDS: readonly ExchangeKind[] = ["swap", "sale", "lend"];
+export const EXCHANGE_KINDS: readonly ExchangeKind[] = ["swap", "sale", ""];
 
killedBy: EXCHANGE_KINDS enumerates exactly the three supported kinds in their canonical order
statusReason: expected [ 'swap', 'sale', '' ] to deeply equal [ 'swap', 'sale', 'lend' ]
