[Killed] ArrayDeclaration
src/notifications/domain/channel.ts:6:45
 export type Channel = "inApp" | "email" | "push";
 
 // All channels, for iterating preferences and fan-out. Order is delivery-priority-agnostic.
-export const CHANNELS: readonly Channel[] = ["inApp", "email", "push"];
+export const CHANNELS: readonly Channel[] = [];
 
killedBy: NotificationPreference with a sparse (rehydrated) toggle map an explicit stored false always wins over the default (deliberate opt-outs are never overridden)
statusReason: expected {} to deeply equal { inApp: false, email: true, …(1) }

[Killed] StringLiteral
src/notifications/domain/channel.ts:6:46
 export type Channel = "inApp" | "email" | "push";
 
 // All channels, for iterating preferences and fan-out. Order is delivery-priority-agnostic.
-export const CHANNELS: readonly Channel[] = ["inApp", "email", "push"];
+export const CHANNELS: readonly Channel[] = ["", "email", "push"];
 
killedBy: NotificationPreference with a sparse (rehydrated) toggle map an explicit stored false always wins over the default (deliberate opt-outs are never overridden)
statusReason: expected { '': undefined, email: true, …(1) } to deeply equal { inApp: false, email: true, …(1) }
